#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionKeyGuideCondition

#include "Basic.hpp"

#include "TLScheme_structs.hpp"
#include "TLClient_structs.hpp"


namespace SDK::Params
{

// Function ActionKeyGuideCondition.ActionKeyGuideCondition_C.ExecuteUbergraph_ActionKeyGuideCondition
// 0x0024 (0x0024 - 0x0000)
struct ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 CallFunc_GetCurrentPlatform_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ID;                                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLMobiltyType                                K2Node_Event_MobilityType;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 CallFunc_GetCurrentPlatform_ReturnValue_1;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLUIPlatform                                 CallFunc_GetCurrentPlatform_ReturnValue_2;         // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLFishingState                               CallFunc_GetCurrentFishingState_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLFishingState                               CallFunc_GetCurrentFishingState_ReturnValue_1;     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLUIPlatform                                 CallFunc_GetCurrentPlatform_ReturnValue_3;         // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLFishingState                               CallFunc_GetCurrentFishingState_ReturnValue_2;     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_9;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_10;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLFishingState                               CallFunc_GetCurrentFishingState_ReturnValue_3;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_11;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition) == 0x000004, "Wrong alignment on ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition");
static_assert(sizeof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition) == 0x000024, "Wrong size on ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, EntryPoint) == 0x000000, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentPlatform_ReturnValue) == 0x000004, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_1) == 0x000006, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_2) == 0x000007, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_3) == 0x000008, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_4) == 0x000009, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_Event_ID) == 0x00000C, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_Event_ID' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_Event_MobilityType) == 0x000014, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_Event_MobilityType' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentPlatform_ReturnValue_1) == 0x000015, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_5) == 0x000016, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentPlatform_ReturnValue_2) == 0x000017, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentPlatform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_6) == 0x000018, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentFishingState_ReturnValue) == 0x000019, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentFishingState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentFishingState_ReturnValue_1) == 0x00001A, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentFishingState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_7) == 0x00001B, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_7' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_8) == 0x00001C, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_8' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentPlatform_ReturnValue_3) == 0x00001D, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentPlatform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentFishingState_ReturnValue_2) == 0x00001E, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentFishingState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_9) == 0x00001F, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_9' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_10) == 0x000020, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_10' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, CallFunc_GetCurrentFishingState_ReturnValue_3) == 0x000021, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::CallFunc_GetCurrentFishingState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition, K2Node_SwitchEnum_CmpSuccess_11) == 0x000022, "Member 'ActionKeyGuideCondition_C_ExecuteUbergraph_ActionKeyGuideCondition::K2Node_SwitchEnum_CmpSuccess_11' has a wrong offset!");

// Function ActionKeyGuideCondition.ActionKeyGuideCondition_C.OnChangePolymorph
// 0x000C (0x000C - 0x0000)
struct ActionKeyGuideCondition_C_OnChangePolymorph final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLMobiltyType                                MobilityType_0;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionKeyGuideCondition_C_OnChangePolymorph) == 0x000004, "Wrong alignment on ActionKeyGuideCondition_C_OnChangePolymorph");
static_assert(sizeof(ActionKeyGuideCondition_C_OnChangePolymorph) == 0x00000C, "Wrong size on ActionKeyGuideCondition_C_OnChangePolymorph");
static_assert(offsetof(ActionKeyGuideCondition_C_OnChangePolymorph, ID) == 0x000000, "Member 'ActionKeyGuideCondition_C_OnChangePolymorph::ID' has a wrong offset!");
static_assert(offsetof(ActionKeyGuideCondition_C_OnChangePolymorph, MobilityType_0) == 0x000008, "Member 'ActionKeyGuideCondition_C_OnChangePolymorph::MobilityType_0' has a wrong offset!");

}

