#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Azulejo

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Azulejo.AzulejoDecoyWidget
// 0x0088 (0x02E8 - 0x0260)
class UAzulejoDecoyWidget : public UUserWidget
{
public:
	int32                                         ComponentKey;                                      // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                ComponentPadding;                                  // 0x0264(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ComponentVersion;                                  // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ComponentDescription;                              // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawGuideLines;                                    // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ContentGuideLineColor;                             // 0x029C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ContentGuideLineStrokeWidth;                       // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           PaddingGuideLineColor;                             // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PaddingGuideLineStrokeWidth;                       // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                ReferenceWidgetClass;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ReferenceWidgetEmbeddingTargetCanvasName;          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x10];                                     // 0x02D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AzulejoDecoyWidget">();
	}
	static class UAzulejoDecoyWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAzulejoDecoyWidget>();
	}
};
static_assert(alignof(UAzulejoDecoyWidget) == 0x000008, "Wrong alignment on UAzulejoDecoyWidget");
static_assert(sizeof(UAzulejoDecoyWidget) == 0x0002E8, "Wrong size on UAzulejoDecoyWidget");
static_assert(offsetof(UAzulejoDecoyWidget, ComponentKey) == 0x000260, "Member 'UAzulejoDecoyWidget::ComponentKey' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, ComponentPadding) == 0x000264, "Member 'UAzulejoDecoyWidget::ComponentPadding' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, ComponentVersion) == 0x000278, "Member 'UAzulejoDecoyWidget::ComponentVersion' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, ComponentDescription) == 0x000288, "Member 'UAzulejoDecoyWidget::ComponentDescription' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, DrawGuideLines) == 0x000298, "Member 'UAzulejoDecoyWidget::DrawGuideLines' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, ContentGuideLineColor) == 0x00029C, "Member 'UAzulejoDecoyWidget::ContentGuideLineColor' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, ContentGuideLineStrokeWidth) == 0x0002AC, "Member 'UAzulejoDecoyWidget::ContentGuideLineStrokeWidth' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, PaddingGuideLineColor) == 0x0002B0, "Member 'UAzulejoDecoyWidget::PaddingGuideLineColor' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, PaddingGuideLineStrokeWidth) == 0x0002C0, "Member 'UAzulejoDecoyWidget::PaddingGuideLineStrokeWidth' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, ReferenceWidgetClass) == 0x0002C8, "Member 'UAzulejoDecoyWidget::ReferenceWidgetClass' has a wrong offset!");
static_assert(offsetof(UAzulejoDecoyWidget, ReferenceWidgetEmbeddingTargetCanvasName) == 0x0002D0, "Member 'UAzulejoDecoyWidget::ReferenceWidgetEmbeddingTargetCanvasName' has a wrong offset!");

// Class Azulejo.AzulejoHandlingWidget
// 0x0070 (0x02D0 - 0x0260)
class UAzulejoHandlingWidget : public UUserWidget
{
public:
	bool                                          DrawGrid;                                          // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           GridColor;                                         // 0x0264(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridStrokeWidth;                                   // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawAutoAlignGuide;                                // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           AutoAlignGuideSiderColor;                          // 0x027C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AutoAlignGuideCenterColor;                         // 0x028C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoAlignGuideStrokeWidth;                         // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawHandler;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HandlerColor;                                      // 0x02A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandlerStrokeWidth;                                // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InformMouseEventAlsoLinked;                        // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x17];                                     // 0x02B9(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AzulejoHandlingWidget">();
	}
	static class UAzulejoHandlingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAzulejoHandlingWidget>();
	}
};
static_assert(alignof(UAzulejoHandlingWidget) == 0x000008, "Wrong alignment on UAzulejoHandlingWidget");
static_assert(sizeof(UAzulejoHandlingWidget) == 0x0002D0, "Wrong size on UAzulejoHandlingWidget");
static_assert(offsetof(UAzulejoHandlingWidget, DrawGrid) == 0x000260, "Member 'UAzulejoHandlingWidget::DrawGrid' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, GridColor) == 0x000264, "Member 'UAzulejoHandlingWidget::GridColor' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, GridStrokeWidth) == 0x000274, "Member 'UAzulejoHandlingWidget::GridStrokeWidth' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, DrawAutoAlignGuide) == 0x000278, "Member 'UAzulejoHandlingWidget::DrawAutoAlignGuide' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, AutoAlignGuideSiderColor) == 0x00027C, "Member 'UAzulejoHandlingWidget::AutoAlignGuideSiderColor' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, AutoAlignGuideCenterColor) == 0x00028C, "Member 'UAzulejoHandlingWidget::AutoAlignGuideCenterColor' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, AutoAlignGuideStrokeWidth) == 0x00029C, "Member 'UAzulejoHandlingWidget::AutoAlignGuideStrokeWidth' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, DrawHandler) == 0x0002A0, "Member 'UAzulejoHandlingWidget::DrawHandler' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, HandlerColor) == 0x0002A4, "Member 'UAzulejoHandlingWidget::HandlerColor' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, HandlerStrokeWidth) == 0x0002B4, "Member 'UAzulejoHandlingWidget::HandlerStrokeWidth' has a wrong offset!");
static_assert(offsetof(UAzulejoHandlingWidget, InformMouseEventAlsoLinked) == 0x0002B8, "Member 'UAzulejoHandlingWidget::InformMouseEventAlsoLinked' has a wrong offset!");

// Class Azulejo.AzulejoInterface
// 0x0000 (0x0028 - 0x0028)
class IAzulejoInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AzulejoInterface">();
	}
	static class IAzulejoInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAzulejoInterface>();
	}
};
static_assert(alignof(IAzulejoInterface) == 0x000008, "Wrong alignment on IAzulejoInterface");
static_assert(sizeof(IAzulejoInterface) == 0x000028, "Wrong size on IAzulejoInterface");

// Class Azulejo.AzulejoLinkerWidget
// 0x0030 (0x0290 - 0x0260)
class UAzulejoLinkerWidget : public UUserWidget
{
public:
	bool                                          DrawGuideLines;                                    // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LinkedContentGuideLineColor;                       // 0x0264(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           LinkableContentGuideLineColor;                     // 0x0274(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ContentGuideLineStrokeWidth;                       // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AzulejoLinkerWidget">();
	}
	static class UAzulejoLinkerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAzulejoLinkerWidget>();
	}
};
static_assert(alignof(UAzulejoLinkerWidget) == 0x000008, "Wrong alignment on UAzulejoLinkerWidget");
static_assert(sizeof(UAzulejoLinkerWidget) == 0x000290, "Wrong size on UAzulejoLinkerWidget");
static_assert(offsetof(UAzulejoLinkerWidget, DrawGuideLines) == 0x000260, "Member 'UAzulejoLinkerWidget::DrawGuideLines' has a wrong offset!");
static_assert(offsetof(UAzulejoLinkerWidget, LinkedContentGuideLineColor) == 0x000264, "Member 'UAzulejoLinkerWidget::LinkedContentGuideLineColor' has a wrong offset!");
static_assert(offsetof(UAzulejoLinkerWidget, LinkableContentGuideLineColor) == 0x000274, "Member 'UAzulejoLinkerWidget::LinkableContentGuideLineColor' has a wrong offset!");
static_assert(offsetof(UAzulejoLinkerWidget, ContentGuideLineStrokeWidth) == 0x000284, "Member 'UAzulejoLinkerWidget::ContentGuideLineStrokeWidth' has a wrong offset!");

}

