#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BG_Decal_Phys_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "TLScene_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BG_Decal_Phys_BP.BG_Decal_Phys_BP_C
// 0x0028 (0x0258 - 0x0230)
class ABG_Decal_Phys_BP_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EDetailModeBP                                 DetailMode;                                        // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BG_Decal_Phys_BP(int32 EntryPoint);
	void BndEvt__BG_Decal_Phys_BP_Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BG_Decal_Phys_BP_C">();
	}
	static class ABG_Decal_Phys_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABG_Decal_Phys_BP_C>();
	}
};
static_assert(alignof(ABG_Decal_Phys_BP_C) == 0x000008, "Wrong alignment on ABG_Decal_Phys_BP_C");
static_assert(sizeof(ABG_Decal_Phys_BP_C) == 0x000258, "Wrong size on ABG_Decal_Phys_BP_C");
static_assert(offsetof(ABG_Decal_Phys_BP_C, UberGraphFrame) == 0x000230, "Member 'ABG_Decal_Phys_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABG_Decal_Phys_BP_C, Decal) == 0x000238, "Member 'ABG_Decal_Phys_BP_C::Decal' has a wrong offset!");
static_assert(offsetof(ABG_Decal_Phys_BP_C, Box) == 0x000240, "Member 'ABG_Decal_Phys_BP_C::Box' has a wrong offset!");
static_assert(offsetof(ABG_Decal_Phys_BP_C, DefaultSceneRoot) == 0x000248, "Member 'ABG_Decal_Phys_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABG_Decal_Phys_BP_C, DetailMode) == 0x000250, "Member 'ABG_Decal_Phys_BP_C::DetailMode' has a wrong offset!");

}

