#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BG_SplineActor_Spline_Data

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BG_SplineActor_Spline_Data.BG_SplineActor_Spline_Data
// 0x0050 (0x0050 - 0x0000)
struct FBG_SplineActor_Spline_Data final
{
public:
	struct FVector                                Pos_24_9EFE32DB4C537F374DDDD2A5A53D0628;           // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Roll_21_840492154C10649785BAAF8F4AAF7990;          // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale_22_C335AFB846432B50A3500FA18D767BF1;         // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh_30_FFC1F4B74A07422169724FA9B909F946;          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstance*>              Material_45_6A348E1E44D6D2A5C10BD5AA9DC27E8C;      // 0x0030(0x0010)(Edit, BlueprintVisible)
	float                                         UV_Tiling_37_91CFAEFB4FD1C30C7E4C50BECDC1850E;     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UV_Tiling_Y_Scale_39_E031B24F48989D7B5601A3BE252948B5; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UV_Rotation_44_9BD125D84787BDD83E63FEBB84D13953;   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBG_SplineActor_Spline_Data) == 0x000008, "Wrong alignment on FBG_SplineActor_Spline_Data");
static_assert(sizeof(FBG_SplineActor_Spline_Data) == 0x000050, "Wrong size on FBG_SplineActor_Spline_Data");
static_assert(offsetof(FBG_SplineActor_Spline_Data, Pos_24_9EFE32DB4C537F374DDDD2A5A53D0628) == 0x000000, "Member 'FBG_SplineActor_Spline_Data::Pos_24_9EFE32DB4C537F374DDDD2A5A53D0628' has a wrong offset!");
static_assert(offsetof(FBG_SplineActor_Spline_Data, Roll_21_840492154C10649785BAAF8F4AAF7990) == 0x00000C, "Member 'FBG_SplineActor_Spline_Data::Roll_21_840492154C10649785BAAF8F4AAF7990' has a wrong offset!");
static_assert(offsetof(FBG_SplineActor_Spline_Data, Scale_22_C335AFB846432B50A3500FA18D767BF1) == 0x000018, "Member 'FBG_SplineActor_Spline_Data::Scale_22_C335AFB846432B50A3500FA18D767BF1' has a wrong offset!");
static_assert(offsetof(FBG_SplineActor_Spline_Data, Mesh_30_FFC1F4B74A07422169724FA9B909F946) == 0x000028, "Member 'FBG_SplineActor_Spline_Data::Mesh_30_FFC1F4B74A07422169724FA9B909F946' has a wrong offset!");
static_assert(offsetof(FBG_SplineActor_Spline_Data, Material_45_6A348E1E44D6D2A5C10BD5AA9DC27E8C) == 0x000030, "Member 'FBG_SplineActor_Spline_Data::Material_45_6A348E1E44D6D2A5C10BD5AA9DC27E8C' has a wrong offset!");
static_assert(offsetof(FBG_SplineActor_Spline_Data, UV_Tiling_37_91CFAEFB4FD1C30C7E4C50BECDC1850E) == 0x000040, "Member 'FBG_SplineActor_Spline_Data::UV_Tiling_37_91CFAEFB4FD1C30C7E4C50BECDC1850E' has a wrong offset!");
static_assert(offsetof(FBG_SplineActor_Spline_Data, UV_Tiling_Y_Scale_39_E031B24F48989D7B5601A3BE252948B5) == 0x000044, "Member 'FBG_SplineActor_Spline_Data::UV_Tiling_Y_Scale_39_E031B24F48989D7B5601A3BE252948B5' has a wrong offset!");
static_assert(offsetof(FBG_SplineActor_Spline_Data, UV_Rotation_44_9BD125D84787BDD83E63FEBB84D13953) == 0x000048, "Member 'FBG_SplineActor_Spline_Data::UV_Rotation_44_9BD125D84787BDD83E63FEBB84D13953' has a wrong offset!");

}

