#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Arena_TierTeamIcon_Small1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Arena_TierTeamIcon_Small1.BP_Arena_TierTeamIcon_Small1_C
// 0x0030 (0x0AC0 - 0x0A90)
class UBP_Arena_TierTeamIcon_Small1_C final : public UTLUserWidgetArenaPartyIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               IconImg;                                           // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IconImg_FX;                                        // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_214;                                     // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                Path_IconFL_FX;                                    // 0x0AB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Arena_TierTeamIcon_Small1(int32 EntryPoint);
	void OnSetPartyType(ETLArenaPartyType InType);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Arena_TierTeamIcon_Small1_C">();
	}
	static class UBP_Arena_TierTeamIcon_Small1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Arena_TierTeamIcon_Small1_C>();
	}
};
static_assert(alignof(UBP_Arena_TierTeamIcon_Small1_C) == 0x000008, "Wrong alignment on UBP_Arena_TierTeamIcon_Small1_C");
static_assert(sizeof(UBP_Arena_TierTeamIcon_Small1_C) == 0x000AC0, "Wrong size on UBP_Arena_TierTeamIcon_Small1_C");
static_assert(offsetof(UBP_Arena_TierTeamIcon_Small1_C, UberGraphFrame) == 0x000A90, "Member 'UBP_Arena_TierTeamIcon_Small1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Arena_TierTeamIcon_Small1_C, IconImg) == 0x000A98, "Member 'UBP_Arena_TierTeamIcon_Small1_C::IconImg' has a wrong offset!");
static_assert(offsetof(UBP_Arena_TierTeamIcon_Small1_C, IconImg_FX) == 0x000AA0, "Member 'UBP_Arena_TierTeamIcon_Small1_C::IconImg_FX' has a wrong offset!");
static_assert(offsetof(UBP_Arena_TierTeamIcon_Small1_C, TLSizeBox_214) == 0x000AA8, "Member 'UBP_Arena_TierTeamIcon_Small1_C::TLSizeBox_214' has a wrong offset!");
static_assert(offsetof(UBP_Arena_TierTeamIcon_Small1_C, Path_IconFL_FX) == 0x000AB0, "Member 'UBP_Arena_TierTeamIcon_Small1_C::Path_IconFL_FX' has a wrong offset!");

}

