#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AreaEnterLeaveMessage

#include "Basic.hpp"

#include "TLScheme_structs.hpp"
#include "TLClient_structs.hpp"


namespace SDK::Params
{

// Function BP_AreaEnterLeaveMessage.BP_AreaEnterLeaveMessage_C.ExecuteUbergraph_BP_AreaEnterLeaveMessage
// 0x17E8 (0x17E8 - 0x0000)
struct BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage;          // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage;           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage; // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_1;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_1; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_1; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_2;        // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_2;         // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_2; // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_2; // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_16;                        // 0x0040(0x0140)(ConstParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_15;                        // 0x0188(0x0140)(ConstParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_3;        // 0x02D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_3;         // 0x02DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_3; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_3; // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E7[0x1];                                      // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_1; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_14;                        // 0x02F0(0x0140)(ConstParm)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x0434(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x043C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_13;                        // 0x0448(0x0140)(ConstParm)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58A[0x2];                                      // 0x058A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_2; // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_4;        // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_4;         // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_4; // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_4; // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA[0x2];                                      // 0x05AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_5;        // 0x05AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_5;         // 0x05B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_5; // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_5; // 0x05BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE[0x2];                                      // 0x05BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_3; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_12;                        // 0x05C8(0x0140)(ConstParm)
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_11;                        // 0x0710(0x0140)(ConstParm)
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_4; // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x0854(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_6;        // 0x085C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_6;         // 0x0864(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_6; // 0x086C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_6; // 0x086D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86E[0x2];                                      // 0x086E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_5; // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_2;        // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_875[0x3];                                      // 0x0875(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_10;                        // 0x0878(0x0140)(ConstParm)
	bool                                          CallFunc_IsSiegePolymorph_ReturnValue;             // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B9[0x7];                                      // 0x09B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSiegePolymorphName_ReturnValue;        // 0x09C0(0x0018)()
	class FName                                   CallFunc_Array_Get_Item_7;                         // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_8;                         // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_9;                         // 0x09E8(0x0140)(ConstParm)
	class FName                                   CallFunc_Array_Get_Item_9;                         // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_6; // 0x0B30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_7;        // 0x0B34(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_7;         // 0x0B3C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_7; // 0x0B44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_7; // 0x0B45(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B46[0x2];                                      // 0x0B46(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_7; // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_3;        // 0x0B4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4D[0x3];                                      // 0x0B4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_8;                         // 0x0B50(0x0140)(ConstParm)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_8;        // 0x0C90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_8;         // 0x0C98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_8; // 0x0CA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_8; // 0x0CA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA2[0x2];                                      // 0x0CA2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_10;                        // 0x0CA4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_7;                         // 0x0CB0(0x0140)(ConstParm)
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_8; // 0x0DF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_9;        // 0x0DF4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_9;         // 0x0DFC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_9; // 0x0E04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_9; // 0x0E05(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSiegeProgress_ReturnValue;              // 0x0E06(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E07[0x1];                                      // 0x0E07(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_11;                        // 0x0E08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_4;        // 0x0E10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSiegeStandby_ReturnValue;               // 0x0E11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSiegeEntered_ReturnValue;               // 0x0E12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E13[0x1];                                      // 0x0E13(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_12;                        // 0x0E14(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_13;                        // 0x0E1C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E24[0x4];                                      // 0x0E24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_6;                         // 0x0E28(0x0140)(ConstParm)
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_9; // 0x0F68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_10;       // 0x0F6C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_10;        // 0x0F74(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_10; // 0x0F7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_10; // 0x0F7D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSiegeProgress_ReturnValue_1;            // 0x0F7E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F7F[0x1];                                      // 0x0F7F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_5;                         // 0x0F80(0x0140)(ConstParm)
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_4;                         // 0x10C0(0x0140)(ConstParm)
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_3;                         // 0x1200(0x0140)(ConstParm)
	class FName                                   CallFunc_Array_Get_Item_14;                        // 0x1340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_15;                        // 0x1348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_11;       // 0x1350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_11;        // 0x1358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_11; // 0x1360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_11; // 0x1361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1362[0x2];                                     // 0x1362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_12;       // 0x1364(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_12;        // 0x136C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_12; // 0x1374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_12; // 0x1375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_5;        // 0x1376(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_6;        // 0x1377(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_2;                         // 0x1378(0x0140)(ConstParm)
	bool                                          CallFunc_IsSiegePolymorph_ReturnValue_1;           // 0x14B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B9[0x7];                                     // 0x14B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSiegePolymorphName_ReturnValue_1;      // 0x14C0(0x0018)()
	class FName                                   CallFunc_Array_Get_Item_16;                        // 0x14D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_17;                        // 0x14E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_18;                        // 0x14E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_10; // 0x14F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14F4[0x4];                                     // 0x14F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam_1;                         // 0x14F8(0x0140)(ConstParm)
	bool                                          CallFunc_IsSiegePolymorph_ReturnValue_2;           // 0x1638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1639[0x7];                                     // 0x1639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSiegePolymorphName_ReturnValue_2;      // 0x1640(0x0018)()
	class FName                                   CallFunc_Array_Get_Item_19;                        // 0x1658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTLContentsScreenMsgParams             K2Node_Event_InMsgParam;                           // 0x1660(0x0140)(ConstParm)
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_11; // 0x17A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_7;        // 0x17A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A5[0x3];                                     // 0x17A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_13;       // 0x17A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_13;        // 0x17B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_13; // 0x17B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_13; // 0x17B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17BA[0x2];                                     // 0x17BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Set_System_Message_ScreeMesaage_14;       // 0x17BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Set_System_Message_ChatMessage_14;        // 0x17C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_System_Message_ShowScreenSystemMessage_14; // 0x17CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_System_Message_ShowChatSystemMessage_14; // 0x17CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17CE[0x2];                                     // 0x17CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_20;                        // 0x17D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Join_Contents_NewParam;                // 0x17D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D9[0x3];                                     // 0x17D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_12; // 0x17DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x17E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E1[0x3];                                     // 0x17E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Region_Type_to_Integer_IntRegionType_13; // 0x17E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage) == 0x000008, "Wrong alignment on BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage");
static_assert(sizeof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage) == 0x0017E8, "Wrong size on BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, EntryPoint) == 0x000000, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage) == 0x000004, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage) == 0x00000C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage) == 0x000014, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage) == 0x000015, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_1) == 0x000018, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_1) == 0x000020, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_1) == 0x000028, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_1) == 0x000029, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_2) == 0x00002C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_2' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_2) == 0x000034, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_2' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_2) == 0x00003C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_2' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_2) == 0x00003D, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_2' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_16) == 0x000040, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_16' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item) == 0x000180, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_15) == 0x000188, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_15' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_1) == 0x0002C8, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType) == 0x0002D0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_3) == 0x0002D4, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_3) == 0x0002DC, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_3) == 0x0002E4, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_3) == 0x0002E5, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_SwitchEnum_CmpSuccess) == 0x0002E6, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_1) == 0x0002E8, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_14) == 0x0002F0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_14' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000430, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_2) == 0x000434, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_3) == 0x00043C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_13) == 0x000448, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_13' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_NotEqual_TextText_ReturnValue) == 0x000588, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000589, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_2) == 0x00058C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_2' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_4) == 0x000590, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_4) == 0x000598, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_4) == 0x0005A0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_4) == 0x0005A8, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_4) == 0x0005A9, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_5) == 0x0005AC, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_5' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_5) == 0x0005B4, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_5' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_5) == 0x0005BC, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_5' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_5) == 0x0005BD, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_5' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_3) == 0x0005C0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x0005C4, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_12) == 0x0005C8, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_12' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_5) == 0x000708, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_11) == 0x000710, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_11' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_4) == 0x000850, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_6) == 0x000854, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_6) == 0x00085C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_6' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_6) == 0x000864, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_6' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_6) == 0x00086C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_6' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_6) == 0x00086D, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_6' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_5) == 0x000870, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_5' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_EqualEqual_TextText_ReturnValue_2) == 0x000874, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_EqualEqual_TextText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_10) == 0x000878, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_10' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_IsSiegePolymorph_ReturnValue) == 0x0009B8, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_IsSiegePolymorph_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_GetSiegePolymorphName_ReturnValue) == 0x0009C0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_GetSiegePolymorphName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_7) == 0x0009D8, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_8) == 0x0009E0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_9) == 0x0009E8, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_9' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_9) == 0x000B28, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_6) == 0x000B30, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_6' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_7) == 0x000B34, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_7' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_7) == 0x000B3C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_7' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_7) == 0x000B44, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_7' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_7) == 0x000B45, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_7' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_7) == 0x000B48, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_7' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_EqualEqual_TextText_ReturnValue_3) == 0x000B4C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_EqualEqual_TextText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_8) == 0x000B50, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_8' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_8) == 0x000C90, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_8' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_8) == 0x000C98, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_8' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_8) == 0x000CA0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_8' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_8) == 0x000CA1, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_8' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_10) == 0x000CA4, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_7) == 0x000CB0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_7' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_8) == 0x000DF0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_8' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_9) == 0x000DF4, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_9' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_9) == 0x000DFC, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_9' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_9) == 0x000E04, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_9' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_9) == 0x000E05, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_9' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_IsSiegeProgress_ReturnValue) == 0x000E06, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_IsSiegeProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_11) == 0x000E08, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_11' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_EqualEqual_TextText_ReturnValue_4) == 0x000E10, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_EqualEqual_TextText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_IsSiegeStandby_ReturnValue) == 0x000E11, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_IsSiegeStandby_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_IsSiegeEntered_ReturnValue) == 0x000E12, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_IsSiegeEntered_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_12) == 0x000E14, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_12' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_13) == 0x000E1C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_13' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_6) == 0x000E28, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_6' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Convert_Region_Type_to_Integer_IntRegionType_9) == 0x000F68, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Convert_Region_Type_to_Integer_IntRegionType_9' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_10) == 0x000F6C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_10' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_10) == 0x000F74, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_10' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_10) == 0x000F7C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_10' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_10) == 0x000F7D, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_10' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_IsSiegeProgress_ReturnValue_1) == 0x000F7E, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_IsSiegeProgress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_5) == 0x000F80, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_5' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_4) == 0x0010C0, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_4' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, K2Node_Event_InMsgParam_3) == 0x001200, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::K2Node_Event_InMsgParam_3' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_14) == 0x001340, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_14' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Array_Get_Item_15) == 0x001348, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Array_Get_Item_15' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_11) == 0x001350, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_11' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_11) == 0x001358, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_11' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_11) == 0x001360, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_11' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowChatSystemMessage_11) == 0x001361, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowChatSystemMessage_11' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ScreeMesaage_12) == 0x001364, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ScreeMesaage_12' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ChatMessage_12) == 0x00136C, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ChatMessage_12' has a wrong offset!");
static_assert(offsetof(BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage, CallFunc_Set_System_Message_ShowScreenSystemMessage_12) == 0x001374, "Member 'BP_AreaEnterLeaveMessage_C_ExecuteUbergraph_BP_AreaEnterLeaveMessage::CallFunc_Set_System_Message_ShowScreenSystemMessage_12' has a wrong offset!");
