#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BTN_ContextMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BTN_ContextMenu.BP_BTN_ContextMenu_C
// 0x0038 (0x1100 - 0x10C8)
class UBP_BTN_ContextMenu_C final : public UTLUserWidgetContextMenuBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x10D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x10D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x10E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_ContextMenu_Desire_C*               BP_ContextMenu_Desire;                             // 0x10E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ContextMenu_SecondActionIcon_C*     BP_ContextMenu_SecondActionIcon;                   // 0x10F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IMG_KeyIcon;                                       // 0x10F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BTN_ContextMenu(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BTN_ContextMenu_C">();
	}
	static class UBP_BTN_ContextMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BTN_ContextMenu_C>();
	}
};
static_assert(alignof(UBP_BTN_ContextMenu_C) == 0x000008, "Wrong alignment on UBP_BTN_ContextMenu_C");
static_assert(sizeof(UBP_BTN_ContextMenu_C) == 0x001100, "Wrong size on UBP_BTN_ContextMenu_C");
static_assert(offsetof(UBP_BTN_ContextMenu_C, UberGraphFrame) == 0x0010C8, "Member 'UBP_BTN_ContextMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BTN_ContextMenu_C, ShowAnim) == 0x0010D0, "Member 'UBP_BTN_ContextMenu_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_BTN_ContextMenu_C, Press) == 0x0010D8, "Member 'UBP_BTN_ContextMenu_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_BTN_ContextMenu_C, Hover) == 0x0010E0, "Member 'UBP_BTN_ContextMenu_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_BTN_ContextMenu_C, BP_ContextMenu_Desire) == 0x0010E8, "Member 'UBP_BTN_ContextMenu_C::BP_ContextMenu_Desire' has a wrong offset!");
static_assert(offsetof(UBP_BTN_ContextMenu_C, BP_ContextMenu_SecondActionIcon) == 0x0010F0, "Member 'UBP_BTN_ContextMenu_C::BP_ContextMenu_SecondActionIcon' has a wrong offset!");
static_assert(offsetof(UBP_BTN_ContextMenu_C, IMG_KeyIcon) == 0x0010F8, "Member 'UBP_BTN_ContextMenu_C::IMG_KeyIcon' has a wrong offset!");

}

