#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonContextMenu_BTN

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_BalloonContextMenu_BTN.BP_BalloonContextMenu_BTN_C.ExecuteUbergraph_BP_BalloonContextMenu_BTN
// 0x0038 (0x0038 - 0x0000)
struct BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLUIPlatform                                 CallFunc_GetUIPlatform_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN) == 0x000008, "Wrong alignment on BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN");
static_assert(sizeof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN) == 0x000038, "Wrong size on BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN, EntryPoint) == 0x000000, "Member 'BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN, CallFunc_GetUIPlatform_ReturnValue) == 0x000005, "Member 'BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN::CallFunc_GetUIPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN, CallFunc_SetVisible_self_CastInput_1) == 0x000018, "Member 'BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_BalloonContextMenu_BTN_C_ExecuteUbergraph_BP_BalloonContextMenu_BTN::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_BalloonContextMenu_BTN.BP_BalloonContextMenu_BTN_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_BalloonContextMenu_BTN_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BalloonContextMenu_BTN_C_PreConstruct) == 0x000001, "Wrong alignment on BP_BalloonContextMenu_BTN_C_PreConstruct");
static_assert(sizeof(BP_BalloonContextMenu_BTN_C_PreConstruct) == 0x000001, "Wrong size on BP_BalloonContextMenu_BTN_C_PreConstruct");
static_assert(offsetof(BP_BalloonContextMenu_BTN_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_BalloonContextMenu_BTN_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

