#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonContextMenuFrame

#include "Basic.hpp"

#include "TLClient_structs.hpp"


namespace SDK::Params
{

// Function BP_BalloonContextMenuFrame.BP_BalloonContextMenuFrame_C.ExecuteUbergraph_BP_BalloonContextMenuFrame
// 0x0028 (0x0028 - 0x0000)
struct BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLMenuGroupPanel                      K2Node_MakeStruct_TLMenuGroupPanel;                // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference)
	TArray<struct FTLMenuGroupPanel>              K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame) == 0x000008, "Wrong alignment on BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame");
static_assert(sizeof(BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame) == 0x000028, "Wrong size on BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame");
static_assert(offsetof(BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame, EntryPoint) == 0x000000, "Member 'BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame, K2Node_MakeStruct_TLMenuGroupPanel) == 0x000008, "Member 'BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame::K2Node_MakeStruct_TLMenuGroupPanel' has a wrong offset!");
static_assert(offsetof(BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_BalloonContextMenuFrame_C_ExecuteUbergraph_BP_BalloonContextMenuFrame::K2Node_MakeArray_Array' has a wrong offset!");

}

