#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextMenu_MainActionIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextMenu_MainActionIcon.BP_ContextMenu_MainActionIcon_C.ExecuteUbergraph_BP_ContextMenu_MainActionIcon
// 0x0020 (0x0020 - 0x0000)
struct BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InPercent;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon) == 0x000008, "Wrong alignment on BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon");
static_assert(sizeof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon) == 0x000020, "Wrong size on BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon, EntryPoint) == 0x000000, "Member 'BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon, K2Node_ComponentBoundEvent_InPercent) == 0x000008, "Member 'BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon::K2Node_ComponentBoundEvent_InPercent' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon, CallFunc_PauseAnimation_ReturnValue) == 0x000010, "Member 'BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BP_ContextMenu_MainActionIcon_C_ExecuteUbergraph_BP_ContextMenu_MainActionIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_ContextMenu_MainActionIcon.BP_ContextMenu_MainActionIcon_C.BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_ContextMenu_MainActionIcon_C_BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextMenu_MainActionIcon_C_BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature) == 0x000004, "Wrong alignment on BP_ContextMenu_MainActionIcon_C_BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature");
static_assert(sizeof(BP_ContextMenu_MainActionIcon_C_BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature) == 0x000004, "Wrong size on BP_ContextMenu_MainActionIcon_C_BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature, InPercent) == 0x000000, "Member 'BP_ContextMenu_MainActionIcon_C_BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature::InPercent' has a wrong offset!");

// Function BP_ContextMenu_MainActionIcon.BP_ContextMenu_MainActionIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextMenu_MainActionIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ContextMenu_MainActionIcon_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ContextMenu_MainActionIcon_C_PreConstruct");
static_assert(sizeof(BP_ContextMenu_MainActionIcon_C_PreConstruct) == 0x000001, "Wrong size on BP_ContextMenu_MainActionIcon_C_PreConstruct");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ContextMenu_MainActionIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_ContextMenu_MainActionIcon.BP_ContextMenu_MainActionIcon_C.FnSetCoOpColor
// 0x0048 (0x0048 - 0x0000)
struct BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor final
{
public:
	bool                                          MyCoop;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_3;                   // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetBrushByName_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_1;             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor) == 0x000004, "Wrong alignment on BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor");
static_assert(sizeof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor) == 0x000048, "Wrong size on BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor, MyCoop) == 0x000000, "Member 'BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor::MyCoop' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor, K2Node_MakeStruct_LinearColor_1) == 0x000014, "Member 'BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor, K2Node_MakeStruct_LinearColor_2) == 0x000024, "Member 'BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor, K2Node_MakeStruct_LinearColor_3) == 0x000034, "Member 'BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor::K2Node_MakeStruct_LinearColor_3' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor, CallFunc_SetBrushByName_ReturnValue) == 0x000044, "Member 'BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor::CallFunc_SetBrushByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor, CallFunc_SetBrushByName_ReturnValue_1) == 0x000045, "Member 'BP_ContextMenu_MainActionIcon_C_FnSetCoOpColor::CallFunc_SetBrushByName_ReturnValue_1' has a wrong offset!");

}

