#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CostumeSystem_Armor_Style

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CostumeSystem_Armor_Style.BP_CostumeSystem_Armor_Style_C
// 0x0038 (0x0AF8 - 0x0AC0)
class UBP_CostumeSystem_Armor_Style_C final : public UTLUserWidgetArmorCostumeTooltipCustomizeInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_UI_Slot_Texture_C*                  BP_UI_Slot_Texture;                                // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Image_Icon;                                        // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLDynamicEntryBox*                     TLDynamicEntryBox_Icon;                            // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_26;                                // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_78;                                        // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_27;                                    // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CostumeSystem_Armor_Style(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CostumeSystem_Armor_Style_C">();
	}
	static class UBP_CostumeSystem_Armor_Style_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CostumeSystem_Armor_Style_C>();
	}
};
static_assert(alignof(UBP_CostumeSystem_Armor_Style_C) == 0x000008, "Wrong alignment on UBP_CostumeSystem_Armor_Style_C");
static_assert(sizeof(UBP_CostumeSystem_Armor_Style_C) == 0x000AF8, "Wrong size on UBP_CostumeSystem_Armor_Style_C");
static_assert(offsetof(UBP_CostumeSystem_Armor_Style_C, UberGraphFrame) == 0x000AC0, "Member 'UBP_CostumeSystem_Armor_Style_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CostumeSystem_Armor_Style_C, BP_UI_Slot_Texture) == 0x000AC8, "Member 'UBP_CostumeSystem_Armor_Style_C::BP_UI_Slot_Texture' has a wrong offset!");
static_assert(offsetof(UBP_CostumeSystem_Armor_Style_C, Image_Icon) == 0x000AD0, "Member 'UBP_CostumeSystem_Armor_Style_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UBP_CostumeSystem_Armor_Style_C, TLDynamicEntryBox_Icon) == 0x000AD8, "Member 'UBP_CostumeSystem_Armor_Style_C::TLDynamicEntryBox_Icon' has a wrong offset!");
static_assert(offsetof(UBP_CostumeSystem_Armor_Style_C, TLHorizontalBox_26) == 0x000AE0, "Member 'UBP_CostumeSystem_Armor_Style_C::TLHorizontalBox_26' has a wrong offset!");
static_assert(offsetof(UBP_CostumeSystem_Armor_Style_C, TLImage_78) == 0x000AE8, "Member 'UBP_CostumeSystem_Armor_Style_C::TLImage_78' has a wrong offset!");
static_assert(offsetof(UBP_CostumeSystem_Armor_Style_C, TLTextBlock_27) == 0x000AF0, "Member 'UBP_CostumeSystem_Armor_Style_C::TLTextBlock_27' has a wrong offset!");

}

