#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomSceneCamera

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CustomSceneCamera.BP_CustomSceneCamera_C.ExecuteUbergraph_BP_CustomSceneCamera
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PC;                                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PC_1;                                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera) == 0x000008, "Wrong alignment on BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera");
static_assert(sizeof(BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera) == 0x000018, "Wrong size on BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera");
static_assert(offsetof(BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera, EntryPoint) == 0x000000, "Member 'BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera, K2Node_Event_PC) == 0x000008, "Member 'BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera::K2Node_Event_PC' has a wrong offset!");
static_assert(offsetof(BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera, K2Node_Event_PC_1) == 0x000010, "Member 'BP_CustomSceneCamera_C_ExecuteUbergraph_BP_CustomSceneCamera::K2Node_Event_PC_1' has a wrong offset!");

// Function BP_CustomSceneCamera.BP_CustomSceneCamera_C.K2_OnEndViewTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_CustomSceneCamera_C_K2_OnEndViewTarget final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomSceneCamera_C_K2_OnEndViewTarget) == 0x000008, "Wrong alignment on BP_CustomSceneCamera_C_K2_OnEndViewTarget");
static_assert(sizeof(BP_CustomSceneCamera_C_K2_OnEndViewTarget) == 0x000008, "Wrong size on BP_CustomSceneCamera_C_K2_OnEndViewTarget");
static_assert(offsetof(BP_CustomSceneCamera_C_K2_OnEndViewTarget, PC) == 0x000000, "Member 'BP_CustomSceneCamera_C_K2_OnEndViewTarget::PC' has a wrong offset!");

// Function BP_CustomSceneCamera.BP_CustomSceneCamera_C.K2_OnBecomeViewTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_CustomSceneCamera_C_K2_OnBecomeViewTarget final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomSceneCamera_C_K2_OnBecomeViewTarget) == 0x000008, "Wrong alignment on BP_CustomSceneCamera_C_K2_OnBecomeViewTarget");
static_assert(sizeof(BP_CustomSceneCamera_C_K2_OnBecomeViewTarget) == 0x000008, "Wrong size on BP_CustomSceneCamera_C_K2_OnBecomeViewTarget");
static_assert(offsetof(BP_CustomSceneCamera_C_K2_OnBecomeViewTarget, PC) == 0x000000, "Member 'BP_CustomSceneCamera_C_K2_OnBecomeViewTarget::PC' has a wrong offset!");

// Function BP_CustomSceneCamera.BP_CustomSceneCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CustomSceneCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomSceneCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CustomSceneCamera_C_ReceiveTick");
static_assert(sizeof(BP_CustomSceneCamera_C_ReceiveTick) == 0x000004, "Wrong size on BP_CustomSceneCamera_C_ReceiveTick");
static_assert(offsetof(BP_CustomSceneCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CustomSceneCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CustomSceneCamera.BP_CustomSceneCamera_C.ActivateCustomCamera
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomSceneCamera_C_ActivateCustomCamera final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomSceneCamera_C_ActivateCustomCamera) == 0x000008, "Wrong alignment on BP_CustomSceneCamera_C_ActivateCustomCamera");
static_assert(sizeof(BP_CustomSceneCamera_C_ActivateCustomCamera) == 0x000018, "Wrong size on BP_CustomSceneCamera_C_ActivateCustomCamera");
static_assert(offsetof(BP_CustomSceneCamera_C_ActivateCustomCamera, bActivate) == 0x000000, "Member 'BP_CustomSceneCamera_C_ActivateCustomCamera::bActivate' has a wrong offset!");
static_assert(offsetof(BP_CustomSceneCamera_C_ActivateCustomCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_CustomSceneCamera_C_ActivateCustomCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomSceneCamera_C_ActivateCustomCamera, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000010, "Member 'BP_CustomSceneCamera_C_ActivateCustomCamera::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_CustomSceneCamera.BP_CustomSceneCamera_C.Init
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomSceneCamera_C_Init final
{
public:
	class ATLCustomSceneControlActor*             InCustomSceneActor;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CustomScene_MagicDoll_C*            K2Node_DynamicCast_AsBP_Custom_Scene_Magic_Doll;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomSceneCamera_C_Init) == 0x000008, "Wrong alignment on BP_CustomSceneCamera_C_Init");
static_assert(sizeof(BP_CustomSceneCamera_C_Init) == 0x000018, "Wrong size on BP_CustomSceneCamera_C_Init");
static_assert(offsetof(BP_CustomSceneCamera_C_Init, InCustomSceneActor) == 0x000000, "Member 'BP_CustomSceneCamera_C_Init::InCustomSceneActor' has a wrong offset!");
static_assert(offsetof(BP_CustomSceneCamera_C_Init, K2Node_DynamicCast_AsBP_Custom_Scene_Magic_Doll) == 0x000008, "Member 'BP_CustomSceneCamera_C_Init::K2Node_DynamicCast_AsBP_Custom_Scene_Magic_Doll' has a wrong offset!");
static_assert(offsetof(BP_CustomSceneCamera_C_Init, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CustomSceneCamera_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

