#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomSceneCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLScene_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomSceneCamera.BP_CustomSceneCamera_C
// 0x0110 (0x09E0 - 0x08D0)
class ABP_CustomSceneCamera_C final : public AUnrealCameraActor
{
public:
	uint8                                         Pad_8C8[0x8];                                      // 0x08C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        ZoomSocket_0;                                      // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed;                                       // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultFOV;                                        // 0x08E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ModelMesh;                                         // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      ModelCapsule;                                      // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ZoomLevel;                                         // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SocketOffset;                                      // 0x08FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SocketOffset_1;                                    // 0x0908(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SocketOffset_2;                                    // 0x0914(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCustomCamera;                                  // 0x0920(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCustomCameraActivated;                            // 0x0921(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_922[0x6];                                      // 0x0922(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATLCustomSceneControlActor*             CustomSceneActor;                                  // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FullshotOffset;                                    // 0x0930(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             ChestshotOffset;                                   // 0x0960(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             FaceshotOffset;                                    // 0x0990(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	bool                                          bArmytoy;                                          // 0x09C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C1[0x7];                                      // 0x09C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        ModelRoot;                                         // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x09D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CustomSceneCamera(int32 EntryPoint);
	void K2_OnEndViewTarget(class APlayerController* PC);
	void K2_OnBecomeViewTarget(class APlayerController* PC);
	void ReceiveTick(float DeltaSeconds);
	void ActivateCustomCamera(bool bActivate);
	void Init(class ATLCustomSceneControlActor* InCustomSceneActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomSceneCamera_C">();
	}
	static class ABP_CustomSceneCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CustomSceneCamera_C>();
	}
};
static_assert(alignof(ABP_CustomSceneCamera_C) == 0x000010, "Wrong alignment on ABP_CustomSceneCamera_C");
static_assert(sizeof(ABP_CustomSceneCamera_C) == 0x0009E0, "Wrong size on ABP_CustomSceneCamera_C");
static_assert(offsetof(ABP_CustomSceneCamera_C, UberGraphFrame) == 0x0008D0, "Member 'ABP_CustomSceneCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, ZoomSocket_0) == 0x0008D8, "Member 'ABP_CustomSceneCamera_C::ZoomSocket_0' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, InterpSpeed) == 0x0008E0, "Member 'ABP_CustomSceneCamera_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, DefaultFOV) == 0x0008E4, "Member 'ABP_CustomSceneCamera_C::DefaultFOV' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, ModelMesh) == 0x0008E8, "Member 'ABP_CustomSceneCamera_C::ModelMesh' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, ModelCapsule) == 0x0008F0, "Member 'ABP_CustomSceneCamera_C::ModelCapsule' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, ZoomLevel) == 0x0008F8, "Member 'ABP_CustomSceneCamera_C::ZoomLevel' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, SocketOffset) == 0x0008FC, "Member 'ABP_CustomSceneCamera_C::SocketOffset' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, SocketOffset_1) == 0x000908, "Member 'ABP_CustomSceneCamera_C::SocketOffset_1' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, SocketOffset_2) == 0x000914, "Member 'ABP_CustomSceneCamera_C::SocketOffset_2' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, bUseCustomCamera) == 0x000920, "Member 'ABP_CustomSceneCamera_C::bUseCustomCamera' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, bCustomCameraActivated) == 0x000921, "Member 'ABP_CustomSceneCamera_C::bCustomCameraActivated' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, CustomSceneActor) == 0x000928, "Member 'ABP_CustomSceneCamera_C::CustomSceneActor' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, FullshotOffset) == 0x000930, "Member 'ABP_CustomSceneCamera_C::FullshotOffset' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, ChestshotOffset) == 0x000960, "Member 'ABP_CustomSceneCamera_C::ChestshotOffset' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, FaceshotOffset) == 0x000990, "Member 'ABP_CustomSceneCamera_C::FaceshotOffset' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, bArmytoy) == 0x0009C0, "Member 'ABP_CustomSceneCamera_C::bArmytoy' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, ModelRoot) == 0x0009C8, "Member 'ABP_CustomSceneCamera_C::ModelRoot' has a wrong offset!");
static_assert(offsetof(ABP_CustomSceneCamera_C, Origin) == 0x0009D0, "Member 'ABP_CustomSceneCamera_C::Origin' has a wrong offset!");

}

