#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Contract_Confirm_Title

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Contract_Confirm_Title.BP_Contract_Confirm_Title_C.ExecuteUbergraph_BP_Contract_Confirm_Title
// 0x0030 (0x0030 - 0x0000)
struct BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue;            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue_1;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_1;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_2;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title) == 0x000004, "Wrong alignment on BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title");
static_assert(sizeof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title) == 0x000030, "Wrong size on BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, EntryPoint) == 0x000000, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, CallFunc_AddTextBinding_ReturnValue) == 0x000024, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, K2Node_Event_IsDesignTime) == 0x000025, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, CallFunc_AddVisibleBinding_ReturnValue) == 0x000026, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::CallFunc_AddVisibleBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, CallFunc_AddTextBinding_ReturnValue_1) == 0x000027, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x000028, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, CallFunc_SetOnUpdateDefault_ReturnValue_1) == 0x000029, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::CallFunc_SetOnUpdateDefault_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, CallFunc_AddVisibleBinding_ReturnValue_1) == 0x00002B, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::CallFunc_AddVisibleBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title, CallFunc_AddVisibleBinding_ReturnValue_2) == 0x00002C, "Member 'BP_Contract_Confirm_Title_C_ExecuteUbergraph_BP_Contract_Confirm_Title::CallFunc_AddVisibleBinding_ReturnValue_2' has a wrong offset!");

// Function BP_Contract_Confirm_Title.BP_Contract_Confirm_Title_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Contract_Confirm_Title_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Contract_Confirm_Title_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Contract_Confirm_Title_C_PreConstruct");
static_assert(sizeof(BP_Contract_Confirm_Title_C_PreConstruct) == 0x000001, "Wrong size on BP_Contract_Confirm_Title_C_PreConstruct");
static_assert(offsetof(BP_Contract_Confirm_Title_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Contract_Confirm_Title_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

