#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChatBallonNPCIntegrated

#include "Basic.hpp"

#include "TLClient_structs.hpp"


namespace SDK::Params
{

// Function BP_ChatBallonNPCIntegrated.BP_ChatBallonNPCIntegrated_C.ExecuteUbergraph_BP_ChatBallonNPCIntegrated
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCalibrated;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECalibratedEdgeType                           K2Node_Event_InEdgeType;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EChatBalloonType                              K2Node_Event_InChatBalloonType;                    // 0x0021(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_1;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_2;           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_3;           // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_4;           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_5;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_6;           // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated) == 0x000008, "Wrong alignment on BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated");
static_assert(sizeof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated) == 0x0000D0, "Wrong size on BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, EntryPoint) == 0x000000, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, K2Node_Event_bCalibrated) == 0x000004, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::K2Node_Event_bCalibrated' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, K2Node_Event_InEdgeType) == 0x000005, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::K2Node_Event_InEdgeType' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000007, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000008, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000009, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_ShowWithValue_self_CastInput) == 0x000010, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, K2Node_Event_IsDesignTime) == 0x000020, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, K2Node_Event_InChatBalloonType) == 0x000021, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::K2Node_Event_InChatBalloonType' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000022, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000023, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_BooleanOR_ReturnValue) == 0x000024, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_Not_PreBool_ReturnValue_1) == 0x000025, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_ShowWithValue_self_CastInput_1) == 0x000028, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_ShowWithValue_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_ShowWithValue_self_CastInput_2) == 0x000038, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_ShowWithValue_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_ShowWithValue_self_CastInput_3) == 0x000048, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_ShowWithValue_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_ShowWithValue_self_CastInput_4) == 0x000058, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_ShowWithValue_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_ShowWithValue_self_CastInput_5) == 0x000068, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_ShowWithValue_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_SetVisible_self_CastInput) == 0x000078, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_SetVisible_self_CastInput_1) == 0x000088, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_SetVisible_self_CastInput_2) == 0x000098, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_SetVisible_self_CastInput_3) == 0x0000A8, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_AddTextBinding_ReturnValue) == 0x0000B8, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated, CallFunc_ShowWithValue_self_CastInput_6) == 0x0000C0, "Member 'BP_ChatBallonNPCIntegrated_C_ExecuteUbergraph_BP_ChatBallonNPCIntegrated::CallFunc_ShowWithValue_self_CastInput_6' has a wrong offset!");

// Function BP_ChatBallonNPCIntegrated.BP_ChatBallonNPCIntegrated_C.OnChatBalloonTypeApply
// 0x0001 (0x0001 - 0x0000)
struct BP_ChatBallonNPCIntegrated_C_OnChatBalloonTypeApply final
{
public:
	EChatBalloonType                              InChatBalloonType;                                 // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChatBallonNPCIntegrated_C_OnChatBalloonTypeApply) == 0x000001, "Wrong alignment on BP_ChatBallonNPCIntegrated_C_OnChatBalloonTypeApply");
static_assert(sizeof(BP_ChatBallonNPCIntegrated_C_OnChatBalloonTypeApply) == 0x000001, "Wrong size on BP_ChatBallonNPCIntegrated_C_OnChatBalloonTypeApply");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_OnChatBalloonTypeApply, InChatBalloonType) == 0x000000, "Member 'BP_ChatBallonNPCIntegrated_C_OnChatBalloonTypeApply::InChatBalloonType' has a wrong offset!");

// Function BP_ChatBallonNPCIntegrated.BP_ChatBallonNPCIntegrated_C.OnPositionCalibrated
// 0x0002 (0x0002 - 0x0000)
struct BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated final
{
public:
	bool                                          bCalibrated;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECalibratedEdgeType                           InEdgeType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated) == 0x000001, "Wrong alignment on BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated");
static_assert(sizeof(BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated) == 0x000002, "Wrong size on BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated, bCalibrated) == 0x000000, "Member 'BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated::bCalibrated' has a wrong offset!");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated, InEdgeType) == 0x000001, "Member 'BP_ChatBallonNPCIntegrated_C_OnPositionCalibrated::InEdgeType' has a wrong offset!");

// Function BP_ChatBallonNPCIntegrated.BP_ChatBallonNPCIntegrated_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ChatBallonNPCIntegrated_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChatBallonNPCIntegrated_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ChatBallonNPCIntegrated_C_PreConstruct");
static_assert(sizeof(BP_ChatBallonNPCIntegrated_C_PreConstruct) == 0x000001, "Wrong size on BP_ChatBallonNPCIntegrated_C_PreConstruct");
static_assert(offsetof(BP_ChatBallonNPCIntegrated_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ChatBallonNPCIntegrated_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

