#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextMenu_MainActionIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ContextMenu_MainActionIcon.BP_ContextMenu_MainActionIcon_C
// 0x0170 (0x1070 - 0x0F00)
class UBP_ContextMenu_MainActionIcon_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Gauge_Loop_Anim;                                   // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim_Backup;                                   // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GaugeEdge_Anim;                                    // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CooperateLoop_Anim;                                // 0x0F20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DisableIcon_Anim;                                  // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DefaultIcon_Anim;                                  // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gauge_Start_Anim;                                  // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InteractInterrupt_Anim;                            // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InteractCancel_Anim;                               // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InteractComplete_Anim;                             // 0x0F50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CooperateStart_Anim;                               // 0x0F58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLBorder*                              ColorPanel;                                        // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLGridPanel*                           CooperateArrow_Grid;                               // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               CooperateArrowIcon;                                // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               DisableIcon;                                       // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               EnableIcon;                                        // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              Font_color;                                        // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               FX_CooperateGlow;                                  // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               FX_CooperateLight;                                 // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               FX_CooperateLine;                                  // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               FX_CooprateArrow_Light1;                           // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               FX_CooprateArrow_Light2;                           // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               GaugeBG;                                           // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               GaugeBG_base;                                      // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               GaugeGlow;                                         // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLProgressBar*                         GaugeInteract;                                     // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               GaugeInteract_Edge_Mat;                            // 0x0FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         GaugePanel;                                        // 0x0FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         InteractionBG_Panel;                               // 0x0FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           InteractionTitle;                                  // 0x0FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               RadialLineA;                                       // 0x0FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               RadialLineB;                                       // 0x1000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Tex_CooperateNum;                                  // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Co_A_Line;                                    // 0x1010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Co_A_Glow;                                    // 0x1028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Co_B_Line;                                    // 0x1040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Co_B_Glow;                                    // 0x1058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ContextMenu_MainActionIcon(int32 EntryPoint);
	void BndEvt__BP_ContextMenu_MainActionIcon_Gauge_Interact_K2Node_ComponentBoundEvent_0_OnChangedPercent__DelegateSignature(float InPercent);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void FnSetCoOpColor(bool MyCoop);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ContextMenu_MainActionIcon_C">();
	}
	static class UBP_ContextMenu_MainActionIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ContextMenu_MainActionIcon_C>();
	}
};
static_assert(alignof(UBP_ContextMenu_MainActionIcon_C) == 0x000008, "Wrong alignment on UBP_ContextMenu_MainActionIcon_C");
static_assert(sizeof(UBP_ContextMenu_MainActionIcon_C) == 0x001070, "Wrong size on UBP_ContextMenu_MainActionIcon_C");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, UberGraphFrame) == 0x000F00, "Member 'UBP_ContextMenu_MainActionIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Gauge_Loop_Anim) == 0x000F08, "Member 'UBP_ContextMenu_MainActionIcon_C::Gauge_Loop_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, ShowAnim_Backup) == 0x000F10, "Member 'UBP_ContextMenu_MainActionIcon_C::ShowAnim_Backup' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, GaugeEdge_Anim) == 0x000F18, "Member 'UBP_ContextMenu_MainActionIcon_C::GaugeEdge_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, CooperateLoop_Anim) == 0x000F20, "Member 'UBP_ContextMenu_MainActionIcon_C::CooperateLoop_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, DisableIcon_Anim) == 0x000F28, "Member 'UBP_ContextMenu_MainActionIcon_C::DisableIcon_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, DefaultIcon_Anim) == 0x000F30, "Member 'UBP_ContextMenu_MainActionIcon_C::DefaultIcon_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Gauge_Start_Anim) == 0x000F38, "Member 'UBP_ContextMenu_MainActionIcon_C::Gauge_Start_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, InteractInterrupt_Anim) == 0x000F40, "Member 'UBP_ContextMenu_MainActionIcon_C::InteractInterrupt_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, InteractCancel_Anim) == 0x000F48, "Member 'UBP_ContextMenu_MainActionIcon_C::InteractCancel_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, InteractComplete_Anim) == 0x000F50, "Member 'UBP_ContextMenu_MainActionIcon_C::InteractComplete_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, CooperateStart_Anim) == 0x000F58, "Member 'UBP_ContextMenu_MainActionIcon_C::CooperateStart_Anim' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, ColorPanel) == 0x000F60, "Member 'UBP_ContextMenu_MainActionIcon_C::ColorPanel' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, CooperateArrow_Grid) == 0x000F68, "Member 'UBP_ContextMenu_MainActionIcon_C::CooperateArrow_Grid' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, CooperateArrowIcon) == 0x000F70, "Member 'UBP_ContextMenu_MainActionIcon_C::CooperateArrowIcon' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, DisableIcon) == 0x000F78, "Member 'UBP_ContextMenu_MainActionIcon_C::DisableIcon' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, EnableIcon) == 0x000F80, "Member 'UBP_ContextMenu_MainActionIcon_C::EnableIcon' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Font_color) == 0x000F88, "Member 'UBP_ContextMenu_MainActionIcon_C::Font_color' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, FX_CooperateGlow) == 0x000F90, "Member 'UBP_ContextMenu_MainActionIcon_C::FX_CooperateGlow' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, FX_CooperateLight) == 0x000F98, "Member 'UBP_ContextMenu_MainActionIcon_C::FX_CooperateLight' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, FX_CooperateLine) == 0x000FA0, "Member 'UBP_ContextMenu_MainActionIcon_C::FX_CooperateLine' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, FX_CooprateArrow_Light1) == 0x000FA8, "Member 'UBP_ContextMenu_MainActionIcon_C::FX_CooprateArrow_Light1' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, FX_CooprateArrow_Light2) == 0x000FB0, "Member 'UBP_ContextMenu_MainActionIcon_C::FX_CooprateArrow_Light2' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, GaugeBG) == 0x000FB8, "Member 'UBP_ContextMenu_MainActionIcon_C::GaugeBG' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, GaugeBG_base) == 0x000FC0, "Member 'UBP_ContextMenu_MainActionIcon_C::GaugeBG_base' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, GaugeGlow) == 0x000FC8, "Member 'UBP_ContextMenu_MainActionIcon_C::GaugeGlow' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, GaugeInteract) == 0x000FD0, "Member 'UBP_ContextMenu_MainActionIcon_C::GaugeInteract' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, GaugeInteract_Edge_Mat) == 0x000FD8, "Member 'UBP_ContextMenu_MainActionIcon_C::GaugeInteract_Edge_Mat' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, GaugePanel) == 0x000FE0, "Member 'UBP_ContextMenu_MainActionIcon_C::GaugePanel' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, InteractionBG_Panel) == 0x000FE8, "Member 'UBP_ContextMenu_MainActionIcon_C::InteractionBG_Panel' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, InteractionTitle) == 0x000FF0, "Member 'UBP_ContextMenu_MainActionIcon_C::InteractionTitle' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, RadialLineA) == 0x000FF8, "Member 'UBP_ContextMenu_MainActionIcon_C::RadialLineA' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, RadialLineB) == 0x001000, "Member 'UBP_ContextMenu_MainActionIcon_C::RadialLineB' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Tex_CooperateNum) == 0x001008, "Member 'UBP_ContextMenu_MainActionIcon_C::Tex_CooperateNum' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Path_Co_A_Line) == 0x001010, "Member 'UBP_ContextMenu_MainActionIcon_C::Path_Co_A_Line' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Path_Co_A_Glow) == 0x001028, "Member 'UBP_ContextMenu_MainActionIcon_C::Path_Co_A_Glow' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Path_Co_B_Line) == 0x001040, "Member 'UBP_ContextMenu_MainActionIcon_C::Path_Co_B_Line' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_MainActionIcon_C, Path_Co_B_Glow) == 0x001058, "Member 'UBP_ContextMenu_MainActionIcon_C::Path_Co_B_Glow' has a wrong offset!");

}

