#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Contract_MarkTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Contract_MarkTooltip.BP_Contract_MarkTooltip_C.ExecuteUbergraph_BP_Contract_MarkTooltip
// 0x0008 (0x0008 - 0x0000)
struct BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip) == 0x000004, "Wrong alignment on BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip");
static_assert(sizeof(BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip) == 0x000008, "Wrong size on BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip");
static_assert(offsetof(BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip, EntryPoint) == 0x000000, "Member 'BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_Contract_MarkTooltip_C_ExecuteUbergraph_BP_Contract_MarkTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BP_Contract_MarkTooltip.BP_Contract_MarkTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Contract_MarkTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Contract_MarkTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Contract_MarkTooltip_C_PreConstruct");
static_assert(sizeof(BP_Contract_MarkTooltip_C_PreConstruct) == 0x000001, "Wrong size on BP_Contract_MarkTooltip_C_PreConstruct");
static_assert(offsetof(BP_Contract_MarkTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Contract_MarkTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

