#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextMenuFrame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ContextMenuFrame.BP_ContextMenuFrame_C
// 0x0050 (0x1640 - 0x15F0)
class UBP_ContextMenuFrame_C final : public UTLUserWidgetContextMenuList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_BTN_ContextMenu_C*                  BP_BTN_ContextMenu;                                // 0x15F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ContextMenu_SignSystem_widget_C*    BP_ContextMenu_SignSystem_widget;                  // 0x1600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         MenuList;                                          // 0x1608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_TOOLTIP_NOMAL_BACK;                            // 0x1610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TextSubTitle;                                      // 0x1618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TitleImage;                                        // 0x1620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         TLVerticalBox_0;                                   // 0x1628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_USERNAME;                                      // 0x1630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ContextMenuFrame(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ContextMenuFrame_C">();
	}
	static class UBP_ContextMenuFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ContextMenuFrame_C>();
	}
};
static_assert(alignof(UBP_ContextMenuFrame_C) == 0x000010, "Wrong alignment on UBP_ContextMenuFrame_C");
static_assert(sizeof(UBP_ContextMenuFrame_C) == 0x001640, "Wrong size on UBP_ContextMenuFrame_C");
static_assert(offsetof(UBP_ContextMenuFrame_C, UberGraphFrame) == 0x0015F0, "Member 'UBP_ContextMenuFrame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, BP_BTN_ContextMenu) == 0x0015F8, "Member 'UBP_ContextMenuFrame_C::BP_BTN_ContextMenu' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, BP_ContextMenu_SignSystem_widget) == 0x001600, "Member 'UBP_ContextMenuFrame_C::BP_ContextMenu_SignSystem_widget' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, MenuList) == 0x001608, "Member 'UBP_ContextMenuFrame_C::MenuList' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, TEX_TOOLTIP_NOMAL_BACK) == 0x001610, "Member 'UBP_ContextMenuFrame_C::TEX_TOOLTIP_NOMAL_BACK' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, TextSubTitle) == 0x001618, "Member 'UBP_ContextMenuFrame_C::TextSubTitle' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, TitleImage) == 0x001620, "Member 'UBP_ContextMenuFrame_C::TitleImage' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, TLVerticalBox_0) == 0x001628, "Member 'UBP_ContextMenuFrame_C::TLVerticalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenuFrame_C, TXT_USERNAME) == 0x001630, "Member 'UBP_ContextMenuFrame_C::TXT_USERNAME' has a wrong offset!");

}

