#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cursor_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Cursor_Widget.BP_Cursor_Widget_C.ExecuteUbergraph_BP_Cursor_Widget
// 0x0018 (0x0018 - 0x0000)
struct BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStronglyFX;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget) == 0x000008, "Wrong alignment on BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget");
static_assert(sizeof(BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget) == 0x000018, "Wrong size on BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget");
static_assert(offsetof(BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget, EntryPoint) == 0x000000, "Member 'BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget, K2Node_Event_bStronglyFX) == 0x000004, "Member 'BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget::K2Node_Event_bStronglyFX' has a wrong offset!");
static_assert(offsetof(BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BP_Cursor_Widget_C_ExecuteUbergraph_BP_Cursor_Widget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_Cursor_Widget.BP_Cursor_Widget_C.OnCursorFXEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_Cursor_Widget_C_OnCursorFXEvent final
{
public:
	bool                                          bStronglyFX;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Cursor_Widget_C_OnCursorFXEvent) == 0x000001, "Wrong alignment on BP_Cursor_Widget_C_OnCursorFXEvent");
static_assert(sizeof(BP_Cursor_Widget_C_OnCursorFXEvent) == 0x000001, "Wrong size on BP_Cursor_Widget_C_OnCursorFXEvent");
static_assert(offsetof(BP_Cursor_Widget_C_OnCursorFXEvent, bStronglyFX) == 0x000000, "Member 'BP_Cursor_Widget_C_OnCursorFXEvent::bStronglyFX' has a wrong offset!");

}

