#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextMenu_Desire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ContextMenu_Desire.BP_ContextMenu_Desire_C
// 0x0028 (0x0AD0 - 0x0AA8)
class UBP_ContextMenu_Desire_C final : public UTLUserWidgetInteractionCondition
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLTextBlock*                           DisableText;                                       // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           EnableText;                                        // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IconDisable;                                       // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IconEnable;                                        // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ContextMenu_Desire(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ContextMenu_Desire_C">();
	}
	static class UBP_ContextMenu_Desire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ContextMenu_Desire_C>();
	}
};
static_assert(alignof(UBP_ContextMenu_Desire_C) == 0x000008, "Wrong alignment on UBP_ContextMenu_Desire_C");
static_assert(sizeof(UBP_ContextMenu_Desire_C) == 0x000AD0, "Wrong size on UBP_ContextMenu_Desire_C");
static_assert(offsetof(UBP_ContextMenu_Desire_C, UberGraphFrame) == 0x000AA8, "Member 'UBP_ContextMenu_Desire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_Desire_C, DisableText) == 0x000AB0, "Member 'UBP_ContextMenu_Desire_C::DisableText' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_Desire_C, EnableText) == 0x000AB8, "Member 'UBP_ContextMenu_Desire_C::EnableText' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_Desire_C, IconDisable) == 0x000AC0, "Member 'UBP_ContextMenu_Desire_C::IconDisable' has a wrong offset!");
static_assert(offsetof(UBP_ContextMenu_Desire_C, IconEnable) == 0x000AC8, "Member 'UBP_ContextMenu_Desire_C::IconEnable' has a wrong offset!");

}

