#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomScene_MagicDoll

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomScene_MagicDoll.BP_CustomScene_MagicDoll_C.ExecuteUbergraph_BP_CustomScene_MagicDoll
// 0x0048 (0x0048 - 0x0000)
struct BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_PlayLevelSequence_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CustomSceneId;                        // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHiveEntityData*                  K2Node_Event_HiveEntity;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        K2Node_Event_ChangeSct;                            // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAcquire;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bUnveiled;                            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll) == 0x000008, "Wrong alignment on BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll");
static_assert(sizeof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll) == 0x000048, "Wrong size on BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, EntryPoint) == 0x000000, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, CallFunc_PlayLevelSequence_ReturnValue) == 0x000008, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::CallFunc_PlayLevelSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, K2Node_Event_CustomSceneId) == 0x000014, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::K2Node_Event_CustomSceneId' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, K2Node_Event_HiveEntity) == 0x000020, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::K2Node_Event_HiveEntity' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, K2Node_Event_ChangeSct) == 0x000028, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::K2Node_Event_ChangeSct' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, K2Node_Event_bAcquire) == 0x000040, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::K2Node_Event_bAcquire' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, K2Node_Event_bUnveiled) == 0x000041, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::K2Node_Event_bUnveiled' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000042, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000043, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x000045, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll, CallFunc_BooleanAND_ReturnValue_1) == 0x000046, "Member 'BP_CustomScene_MagicDoll_C_ExecuteUbergraph_BP_CustomScene_MagicDoll::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_CustomScene_MagicDoll.BP_CustomScene_MagicDoll_C.OnSelect
// 0x0030 (0x0030 - 0x0000)
struct BP_CustomScene_MagicDoll_C_OnSelect final
{
public:
	class FName                                   CustomSceneId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UHiveEntityData*                  HiveEntity;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        ChangeSct;                                         // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bAcquire;                                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUnveiled_0;                                       // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomScene_MagicDoll_C_OnSelect) == 0x000008, "Wrong alignment on BP_CustomScene_MagicDoll_C_OnSelect");
static_assert(sizeof(BP_CustomScene_MagicDoll_C_OnSelect) == 0x000030, "Wrong size on BP_CustomScene_MagicDoll_C_OnSelect");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_OnSelect, CustomSceneId) == 0x000000, "Member 'BP_CustomScene_MagicDoll_C_OnSelect::CustomSceneId' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_OnSelect, HiveEntity) == 0x000008, "Member 'BP_CustomScene_MagicDoll_C_OnSelect::HiveEntity' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_OnSelect, ChangeSct) == 0x000010, "Member 'BP_CustomScene_MagicDoll_C_OnSelect::ChangeSct' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_OnSelect, bAcquire) == 0x000028, "Member 'BP_CustomScene_MagicDoll_C_OnSelect::bAcquire' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_OnSelect, bUnveiled_0) == 0x000029, "Member 'BP_CustomScene_MagicDoll_C_OnSelect::bUnveiled_0' has a wrong offset!");

// Function BP_CustomScene_MagicDoll.BP_CustomScene_MagicDoll_C.SpawnDomeBP
// 0x0028 (0x0028 - 0x0000)
struct BP_CustomScene_MagicDoll_C_SpawnDomeBP final
{
public:
	class UClass*                                 DomeClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnSceneActor_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomScene_MagicDoll_C_SpawnDomeBP) == 0x000008, "Wrong alignment on BP_CustomScene_MagicDoll_C_SpawnDomeBP");
static_assert(sizeof(BP_CustomScene_MagicDoll_C_SpawnDomeBP) == 0x000028, "Wrong size on BP_CustomScene_MagicDoll_C_SpawnDomeBP");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SpawnDomeBP, DomeClass) == 0x000000, "Member 'BP_CustomScene_MagicDoll_C_SpawnDomeBP::DomeClass' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SpawnDomeBP, CallFunc_SpawnSceneActor_ReturnValue) == 0x000008, "Member 'BP_CustomScene_MagicDoll_C_SpawnDomeBP::CallFunc_SpawnSceneActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SpawnDomeBP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CustomScene_MagicDoll_C_SpawnDomeBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SpawnDomeBP, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BP_CustomScene_MagicDoll_C_SpawnDomeBP::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SpawnDomeBP, CallFunc_IsValidClass_ReturnValue) == 0x000020, "Member 'BP_CustomScene_MagicDoll_C_SpawnDomeBP::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SpawnDomeBP, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000021, "Member 'BP_CustomScene_MagicDoll_C_SpawnDomeBP::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_CustomScene_MagicDoll.BP_CustomScene_MagicDoll_C.SetAcquiredScene
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomScene_MagicDoll_C_SetAcquiredScene final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomScene_MagicDoll_C_SetAcquiredScene) == 0x000001, "Wrong alignment on BP_CustomScene_MagicDoll_C_SetAcquiredScene");
static_assert(sizeof(BP_CustomScene_MagicDoll_C_SetAcquiredScene) == 0x000001, "Wrong size on BP_CustomScene_MagicDoll_C_SetAcquiredScene");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SetAcquiredScene, K2Node_SwitchName_CmpSuccess) == 0x000000, "Member 'BP_CustomScene_MagicDoll_C_SetAcquiredScene::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_CustomScene_MagicDoll.BP_CustomScene_MagicDoll_C.SetUnveiledScene
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomScene_MagicDoll_C_SetUnveiledScene final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomScene_MagicDoll_C_SetUnveiledScene) == 0x000001, "Wrong alignment on BP_CustomScene_MagicDoll_C_SetUnveiledScene");
static_assert(sizeof(BP_CustomScene_MagicDoll_C_SetUnveiledScene) == 0x000001, "Wrong size on BP_CustomScene_MagicDoll_C_SetUnveiledScene");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SetUnveiledScene, K2Node_SwitchName_CmpSuccess) == 0x000000, "Member 'BP_CustomScene_MagicDoll_C_SetUnveiledScene::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_CustomScene_MagicDoll.BP_CustomScene_MagicDoll_C.SetDefaultScene
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomScene_MagicDoll_C_SetDefaultScene final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CustomScene_MagicDoll_C_SetDefaultScene) == 0x000001, "Wrong alignment on BP_CustomScene_MagicDoll_C_SetDefaultScene");
static_assert(sizeof(BP_CustomScene_MagicDoll_C_SetDefaultScene) == 0x000001, "Wrong size on BP_CustomScene_MagicDoll_C_SetDefaultScene");
static_assert(offsetof(BP_CustomScene_MagicDoll_C_SetDefaultScene, K2Node_SwitchName_CmpSuccess) == 0x000000, "Member 'BP_CustomScene_MagicDoll_C_SetDefaultScene::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

