#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Contract_Confirm_Title

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Contract_Confirm_Title.BP_Contract_Confirm_Title_C
// 0x0038 (0x0BF8 - 0x0BC0)
class UBP_Contract_Confirm_Title_C final : public UTLUserWidgetContractTitle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               LevelIcon;                                         // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_Common_AmountBox;                              // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TextTargetArea;                                    // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TextTitle;                                         // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTerritory_LevelRange_Text;                       // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextTerritoryColon;                              // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Contract_Confirm_Title(int32 EntryPoint);
	void State();
	void ___t___3();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Contract_Confirm_Title_C">();
	}
	static class UBP_Contract_Confirm_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Contract_Confirm_Title_C>();
	}
};
static_assert(alignof(UBP_Contract_Confirm_Title_C) == 0x000008, "Wrong alignment on UBP_Contract_Confirm_Title_C");
static_assert(sizeof(UBP_Contract_Confirm_Title_C) == 0x000BF8, "Wrong size on UBP_Contract_Confirm_Title_C");
static_assert(offsetof(UBP_Contract_Confirm_Title_C, UberGraphFrame) == 0x000BC0, "Member 'UBP_Contract_Confirm_Title_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Contract_Confirm_Title_C, LevelIcon) == 0x000BC8, "Member 'UBP_Contract_Confirm_Title_C::LevelIcon' has a wrong offset!");
static_assert(offsetof(UBP_Contract_Confirm_Title_C, Tex_Common_AmountBox) == 0x000BD0, "Member 'UBP_Contract_Confirm_Title_C::Tex_Common_AmountBox' has a wrong offset!");
static_assert(offsetof(UBP_Contract_Confirm_Title_C, TextTargetArea) == 0x000BD8, "Member 'UBP_Contract_Confirm_Title_C::TextTargetArea' has a wrong offset!");
static_assert(offsetof(UBP_Contract_Confirm_Title_C, TextTitle) == 0x000BE0, "Member 'UBP_Contract_Confirm_Title_C::TextTitle' has a wrong offset!");
static_assert(offsetof(UBP_Contract_Confirm_Title_C, TLTerritory_LevelRange_Text) == 0x000BE8, "Member 'UBP_Contract_Confirm_Title_C::TLTerritory_LevelRange_Text' has a wrong offset!");
static_assert(offsetof(UBP_Contract_Confirm_Title_C, TLTextTerritoryColon) == 0x000BF0, "Member 'UBP_Contract_Confirm_Title_C::TLTextTerritoryColon' has a wrong offset!");

}

