#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomScene_MagicDoll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomScene_MagicDoll.BP_CustomScene_MagicDoll_C
// 0x0038 (0x0568 - 0x0530)
class ABP_CustomScene_MagicDoll_C final : public ATLMagicDollSceneControlActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 CustomEnvBP;                                       // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FOVCache;                                          // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurSceneID;                                        // 0x0544(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DomeBPClass;                                       // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAcquired;                                         // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bUnveiled;                                         // 0x0559(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A[0x2];                                      // 0x055A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CenterOffset;                                      // 0x055C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistOffset;                                        // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CustomScene_MagicDoll(int32 EntryPoint);
	void OnCustomCameraActivated();
	void OnStopScene();
	void OnSelect(class FName CustomSceneId, const class UHiveEntityData* HiveEntity, const struct FSoftObjectPath& ChangeSct, bool bAcquire, bool bUnveiled_0);
	void OnStartScene();
	void SpawnDomeBP(class UClass* DomeClass);
	void SetAcquiredScene();
	void SetUnveiledScene();
	void SetDefaultScene();
	void SetScene();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomScene_MagicDoll_C">();
	}
	static class ABP_CustomScene_MagicDoll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CustomScene_MagicDoll_C>();
	}
};
static_assert(alignof(ABP_CustomScene_MagicDoll_C) == 0x000008, "Wrong alignment on ABP_CustomScene_MagicDoll_C");
static_assert(sizeof(ABP_CustomScene_MagicDoll_C) == 0x000568, "Wrong size on ABP_CustomScene_MagicDoll_C");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, UberGraphFrame) == 0x000530, "Member 'ABP_CustomScene_MagicDoll_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, CustomEnvBP) == 0x000538, "Member 'ABP_CustomScene_MagicDoll_C::CustomEnvBP' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, FOVCache) == 0x000540, "Member 'ABP_CustomScene_MagicDoll_C::FOVCache' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, CurSceneID) == 0x000544, "Member 'ABP_CustomScene_MagicDoll_C::CurSceneID' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, DomeBPClass) == 0x000550, "Member 'ABP_CustomScene_MagicDoll_C::DomeBPClass' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, bAcquired) == 0x000558, "Member 'ABP_CustomScene_MagicDoll_C::bAcquired' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, bUnveiled) == 0x000559, "Member 'ABP_CustomScene_MagicDoll_C::bUnveiled' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, CenterOffset) == 0x00055C, "Member 'ABP_CustomScene_MagicDoll_C::CenterOffset' has a wrong offset!");
static_assert(offsetof(ABP_CustomScene_MagicDoll_C, DistOffset) == 0x000564, "Member 'ABP_CustomScene_MagicDoll_C::DistOffset' has a wrong offset!");

}

