#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Contract_MarkTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Contract_MarkTooltip.BP_Contract_MarkTooltip_C
// 0x0030 (0x0B68 - 0x0B38)
class UBP_Contract_MarkTooltip_C final : public UTLUserWidgetRegionMarkTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Contract_MarkTooltipSlot_C*         BP_Contract_MarkTooltipSlot;                       // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_TooltipPanel_Bg_C*                  BP_TooltipPanel_Bg;                                // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         RootVerticalBox;                                   // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Title;                                         // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         VerticalBox_ContractRoot;                          // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Contract_MarkTooltip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Contract_MarkTooltip_C">();
	}
	static class UBP_Contract_MarkTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Contract_MarkTooltip_C>();
	}
};
static_assert(alignof(UBP_Contract_MarkTooltip_C) == 0x000008, "Wrong alignment on UBP_Contract_MarkTooltip_C");
static_assert(sizeof(UBP_Contract_MarkTooltip_C) == 0x000B68, "Wrong size on UBP_Contract_MarkTooltip_C");
static_assert(offsetof(UBP_Contract_MarkTooltip_C, UberGraphFrame) == 0x000B38, "Member 'UBP_Contract_MarkTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Contract_MarkTooltip_C, BP_Contract_MarkTooltipSlot) == 0x000B40, "Member 'UBP_Contract_MarkTooltip_C::BP_Contract_MarkTooltipSlot' has a wrong offset!");
static_assert(offsetof(UBP_Contract_MarkTooltip_C, BP_TooltipPanel_Bg) == 0x000B48, "Member 'UBP_Contract_MarkTooltip_C::BP_TooltipPanel_Bg' has a wrong offset!");
static_assert(offsetof(UBP_Contract_MarkTooltip_C, RootVerticalBox) == 0x000B50, "Member 'UBP_Contract_MarkTooltip_C::RootVerticalBox' has a wrong offset!");
static_assert(offsetof(UBP_Contract_MarkTooltip_C, TXT_Title) == 0x000B58, "Member 'UBP_Contract_MarkTooltip_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UBP_Contract_MarkTooltip_C, VerticalBox_ContractRoot) == 0x000B60, "Member 'UBP_Contract_MarkTooltip_C::VerticalBox_ContractRoot' has a wrong offset!");

}

