#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageFloaterGroup_DefaultHit_Number

#include "Basic.hpp"

#include "TLScheme_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_DamageFloaterGroup_DefaultHit_Number.BP_DamageFloaterGroup_DefaultHit_Number_C.ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number
// 0x00B0 (0x00B0 - 0x0000)
struct BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInPrimeSkill;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHpAbnormalStatus                             K2Node_Event_AbnormalStatus;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInSuccessByAccuracy;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFloaterCategory                              K2Node_Event_FloaterCategory;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsMyPc;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationInUserWidget_ReturnValue;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationInUserWidget_ReturnValue_1;  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageBrushBinding_ReturnValue;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_1;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageBrushBinding_ReturnValue_1;       // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0054(0x001C)(NoDestructor)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_1;               // 0x0070(0x001C)(NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_1;           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_2;           // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number) == 0x000008, "Wrong alignment on BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number");
static_assert(sizeof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number) == 0x0000B0, "Wrong size on BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, EntryPoint) == 0x000000, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_Event_bInPrimeSkill) == 0x000005, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_Event_bInPrimeSkill' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_Event_AbnormalStatus) == 0x000006, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_Event_AbnormalStatus' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_Event_bInSuccessByAccuracy) == 0x000007, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_Event_bInSuccessByAccuracy' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_Event_FloaterCategory) == 0x000008, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_Event_FloaterCategory' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_Event_IsMyPc) == 0x000009, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_Event_IsMyPc' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_SwitchEnum_CmpSuccess) == 0x00000B, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_SwitchEnum_CmpSuccess_1) == 0x00000C, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_SetVisible_self_CastInput) == 0x000010, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_SetVisible_self_CastInput_1) == 0x000020, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_RandomBool_ReturnValue) == 0x000030, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_PlayAnimationInUserWidget_ReturnValue) == 0x000031, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_PlayAnimationInUserWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_PlayAnimationInUserWidget_ReturnValue_1) == 0x000032, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_PlayAnimationInUserWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_ShowWithValue_self_CastInput) == 0x000038, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000048, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_AddVisibleBinding_ReturnValue) == 0x000050, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_AddVisibleBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_AddImageBrushBinding_ReturnValue) == 0x000051, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_AddImageBrushBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_AddVisibleBinding_ReturnValue_1) == 0x000052, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_AddVisibleBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_AddImageBrushBinding_ReturnValue_1) == 0x000053, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_AddImageBrushBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_MakeStruct_WidgetTransform) == 0x000054, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, K2Node_MakeStruct_WidgetTransform_1) == 0x000070, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::K2Node_MakeStruct_WidgetTransform_1' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_ShowWithValue_self_CastInput_1) == 0x000090, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_ShowWithValue_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number, CallFunc_ShowWithValue_self_CastInput_2) == 0x0000A0, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number::CallFunc_ShowWithValue_self_CastInput_2' has a wrong offset!");

// Function BP_DamageFloaterGroup_DefaultHit_Number.BP_DamageFloaterGroup_DefaultHit_Number_C.OnEmit
// 0x0005 (0x0005 - 0x0000)
struct BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit final
{
public:
	bool                                          bInPrimeSkill;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EHpAbnormalStatus                             AbnormalStatus;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInSuccessByAccuracy;                              // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFloaterCategory                              FloaterCategory;                                   // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMyPc;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit) == 0x000001, "Wrong alignment on BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit");
static_assert(sizeof(BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit) == 0x000005, "Wrong size on BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit, bInPrimeSkill) == 0x000000, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit::bInPrimeSkill' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit, AbnormalStatus) == 0x000001, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit::AbnormalStatus' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit, bInSuccessByAccuracy) == 0x000002, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit::bInSuccessByAccuracy' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit, FloaterCategory) == 0x000003, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit::FloaterCategory' has a wrong offset!");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit, IsMyPc) == 0x000004, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_OnEmit::IsMyPc' has a wrong offset!");

// Function BP_DamageFloaterGroup_DefaultHit_Number.BP_DamageFloaterGroup_DefaultHit_Number_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_DamageFloaterGroup_DefaultHit_Number_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DamageFloaterGroup_DefaultHit_Number_C_PreConstruct) == 0x000001, "Wrong alignment on BP_DamageFloaterGroup_DefaultHit_Number_C_PreConstruct");
static_assert(sizeof(BP_DamageFloaterGroup_DefaultHit_Number_C_PreConstruct) == 0x000001, "Wrong size on BP_DamageFloaterGroup_DefaultHit_Number_C_PreConstruct");
static_assert(offsetof(BP_DamageFloaterGroup_DefaultHit_Number_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_DamageFloaterGroup_DefaultHit_Number_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

