#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageFloaterGroup_DefaultHit_Number

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_DamageFloaterGroup_DefaultHit_Number.BP_DamageFloaterGroup_DefaultHit_Number_C
// 0x0120 (0x0E28 - 0x0D08)
class UBP_DamageFloaterGroup_DefaultHit_Number_C final : public UTLUserWidgetFloater
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Continuous_MyPCSkill;                              // 0x0D10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Continuous_DefaultSkill;                           // 0x0D18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glancing_RotR;                                     // 0x0D20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glancing_RotL;                                     // 0x0D28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glancing_MyPC_Skill;                               // 0x0D30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glancing_MyPC;                                     // 0x0D38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glancing_Skill;                                    // 0x0D40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glancing_Default;                                  // 0x0D48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Block_MyPC_Skill;                                  // 0x0D50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Block_MyPC;                                        // 0x0D58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Block_Skill;                                       // 0x0D60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Block_Defualt;                                     // 0x0D68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hit_MyPC_Skill;                                    // 0x0D70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hit_MyPC;                                          // 0x0D78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hit_Skill;                                         // 0x0D80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hit_Default;                                       // 0x0D88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               DamF_Abnormal_Skill;                               // 0x0D90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               DamF_AbnormalDark;                                 // 0x0D98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               DamF_RadialGlow;                                   // 0x0DA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLGridPanel*                           GlancingSpark_GridPanel;                           // 0x0DA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IconAbnormal;                                      // 0x0DB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IconSector;                                        // 0x0DB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         Offset_Panel;                                      // 0x0DC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Pos_Panel;                                         // 0x0DC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Rot_Panel;                                         // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Txt_abnormalBreak;                                 // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Txt_DamageNum;                                     // 0x0DE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                Path_Hit_TextStyleSet;                             // 0x0DE8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSoftObjectPath>                Path_Block_TextStyleSet;                           // 0x0DF8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSoftObjectPath>                Path_Glancing_TextStyleSet;                        // 0x0E08(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSoftObjectPath>                Path_Continous_AbnormalFxSet;                      // 0x0E18(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_DamageFloaterGroup_DefaultHit_Number(int32 EntryPoint);
	void Construct();
	void OnBreak();
	void OnEmit(bool bInPrimeSkill, EHpAbnormalStatus AbnormalStatus, bool bInSuccessByAccuracy, EFloaterCategory FloaterCategory, bool IsMyPc);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamageFloaterGroup_DefaultHit_Number_C">();
	}
	static class UBP_DamageFloaterGroup_DefaultHit_Number_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DamageFloaterGroup_DefaultHit_Number_C>();
	}
};
static_assert(alignof(UBP_DamageFloaterGroup_DefaultHit_Number_C) == 0x000008, "Wrong alignment on UBP_DamageFloaterGroup_DefaultHit_Number_C");
static_assert(sizeof(UBP_DamageFloaterGroup_DefaultHit_Number_C) == 0x000E28, "Wrong size on UBP_DamageFloaterGroup_DefaultHit_Number_C");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, UberGraphFrame) == 0x000D08, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Continuous_MyPCSkill) == 0x000D10, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Continuous_MyPCSkill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Continuous_DefaultSkill) == 0x000D18, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Continuous_DefaultSkill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Glancing_RotR) == 0x000D20, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Glancing_RotR' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Glancing_RotL) == 0x000D28, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Glancing_RotL' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Glancing_MyPC_Skill) == 0x000D30, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Glancing_MyPC_Skill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Glancing_MyPC) == 0x000D38, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Glancing_MyPC' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Glancing_Skill) == 0x000D40, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Glancing_Skill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Glancing_Default) == 0x000D48, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Glancing_Default' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Block_MyPC_Skill) == 0x000D50, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Block_MyPC_Skill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Block_MyPC) == 0x000D58, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Block_MyPC' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Block_Skill) == 0x000D60, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Block_Skill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Block_Defualt) == 0x000D68, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Block_Defualt' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Hit_MyPC_Skill) == 0x000D70, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Hit_MyPC_Skill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Hit_MyPC) == 0x000D78, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Hit_MyPC' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Hit_Skill) == 0x000D80, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Hit_Skill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Hit_Default) == 0x000D88, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Hit_Default' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, DamF_Abnormal_Skill) == 0x000D90, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::DamF_Abnormal_Skill' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, DamF_AbnormalDark) == 0x000D98, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::DamF_AbnormalDark' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, DamF_RadialGlow) == 0x000DA0, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::DamF_RadialGlow' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, GlancingSpark_GridPanel) == 0x000DA8, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::GlancingSpark_GridPanel' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, IconAbnormal) == 0x000DB0, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::IconAbnormal' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, IconSector) == 0x000DB8, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::IconSector' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Offset_Panel) == 0x000DC0, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Offset_Panel' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Pos_Panel) == 0x000DC8, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Pos_Panel' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Rot_Panel) == 0x000DD0, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Rot_Panel' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Txt_abnormalBreak) == 0x000DD8, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Txt_abnormalBreak' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Txt_DamageNum) == 0x000DE0, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Txt_DamageNum' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Path_Hit_TextStyleSet) == 0x000DE8, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Path_Hit_TextStyleSet' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Path_Block_TextStyleSet) == 0x000DF8, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Path_Block_TextStyleSet' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Path_Glancing_TextStyleSet) == 0x000E08, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Path_Glancing_TextStyleSet' has a wrong offset!");
static_assert(offsetof(UBP_DamageFloaterGroup_DefaultHit_Number_C, Path_Continous_AbnormalFxSet) == 0x000E18, "Member 'UBP_DamageFloaterGroup_DefaultHit_Number_C::Path_Continous_AbnormalFxSet' has a wrong offset!");

}

