#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlowGenBall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FlowGenBall.BP_FlowGenBall_C.ExecuteUbergraph_BP_FlowGenBall
// 0x0070 (0x0070 - 0x0000)
struct BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TLGetDebugFlowingSandBall_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall) == 0x000004, "Wrong alignment on BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall");
static_assert(sizeof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall) == 0x000070, "Wrong size on BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, EntryPoint) == 0x000000, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_TLGetDebugFlowingSandBall_ReturnValue) == 0x000004, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_TLGetDebugFlowingSandBall_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x00000C, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000018, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_BreakVector_Y) == 0x000024, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_BreakVector_Z) == 0x000028, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_MakeVector2D_ReturnValue) == 0x00002C, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_RandomFloatInRange_ReturnValue) == 0x000034, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000038, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00003C, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000040, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000044, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_GetRotated2D_ReturnValue) == 0x000048, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000050, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_BreakVector2D_X) == 0x000058, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_BreakVector2D_Y) == 0x00005C, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'BP_FlowGenBall_C_ExecuteUbergraph_BP_FlowGenBall::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_FlowGenBall.BP_FlowGenBall_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FlowGenBall_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlowGenBall_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FlowGenBall_C_ReceiveTick");
static_assert(sizeof(BP_FlowGenBall_C_ReceiveTick) == 0x000004, "Wrong size on BP_FlowGenBall_C_ReceiveTick");
static_assert(offsetof(BP_FlowGenBall_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FlowGenBall_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

