#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlowGenBall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FlowGenBall.BP_FlowGenBall_C
// 0x0048 (0x0278 - 0x0230)
class ABP_FlowGenBall_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LifeTime;                                          // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Forward;                                           // 0x0248(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         DesiredLifeTime;                                   // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MassMin;                                           // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MassMax;                                           // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LinearVelocityMin;                                 // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LinearVelocityMax;                                 // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationModifierMin;                               // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationModifierMax;                               // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinDesiredLifeTime;                                // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDesiredLifeTime;                                // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FlowGenBall(int32 EntryPoint);
	void ToggleVisibleFlowGenBall();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FlowGenBall_C">();
	}
	static class ABP_FlowGenBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FlowGenBall_C>();
	}
};
static_assert(alignof(ABP_FlowGenBall_C) == 0x000008, "Wrong alignment on ABP_FlowGenBall_C");
static_assert(sizeof(ABP_FlowGenBall_C) == 0x000278, "Wrong size on ABP_FlowGenBall_C");
static_assert(offsetof(ABP_FlowGenBall_C, UberGraphFrame) == 0x000230, "Member 'ABP_FlowGenBall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, StaticMesh) == 0x000238, "Member 'ABP_FlowGenBall_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, LifeTime) == 0x000240, "Member 'ABP_FlowGenBall_C::LifeTime' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, Rotation) == 0x000244, "Member 'ABP_FlowGenBall_C::Rotation' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, Forward) == 0x000248, "Member 'ABP_FlowGenBall_C::Forward' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, DesiredLifeTime) == 0x000254, "Member 'ABP_FlowGenBall_C::DesiredLifeTime' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, MassMin) == 0x000258, "Member 'ABP_FlowGenBall_C::MassMin' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, MassMax) == 0x00025C, "Member 'ABP_FlowGenBall_C::MassMax' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, LinearVelocityMin) == 0x000260, "Member 'ABP_FlowGenBall_C::LinearVelocityMin' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, LinearVelocityMax) == 0x000264, "Member 'ABP_FlowGenBall_C::LinearVelocityMax' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, RotationModifierMin) == 0x000268, "Member 'ABP_FlowGenBall_C::RotationModifierMin' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, RotationModifierMax) == 0x00026C, "Member 'ABP_FlowGenBall_C::RotationModifierMax' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, MinDesiredLifeTime) == 0x000270, "Member 'ABP_FlowGenBall_C::MinDesiredLifeTime' has a wrong offset!");
static_assert(offsetof(ABP_FlowGenBall_C, MaxDesiredLifeTime) == 0x000274, "Member 'ABP_FlowGenBall_C::MaxDesiredLifeTime' has a wrong offset!");

}

