#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD_EXP_Tooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HUD_EXP_Tooltip.BP_HUD_EXP_Tooltip_C
// 0x0030 (0x0B30 - 0x0B00)
class UBP_HUD_EXP_Tooltip_C final : public UTLUserWidgetExpTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_TooltipPanel_Bg_C*                  BP_TooltipPanel_Bg;                                // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_0;                                     // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Percent;                                       // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Title;                                         // 0x0B20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_TotalExp;                                      // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HUD_EXP_Tooltip(int32 EntryPoint);
	void CustomEvent_0();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HUD_EXP_Tooltip_C">();
	}
	static class UBP_HUD_EXP_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HUD_EXP_Tooltip_C>();
	}
};
static_assert(alignof(UBP_HUD_EXP_Tooltip_C) == 0x000008, "Wrong alignment on UBP_HUD_EXP_Tooltip_C");
static_assert(sizeof(UBP_HUD_EXP_Tooltip_C) == 0x000B30, "Wrong size on UBP_HUD_EXP_Tooltip_C");
static_assert(offsetof(UBP_HUD_EXP_Tooltip_C, UberGraphFrame) == 0x000B00, "Member 'UBP_HUD_EXP_Tooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HUD_EXP_Tooltip_C, BP_TooltipPanel_Bg) == 0x000B08, "Member 'UBP_HUD_EXP_Tooltip_C::BP_TooltipPanel_Bg' has a wrong offset!");
static_assert(offsetof(UBP_HUD_EXP_Tooltip_C, TLTextBlock_0) == 0x000B10, "Member 'UBP_HUD_EXP_Tooltip_C::TLTextBlock_0' has a wrong offset!");
static_assert(offsetof(UBP_HUD_EXP_Tooltip_C, TXT_Percent) == 0x000B18, "Member 'UBP_HUD_EXP_Tooltip_C::TXT_Percent' has a wrong offset!");
static_assert(offsetof(UBP_HUD_EXP_Tooltip_C, TXT_Title) == 0x000B20, "Member 'UBP_HUD_EXP_Tooltip_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UBP_HUD_EXP_Tooltip_C, TXT_TotalExp) == 0x000B28, "Member 'UBP_HUD_EXP_Tooltip_C::TXT_TotalExp' has a wrong offset!");

}

