#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeadUI_Simple_Optimization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HeadUI_Simple_Optimization.BP_HeadUI_Simple_Optimization_C
// 0x0030 (0x0B80 - 0x0B50)
class UBP_HeadUI_Simple_Optimization_C final : public UTLUserWidgetHeadUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DetectionAlarmAnim;                                // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_NamePlateFrame_Simple_Optimization_C* BP_NamePlateFrame_Simple_Optimization;             // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               DetectAlarm_glow;                                  // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               DetectAlarm_Icon;                                  // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLGridPanel*                           Detection_GridPanel;                               // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HeadUI_Simple_Optimization(int32 EntryPoint);
	void OnUpdateCombatAlert(ETLCombatAlertType InType);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HeadUI_Simple_Optimization_C">();
	}
	static class UBP_HeadUI_Simple_Optimization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HeadUI_Simple_Optimization_C>();
	}
};
static_assert(alignof(UBP_HeadUI_Simple_Optimization_C) == 0x000008, "Wrong alignment on UBP_HeadUI_Simple_Optimization_C");
static_assert(sizeof(UBP_HeadUI_Simple_Optimization_C) == 0x000B80, "Wrong size on UBP_HeadUI_Simple_Optimization_C");
static_assert(offsetof(UBP_HeadUI_Simple_Optimization_C, UberGraphFrame) == 0x000B50, "Member 'UBP_HeadUI_Simple_Optimization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HeadUI_Simple_Optimization_C, DetectionAlarmAnim) == 0x000B58, "Member 'UBP_HeadUI_Simple_Optimization_C::DetectionAlarmAnim' has a wrong offset!");
static_assert(offsetof(UBP_HeadUI_Simple_Optimization_C, BP_NamePlateFrame_Simple_Optimization) == 0x000B60, "Member 'UBP_HeadUI_Simple_Optimization_C::BP_NamePlateFrame_Simple_Optimization' has a wrong offset!");
static_assert(offsetof(UBP_HeadUI_Simple_Optimization_C, DetectAlarm_glow) == 0x000B68, "Member 'UBP_HeadUI_Simple_Optimization_C::DetectAlarm_glow' has a wrong offset!");
static_assert(offsetof(UBP_HeadUI_Simple_Optimization_C, DetectAlarm_Icon) == 0x000B70, "Member 'UBP_HeadUI_Simple_Optimization_C::DetectAlarm_Icon' has a wrong offset!");
static_assert(offsetof(UBP_HeadUI_Simple_Optimization_C, Detection_GridPanel) == 0x000B78, "Member 'UBP_HeadUI_Simple_Optimization_C::Detection_GridPanel' has a wrong offset!");

}

