#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_StatType_2

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemTooltip_Equip_StatType_2.BP_ItemTooltip_Equip_StatType_2_C.ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2
// 0x0018 (0x0018 - 0x0000)
struct BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0004(0x0008)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2) == 0x000008, "Wrong alignment on BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2");
static_assert(sizeof(BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2) == 0x000018, "Wrong size on BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2, EntryPoint) == 0x000000, "Member 'BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2, K2Node_MakeStruct_SlateChildSize) == 0x000004, "Member 'BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000010, "Member 'BP_ItemTooltip_Equip_StatType_2_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");

// Function BP_ItemTooltip_Equip_StatType_2.BP_ItemTooltip_Equip_StatType_2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTooltip_Equip_StatType_2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_StatType_2_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ItemTooltip_Equip_StatType_2_C_PreConstruct");
static_assert(sizeof(BP_ItemTooltip_Equip_StatType_2_C_PreConstruct) == 0x000001, "Wrong size on BP_ItemTooltip_Equip_StatType_2_C_PreConstruct");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ItemTooltip_Equip_StatType_2_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

