#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_EnchantTrait_Stat

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemTooltip_Equip_EnchantTrait_Stat.BP_ItemTooltip_Equip_EnchantTrait_Stat_C.ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat
// 0x0018 (0x0018 - 0x0000)
struct BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InIsOpenStat;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UTLImage*>                       K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat) == 0x000008, "Wrong alignment on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat");
static_assert(sizeof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat) == 0x000018, "Wrong size on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat, EntryPoint) == 0x000000, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat, CallFunc_AddTextBinding_ReturnValue) == 0x000005, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat, K2Node_Event_InIsOpenStat) == 0x000006, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat::K2Node_Event_InIsOpenStat' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat, CallFunc_AddTextBinding_ReturnValue_1) == 0x000007, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_ItemTooltip_Equip_EnchantTrait_Stat.BP_ItemTooltip_Equip_EnchantTrait_Stat_C.OnTraitStatState
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTooltip_Equip_EnchantTrait_Stat_C_OnTraitStatState final
{
public:
	bool                                          InIsOpenStat;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_OnTraitStatState) == 0x000001, "Wrong alignment on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_OnTraitStatState");
static_assert(sizeof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_OnTraitStatState) == 0x000001, "Wrong size on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_OnTraitStatState");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_OnTraitStatState, InIsOpenStat) == 0x000000, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_OnTraitStatState::InIsOpenStat' has a wrong offset!");

// Function BP_ItemTooltip_Equip_EnchantTrait_Stat.BP_ItemTooltip_Equip_EnchantTrait_Stat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTooltip_Equip_EnchantTrait_Stat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_PreConstruct");
static_assert(sizeof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_PreConstruct) == 0x000001, "Wrong size on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_PreConstruct");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_ItemTooltip_Equip_EnchantTrait_Stat.BP_ItemTooltip_Equip_EnchantTrait_Stat_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemTooltip_Equip_EnchantTrait_Stat_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_GetListItemObject) == 0x000008, "Wrong alignment on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_GetListItemObject");
static_assert(sizeof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_GetListItemObject) == 0x000008, "Wrong size on BP_ItemTooltip_Equip_EnchantTrait_Stat_C_GetListItemObject");
static_assert(offsetof(BP_ItemTooltip_Equip_EnchantTrait_Stat_C_GetListItemObject, ReturnValue) == 0x000000, "Member 'BP_ItemTooltip_Equip_EnchantTrait_Stat_C_GetListItemObject::ReturnValue' has a wrong offset!");

}

