#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_Level_Stat

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemTooltip_Equip_Level_Stat.BP_ItemTooltip_Equip_Level_Stat_C.ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat
// 0x0078 (0x0078 - 0x0000)
struct BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InUnlock;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InValueText;                          // 0x0008(0x0018)(ConstParm)
	bool                                          K2Node_Event_bInUpImage;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInUpColor;                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_4;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat) == 0x000008, "Wrong alignment on BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat");
static_assert(sizeof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat) == 0x000078, "Wrong size on BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, EntryPoint) == 0x000000, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, K2Node_Event_InUnlock) == 0x000004, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::K2Node_Event_InUnlock' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, K2Node_Event_InValueText) == 0x000008, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::K2Node_Event_InValueText' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, K2Node_Event_bInUpImage) == 0x000020, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::K2Node_Event_bInUpImage' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, K2Node_Event_bInUpColor) == 0x000021, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::K2Node_Event_bInUpColor' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, CallFunc_SetVisible_self_CastInput) == 0x000028, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, CallFunc_SetVisible_self_CastInput_1) == 0x000038, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, CallFunc_SetVisible_self_CastInput_2) == 0x000048, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, CallFunc_SetVisible_self_CastInput_3) == 0x000058, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat, CallFunc_SetVisible_self_CastInput_4) == 0x000068, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat::CallFunc_SetVisible_self_CastInput_4' has a wrong offset!");

// Function BP_ItemTooltip_Equip_Level_Stat.BP_ItemTooltip_Equip_Level_Stat_C.OnUpdateValueDiff
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff final
{
public:
	class FText                                   InValueText;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bInUpImage;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInUpColor;                                        // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff) == 0x000008, "Wrong alignment on BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff");
static_assert(sizeof(BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff) == 0x000020, "Wrong size on BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff, InValueText) == 0x000000, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff::InValueText' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff, bInUpImage) == 0x000018, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff::bInUpImage' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff, bInUpColor) == 0x000019, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_OnUpdateValueDiff::bInUpColor' has a wrong offset!");

// Function BP_ItemTooltip_Equip_Level_Stat.BP_ItemTooltip_Equip_Level_Stat_C.OnUnlock
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTooltip_Equip_Level_Stat_C_OnUnlock final
{
public:
	bool                                          InUnlock;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_Level_Stat_C_OnUnlock) == 0x000001, "Wrong alignment on BP_ItemTooltip_Equip_Level_Stat_C_OnUnlock");
static_assert(sizeof(BP_ItemTooltip_Equip_Level_Stat_C_OnUnlock) == 0x000001, "Wrong size on BP_ItemTooltip_Equip_Level_Stat_C_OnUnlock");
static_assert(offsetof(BP_ItemTooltip_Equip_Level_Stat_C_OnUnlock, InUnlock) == 0x000000, "Member 'BP_ItemTooltip_Equip_Level_Stat_C_OnUnlock::InUnlock' has a wrong offset!");

}

