#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_StatType_2_V

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_Equip_StatType_2_V.BP_ItemTooltip_Equip_StatType_2_V_C
// 0x0050 (0x0B70 - 0x0B20)
class UBP_ItemTooltip_Equip_StatType_2_V_C final : public UTLUserWidgetTooltipStatInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLBorder*                              ColorSetting;                                      // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           EnchantedValue;                                    // 0x0B30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Name_0;                                            // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Sector_Line_4;                                     // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         TLCanvasPanel_1;                                   // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_0;                                 // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_0;                                         // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_6;                                     // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Value;                                             // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_2_V(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_Equip_StatType_2_V_C">();
	}
	static class UBP_ItemTooltip_Equip_StatType_2_V_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_Equip_StatType_2_V_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_Equip_StatType_2_V_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_Equip_StatType_2_V_C");
static_assert(sizeof(UBP_ItemTooltip_Equip_StatType_2_V_C) == 0x000B70, "Wrong size on UBP_ItemTooltip_Equip_StatType_2_V_C");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, UberGraphFrame) == 0x000B20, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, ColorSetting) == 0x000B28, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::ColorSetting' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, EnchantedValue) == 0x000B30, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::EnchantedValue' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, Name_0) == 0x000B38, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, Sector_Line_4) == 0x000B40, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::Sector_Line_4' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, TLCanvasPanel_1) == 0x000B48, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::TLCanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, TLHorizontalBox_0) == 0x000B50, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::TLHorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, TLImage_0) == 0x000B58, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::TLImage_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, TLTextBlock_6) == 0x000B60, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::TLTextBlock_6' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_2_V_C, Value) == 0x000B68, "Member 'UBP_ItemTooltip_Equip_StatType_2_V_C::Value' has a wrong offset!");

}

