#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemToolTip_ContextMenuFrame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemToolTip_ContextMenuFrame.BP_ItemToolTip_ContextMenuFrame_C
// 0x0070 (0x1660 - 0x15F0)
class UBP_ItemToolTip_ContextMenuFrame_C final : public UTLUserWidgetContextMenuList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x15F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x1600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_UI_BTN_PopUp_Close_C*               BP_Close;                                          // 0x1608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_BTN_C*      BP_ItemToolTip_ContextMenu_BTN;                    // 0x1610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_BTN_C*      BP_ItemToolTip_ContextMenu_BTN_1;                  // 0x1618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_BTN_C*      BP_ItemToolTip_ContextMenu_BTN_2;                  // 0x1620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_BTN_C*      BP_ItemToolTip_ContextMenu_BTN_3;                  // 0x1628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         MenuList;                                          // 0x1630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TitleText_KeyIcon;                                 // 0x1638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage;                                           // 0x1640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_48;                                        // 0x1648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_81;                                        // 0x1650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_0;                                       // 0x1658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemToolTip_ContextMenuFrame(int32 EntryPoint);
	void BP_OnChangeCharacterAlive(bool InAlive, ETLSetAliveSource InAliveSource);
	void CustomEvent_0();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemToolTip_ContextMenuFrame_C">();
	}
	static class UBP_ItemToolTip_ContextMenuFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemToolTip_ContextMenuFrame_C>();
	}
};
static_assert(alignof(UBP_ItemToolTip_ContextMenuFrame_C) == 0x000010, "Wrong alignment on UBP_ItemToolTip_ContextMenuFrame_C");
static_assert(sizeof(UBP_ItemToolTip_ContextMenuFrame_C) == 0x001660, "Wrong size on UBP_ItemToolTip_ContextMenuFrame_C");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, UberGraphFrame) == 0x0015F0, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, Disappear) == 0x0015F8, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::Disappear' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, Appear) == 0x001600, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::Appear' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, BP_Close) == 0x001608, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::BP_Close' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, BP_ItemToolTip_ContextMenu_BTN) == 0x001610, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::BP_ItemToolTip_ContextMenu_BTN' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, BP_ItemToolTip_ContextMenu_BTN_1) == 0x001618, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::BP_ItemToolTip_ContextMenu_BTN_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, BP_ItemToolTip_ContextMenu_BTN_2) == 0x001620, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::BP_ItemToolTip_ContextMenu_BTN_2' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, BP_ItemToolTip_ContextMenu_BTN_3) == 0x001628, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::BP_ItemToolTip_ContextMenu_BTN_3' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, MenuList) == 0x001630, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::MenuList' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, TitleText_KeyIcon) == 0x001638, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::TitleText_KeyIcon' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, TLImage) == 0x001640, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::TLImage' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, TLImage_48) == 0x001648, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::TLImage_48' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, TLImage_81) == 0x001650, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::TLImage_81' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuFrame_C, TLSizeBox_0) == 0x001658, "Member 'UBP_ItemToolTip_ContextMenuFrame_C::TLSizeBox_0' has a wrong offset!");

}

