#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_RuneSystem_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_RuneSystem_Slot.BP_ItemTooltip_RuneSystem_Slot_C
// 0x00D8 (0x1368 - 0x1290)
class UBP_ItemTooltip_RuneSystem_Slot_C final : public UTLUserWidgetRuneSocketViewSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               ItemIcon_Rune;                                     // 0x1298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         LevelPoint_Panel;                                  // 0x12A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_Rune_Soket;                                    // 0x12A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              TLGradeBorder;                                     // 0x12B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLGradeLine;                                       // 0x12B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_Rune_Grade;                                // 0x12C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_Rune_Grade_FX;                             // 0x12C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_Rune_Synergy_Fx;                           // 0x12D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_SocketHamor;                               // 0x12D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_SocketType;                                // 0x12E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXTUpgrade;                                        // 0x12E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_SynergyOFF;                                   // 0x12F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_SynergyOn_C;                                  // 0x1308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_SynergyOn_B;                                  // 0x1320(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_SynergyOn_A;                                  // 0x1338(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_SynergyOn_AA;                                 // 0x1350(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemTooltip_RuneSystem_Slot(int32 EntryPoint);
	void OnActiveSynergy(bool InIsActive, EItemGrade InSynergyGrade);
	void OnNotOpenSocket(bool InIsNotOpen);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_RuneSystem_Slot_C">();
	}
	static class UBP_ItemTooltip_RuneSystem_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_RuneSystem_Slot_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_RuneSystem_Slot_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_RuneSystem_Slot_C");
static_assert(sizeof(UBP_ItemTooltip_RuneSystem_Slot_C) == 0x001368, "Wrong size on UBP_ItemTooltip_RuneSystem_Slot_C");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, UberGraphFrame) == 0x001290, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, ItemIcon_Rune) == 0x001298, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::ItemIcon_Rune' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, LevelPoint_Panel) == 0x0012A0, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::LevelPoint_Panel' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, Tex_Rune_Soket) == 0x0012A8, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::Tex_Rune_Soket' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TLGradeBorder) == 0x0012B0, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TLGradeBorder' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TLGradeLine) == 0x0012B8, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TLGradeLine' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TLImage_Rune_Grade) == 0x0012C0, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TLImage_Rune_Grade' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TLImage_Rune_Grade_FX) == 0x0012C8, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TLImage_Rune_Grade_FX' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TLImage_Rune_Synergy_Fx) == 0x0012D0, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TLImage_Rune_Synergy_Fx' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TLImage_SocketHamor) == 0x0012D8, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TLImage_SocketHamor' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TLImage_SocketType) == 0x0012E0, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TLImage_SocketType' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, TXTUpgrade) == 0x0012E8, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::TXTUpgrade' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, Path_SynergyOFF) == 0x0012F0, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::Path_SynergyOFF' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, Path_SynergyOn_C) == 0x001308, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::Path_SynergyOn_C' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, Path_SynergyOn_B) == 0x001320, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::Path_SynergyOn_B' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, Path_SynergyOn_A) == 0x001338, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::Path_SynergyOn_A' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_Slot_C, Path_SynergyOn_AA) == 0x001350, "Member 'UBP_ItemTooltip_RuneSystem_Slot_C::Path_SynergyOn_AA' has a wrong offset!");

}

