#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_Widget.BP_ItemTooltip_Widget_C
// 0x0048 (0x0B00 - 0x0AB8)
class UBP_ItemTooltip_Widget_C final : public UTLUserWidgetItemTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FIXED;                                             // 0x0AC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemTooltip_Consume_Frame_C*        BP_ItemTooltip_Consume_Frame;                      // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_Frame_C*          BP_ItemTooltip_Equip_Frame;                        // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               FixedImages;                                       // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               FixedImages_1;                                     // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         TLCanvasPanel_0;                                   // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLWidgetSwitcher*                      TLWidgetSwitcher_0;                                // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          RorL_ONOFF;                                        // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ItemTooltip_Widget(int32 EntryPoint);
	void OnFixedEvent(bool InFixed);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_Widget_C">();
	}
	static class UBP_ItemTooltip_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_Widget_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_Widget_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_Widget_C");
static_assert(sizeof(UBP_ItemTooltip_Widget_C) == 0x000B00, "Wrong size on UBP_ItemTooltip_Widget_C");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, UberGraphFrame) == 0x000AB8, "Member 'UBP_ItemTooltip_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, FIXED) == 0x000AC0, "Member 'UBP_ItemTooltip_Widget_C::FIXED' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, BP_ItemTooltip_Consume_Frame) == 0x000AC8, "Member 'UBP_ItemTooltip_Widget_C::BP_ItemTooltip_Consume_Frame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, BP_ItemTooltip_Equip_Frame) == 0x000AD0, "Member 'UBP_ItemTooltip_Widget_C::BP_ItemTooltip_Equip_Frame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, FixedImages) == 0x000AD8, "Member 'UBP_ItemTooltip_Widget_C::FixedImages' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, FixedImages_1) == 0x000AE0, "Member 'UBP_ItemTooltip_Widget_C::FixedImages_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, TLCanvasPanel_0) == 0x000AE8, "Member 'UBP_ItemTooltip_Widget_C::TLCanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, TLWidgetSwitcher_0) == 0x000AF0, "Member 'UBP_ItemTooltip_Widget_C::TLWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Widget_C, RorL_ONOFF) == 0x000AF8, "Member 'UBP_ItemTooltip_Widget_C::RorL_ONOFF' has a wrong offset!");

}

