#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemPlatePanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemPlatePanel.BP_ItemPlatePanel_C
// 0x0040 (0x1040 - 0x1000)
class UBP_ItemPlatePanel_C final : public UTLUserWidgetNamePlate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1000(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BTNDisable_Reverse;                                // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BTNDisable;                                        // 0x1010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BTNUnhover;                                        // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BTNHover;                                          // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               BG;                                                // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              TLBorder_0;                                        // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextItmeName;                                    // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemPlatePanel(int32 EntryPoint);
	void OnOwnershipLost();
	void PreConstruct(bool IsDesignTime);
	void OnOwnershipGained();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemPlatePanel_C">();
	}
	static class UBP_ItemPlatePanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemPlatePanel_C>();
	}
};
static_assert(alignof(UBP_ItemPlatePanel_C) == 0x000008, "Wrong alignment on UBP_ItemPlatePanel_C");
static_assert(sizeof(UBP_ItemPlatePanel_C) == 0x001040, "Wrong size on UBP_ItemPlatePanel_C");
static_assert(offsetof(UBP_ItemPlatePanel_C, UberGraphFrame) == 0x001000, "Member 'UBP_ItemPlatePanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemPlatePanel_C, BTNDisable_Reverse) == 0x001008, "Member 'UBP_ItemPlatePanel_C::BTNDisable_Reverse' has a wrong offset!");
static_assert(offsetof(UBP_ItemPlatePanel_C, BTNDisable) == 0x001010, "Member 'UBP_ItemPlatePanel_C::BTNDisable' has a wrong offset!");
static_assert(offsetof(UBP_ItemPlatePanel_C, BTNUnhover) == 0x001018, "Member 'UBP_ItemPlatePanel_C::BTNUnhover' has a wrong offset!");
static_assert(offsetof(UBP_ItemPlatePanel_C, BTNHover) == 0x001020, "Member 'UBP_ItemPlatePanel_C::BTNHover' has a wrong offset!");
static_assert(offsetof(UBP_ItemPlatePanel_C, BG) == 0x001028, "Member 'UBP_ItemPlatePanel_C::BG' has a wrong offset!");
static_assert(offsetof(UBP_ItemPlatePanel_C, TLBorder_0) == 0x001030, "Member 'UBP_ItemPlatePanel_C::TLBorder_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemPlatePanel_C, TLTextItmeName) == 0x001038, "Member 'UBP_ItemPlatePanel_C::TLTextItmeName' has a wrong offset!");

}

