#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_RuneSystem

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemTooltip_RuneSystem.BP_ItemTooltip_RuneSystem_C.ExecuteUbergraph_BP_ItemTooltip_RuneSystem
// 0x0030 (0x0030 - 0x0000)
struct BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InIsActive;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemGrade                                    K2Node_Event_InSynergyGrade;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTLUserWidgetRuneSocketViewSlot*> K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem) == 0x000008, "Wrong alignment on BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem");
static_assert(sizeof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem) == 0x000030, "Wrong size on BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem, EntryPoint) == 0x000000, "Member 'BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem, K2Node_Event_InIsActive) == 0x000005, "Member 'BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem::K2Node_Event_InIsActive' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem, K2Node_Event_InSynergyGrade) == 0x000006, "Member 'BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem::K2Node_Event_InSynergyGrade' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem, CallFunc_ShowWithValue_self_CastInput) == 0x000020, "Member 'BP_ItemTooltip_RuneSystem_C_ExecuteUbergraph_BP_ItemTooltip_RuneSystem::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");

// Function BP_ItemTooltip_RuneSystem.BP_ItemTooltip_RuneSystem_C.OnActiveRuneSynergy
// 0x0002 (0x0002 - 0x0000)
struct BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy final
{
public:
	bool                                          InIsActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemGrade                                    InSynergyGrade;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy) == 0x000001, "Wrong alignment on BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy");
static_assert(sizeof(BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy) == 0x000002, "Wrong size on BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy, InIsActive) == 0x000000, "Member 'BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy::InIsActive' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy, InSynergyGrade) == 0x000001, "Member 'BP_ItemTooltip_RuneSystem_C_OnActiveRuneSynergy::InSynergyGrade' has a wrong offset!");

// Function BP_ItemTooltip_RuneSystem.BP_ItemTooltip_RuneSystem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTooltip_RuneSystem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_RuneSystem_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ItemTooltip_RuneSystem_C_PreConstruct");
static_assert(sizeof(BP_ItemTooltip_RuneSystem_C_PreConstruct) == 0x000001, "Wrong size on BP_ItemTooltip_RuneSystem_C_PreConstruct");
static_assert(offsetof(BP_ItemTooltip_RuneSystem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ItemTooltip_RuneSystem_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

