#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_StatType_3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_Equip_StatType_3.BP_ItemTooltip_Equip_StatType_3_C
// 0x0060 (0x0B10 - 0x0AB0)
class UBP_ItemTooltip_Equip_StatType_3_C final : public UTLUserWidgetTooltipSkillInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               ActiveFrame;                                       // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               BG;                                                // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               PassiveFrame;                                      // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Skill;                                             // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         SkillIcon;                                         // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             SkilllevelPanel;                                   // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Skilltitle;                                        // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              TLBorder_0;                                        // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLGradeLine;                                       // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_0;                                     // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_SkillLevel;                                    // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_3(int32 EntryPoint);
	void OnUpdatePassiveSkill();
	void OnUpdateActiveSkill();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_Equip_StatType_3_C">();
	}
	static class UBP_ItemTooltip_Equip_StatType_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_Equip_StatType_3_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_Equip_StatType_3_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_Equip_StatType_3_C");
static_assert(sizeof(UBP_ItemTooltip_Equip_StatType_3_C) == 0x000B10, "Wrong size on UBP_ItemTooltip_Equip_StatType_3_C");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, UberGraphFrame) == 0x000AB0, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, ActiveFrame) == 0x000AB8, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::ActiveFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, BG) == 0x000AC0, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::BG' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, PassiveFrame) == 0x000AC8, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::PassiveFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, Skill) == 0x000AD0, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::Skill' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, SkillIcon) == 0x000AD8, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::SkillIcon' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, SkilllevelPanel) == 0x000AE0, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::SkilllevelPanel' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, Skilltitle) == 0x000AE8, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::Skilltitle' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, TLBorder_0) == 0x000AF0, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::TLBorder_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, TLGradeLine) == 0x000AF8, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::TLGradeLine' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, TLTextBlock_0) == 0x000B00, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::TLTextBlock_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_StatType_3_C, TXT_SkillLevel) == 0x000B08, "Member 'UBP_ItemTooltip_Equip_StatType_3_C::TXT_SkillLevel' has a wrong offset!");

}

