#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_CompareItemTexture

#include "Basic.hpp"

#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_Equip_CompareItemTexture.BP_ItemTooltip_Equip_CompareItemTexture_C
// 0x0020 (0x0AA0 - 0x0A80)
class UBP_ItemTooltip_Equip_CompareItemTexture_C final : public UTLUserWidget
{
public:
	class UWidgetAnimation*                       HideAnim;                                          // 0x0A80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Compare;                                           // 0x0A88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               IMG_CompareLine;                                   // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemSlot_CompareFrame;                             // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_Equip_CompareItemTexture_C">();
	}
	static class UBP_ItemTooltip_Equip_CompareItemTexture_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_Equip_CompareItemTexture_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_Equip_CompareItemTexture_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_Equip_CompareItemTexture_C");
static_assert(sizeof(UBP_ItemTooltip_Equip_CompareItemTexture_C) == 0x000AA0, "Wrong size on UBP_ItemTooltip_Equip_CompareItemTexture_C");
static_assert(offsetof(UBP_ItemTooltip_Equip_CompareItemTexture_C, HideAnim) == 0x000A80, "Member 'UBP_ItemTooltip_Equip_CompareItemTexture_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_CompareItemTexture_C, Compare) == 0x000A88, "Member 'UBP_ItemTooltip_Equip_CompareItemTexture_C::Compare' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_CompareItemTexture_C, IMG_CompareLine) == 0x000A90, "Member 'UBP_ItemTooltip_Equip_CompareItemTexture_C::IMG_CompareLine' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_CompareItemTexture_C, ItemSlot_CompareFrame) == 0x000A98, "Member 'UBP_ItemTooltip_Equip_CompareItemTexture_C::ItemSlot_CompareFrame' has a wrong offset!");

}

