#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_Level_Stat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_Equip_Level_Stat.BP_ItemTooltip_Equip_Level_Stat_C
// 0x0078 (0x0B20 - 0x0AA8)
class UBP_ItemTooltip_Equip_Level_Stat_C final : public UTLUserWidgetItemTooltipLevelStatInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLBorder*                              ColorSetting;                                      // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         TLCanvasPanel_1;                                   // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_0;                                         // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_6;                                     // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Level;                                         // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_NAME;                                          // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Value;                                         // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE9[0x7];                                      // 0x0AE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        UnlockOn_FontStyle;                                // 0x0AF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        UnlockOff_FontStyle;                               // 0x0B08(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemTooltip_Equip_Level_Stat(int32 EntryPoint);
	void OnUpdateCompareDelete();
	void OnUpdateCompareNew();
	void OnUpdateNoDiff();
	void OnUpdateValueDiff(const class FText& InValueText, bool bInUpImage, bool bInUpColor);
	void OnUnlock(bool InUnlock);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_Equip_Level_Stat_C">();
	}
	static class UBP_ItemTooltip_Equip_Level_Stat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_Equip_Level_Stat_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_Equip_Level_Stat_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_Equip_Level_Stat_C");
static_assert(sizeof(UBP_ItemTooltip_Equip_Level_Stat_C) == 0x000B20, "Wrong size on UBP_ItemTooltip_Equip_Level_Stat_C");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, UberGraphFrame) == 0x000AA8, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, ColorSetting) == 0x000AB0, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::ColorSetting' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, TLCanvasPanel_1) == 0x000AB8, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::TLCanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, TLImage_0) == 0x000AC0, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::TLImage_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, TLTextBlock_6) == 0x000AC8, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::TLTextBlock_6' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, TXT_Level) == 0x000AD0, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::TXT_Level' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, TXT_NAME) == 0x000AD8, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::TXT_NAME' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, TXT_Value) == 0x000AE0, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::TXT_Value' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, NewVar_0) == 0x000AE8, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, UnlockOn_FontStyle) == 0x000AF0, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::UnlockOn_FontStyle' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_Level_Stat_C, UnlockOff_FontStyle) == 0x000B08, "Member 'UBP_ItemTooltip_Equip_Level_Stat_C::UnlockOff_FontStyle' has a wrong offset!");

}

