#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemToolTip_ContextMenuConsoleFrame

#include "Basic.hpp"

#include "TLScheme_structs.hpp"
#include "TLClient_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemToolTip_ContextMenuConsoleFrame.BP_ItemToolTip_ContextMenuConsoleFrame_C.ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame
// 0x0038 (0x0038 - 0x0000)
struct BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InAlive;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLSetAliveSource                             K2Node_Event_InAliveSource;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLMenuGroupPanel                      K2Node_MakeStruct_TLMenuGroupPanel;                // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FTLMenuGroupPanel>              K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame) == 0x000008, "Wrong alignment on BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame");
static_assert(sizeof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame) == 0x000038, "Wrong size on BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame, EntryPoint) == 0x000000, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame, K2Node_Event_InAlive) == 0x000004, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame::K2Node_Event_InAlive' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame, K2Node_Event_InAliveSource) == 0x000005, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame::K2Node_Event_InAliveSource' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame, K2Node_MakeStruct_TLMenuGroupPanel) == 0x000008, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame::K2Node_MakeStruct_TLMenuGroupPanel' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame, CallFunc_SetVisible_self_CastInput) == 0x000018, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_ItemToolTip_ContextMenuConsoleFrame.BP_ItemToolTip_ContextMenuConsoleFrame_C.BP_OnChangeCharacterAlive
// 0x0002 (0x0002 - 0x0000)
struct BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive final
{
public:
	bool                                          InAlive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLSetAliveSource                             InAliveSource;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive) == 0x000001, "Wrong alignment on BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive");
static_assert(sizeof(BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive) == 0x000002, "Wrong size on BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive, InAlive) == 0x000000, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive::InAlive' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive, InAliveSource) == 0x000001, "Member 'BP_ItemToolTip_ContextMenuConsoleFrame_C_BP_OnChangeCharacterAlive::InAliveSource' has a wrong offset!");

}

