#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_ItemIconList_Type

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_ItemIconList_Type.BP_ItemTooltip_ItemIconList_Type_C
// 0x0030 (0x14C0 - 0x1490)
class UBP_ItemTooltip_ItemIconList_Type_C final : public UTLUserWidgetItemTooltipSetInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ItemTooltip_Equip_PackageView_SlotList_Slot_C* BP_ItemTooltip_Equip_PackageView_SlotList_Slot;    // 0x1498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_PackageView_SlotList_Slot_C* BP_ItemTooltip_Equip_PackageView_SlotList_Slot_114; // 0x14A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TlHorizontal_Subtext_Widget;                       // 0x14A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_DeScription;                                   // 0x14B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_SETItem;                                       // 0x14B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type(int32 EntryPoint);
	void OnUpdateDescription(const class FText& InText);
	void PreConstruct(bool IsDesignTime);

	class UObject* GetListItemObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_ItemIconList_Type_C">();
	}
	static class UBP_ItemTooltip_ItemIconList_Type_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_ItemIconList_Type_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_ItemIconList_Type_C) == 0x000010, "Wrong alignment on UBP_ItemTooltip_ItemIconList_Type_C");
static_assert(sizeof(UBP_ItemTooltip_ItemIconList_Type_C) == 0x0014C0, "Wrong size on UBP_ItemTooltip_ItemIconList_Type_C");
static_assert(offsetof(UBP_ItemTooltip_ItemIconList_Type_C, UberGraphFrame) == 0x001490, "Member 'UBP_ItemTooltip_ItemIconList_Type_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ItemIconList_Type_C, BP_ItemTooltip_Equip_PackageView_SlotList_Slot) == 0x001498, "Member 'UBP_ItemTooltip_ItemIconList_Type_C::BP_ItemTooltip_Equip_PackageView_SlotList_Slot' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ItemIconList_Type_C, BP_ItemTooltip_Equip_PackageView_SlotList_Slot_114) == 0x0014A0, "Member 'UBP_ItemTooltip_ItemIconList_Type_C::BP_ItemTooltip_Equip_PackageView_SlotList_Slot_114' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ItemIconList_Type_C, TlHorizontal_Subtext_Widget) == 0x0014A8, "Member 'UBP_ItemTooltip_ItemIconList_Type_C::TlHorizontal_Subtext_Widget' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ItemIconList_Type_C, TXT_DeScription) == 0x0014B0, "Member 'UBP_ItemTooltip_ItemIconList_Type_C::TXT_DeScription' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ItemIconList_Type_C, TXT_SETItem) == 0x0014B8, "Member 'UBP_ItemTooltip_ItemIconList_Type_C::TXT_SETItem' has a wrong offset!");

}

