#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_ConsumeStatGroup

#include "Basic.hpp"

#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_ConsumeStatGroup.BP_ItemTooltip_ConsumeStatGroup_C
// 0x00F8 (0x0B88 - 0x0A90)
class UBP_ItemTooltip_ConsumeStatGroup_C final : public UTLUserWidgetTooltipScrollContent
{
public:
	class UBP_ItemTooltip_Equip_StatType_2_V_C*   BP_ItemTooltip_Equip_StatType_2_H;                 // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_1;                // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_2;                // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_3;                // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_4;                // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_5;                // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_6;                // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_7;                // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_8;                // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_9;                // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemTextList_Type_C*    BP_ItemTooltip_ItemTextList_Type_10;               // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_LatestDeal_State_C*     BP_ItemTooltip_LatestDeal_State;                   // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_LatestVolume_State_C*   BP_ItemTooltip_LatestVolume_State;                 // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           DungeonPoint_TXT;                                  // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           LevelLimit;                                        // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       OwnNum;                                            // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Package_View_Box;                                  // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       RequireLevel_HorizontalBox;                        // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RequireLevelNumber_TextBlock;                      // 0x0B20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_1;                                 // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_63;                                        // 0x0B30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_11;                                    // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_12;                                    // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_DeScription;                                   // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_ItemLifeTime;                                  // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_OwnedNum;                                      // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_PackagePreviewGuide;                           // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Pakage_Guide;                                  // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_SeaSonpass_Disalbe;                            // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       WeaponMastery_HBox;                                // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           WeaponMasteryPointValue;                           // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_ConsumeStatGroup_C">();
	}
	static class UBP_ItemTooltip_ConsumeStatGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_ConsumeStatGroup_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_ConsumeStatGroup_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_ConsumeStatGroup_C");
static_assert(sizeof(UBP_ItemTooltip_ConsumeStatGroup_C) == 0x000B88, "Wrong size on UBP_ItemTooltip_ConsumeStatGroup_C");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_Equip_StatType_2_H) == 0x000A90, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_Equip_StatType_2_H' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_1) == 0x000A98, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_2) == 0x000AA0, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_2' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_3) == 0x000AA8, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_3' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_4) == 0x000AB0, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_4' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_5) == 0x000AB8, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_5' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_6) == 0x000AC0, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_6' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_7) == 0x000AC8, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_7' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_8) == 0x000AD0, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_8' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_9) == 0x000AD8, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_9' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_ItemTextList_Type_10) == 0x000AE0, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_ItemTextList_Type_10' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_LatestDeal_State) == 0x000AE8, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_LatestDeal_State' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, BP_ItemTooltip_LatestVolume_State) == 0x000AF0, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::BP_ItemTooltip_LatestVolume_State' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, DungeonPoint_TXT) == 0x000AF8, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::DungeonPoint_TXT' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, LevelLimit) == 0x000B00, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::LevelLimit' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, OwnNum) == 0x000B08, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::OwnNum' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, Package_View_Box) == 0x000B10, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::Package_View_Box' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, RequireLevel_HorizontalBox) == 0x000B18, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::RequireLevel_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, RequireLevelNumber_TextBlock) == 0x000B20, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::RequireLevelNumber_TextBlock' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TLHorizontalBox_1) == 0x000B28, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TLHorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TLImage_63) == 0x000B30, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TLImage_63' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TLTextBlock_11) == 0x000B38, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TLTextBlock_11' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TLTextBlock_12) == 0x000B40, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TLTextBlock_12' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TXT_DeScription) == 0x000B48, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TXT_DeScription' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TXT_ItemLifeTime) == 0x000B50, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TXT_ItemLifeTime' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TXT_OwnedNum) == 0x000B58, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TXT_OwnedNum' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TXT_PackagePreviewGuide) == 0x000B60, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TXT_PackagePreviewGuide' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TXT_Pakage_Guide) == 0x000B68, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TXT_Pakage_Guide' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, TXT_SeaSonpass_Disalbe) == 0x000B70, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::TXT_SeaSonpass_Disalbe' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, WeaponMastery_HBox) == 0x000B78, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::WeaponMastery_HBox' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_ConsumeStatGroup_C, WeaponMasteryPointValue) == 0x000B80, "Member 'UBP_ItemTooltip_ConsumeStatGroup_C::WeaponMasteryPointValue' has a wrong offset!");

}

