#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemToolTip_ContextMenu_BTN

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemToolTip_ContextMenu_BTN.BP_ItemToolTip_ContextMenu_BTN_C.ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN
// 0x0048 (0x0048 - 0x0000)
struct BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 CallFunc_GetUIPlatform_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN) == 0x000008, "Wrong alignment on BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN");
static_assert(sizeof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN) == 0x000048, "Wrong size on BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN");
static_assert(offsetof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN, EntryPoint) == 0x000000, "Member 'BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN, CallFunc_GetUIPlatform_ReturnValue) == 0x000004, "Member 'BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN::CallFunc_GetUIPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN, CallFunc_SetVisible_self_CastInput_1) == 0x000018, "Member 'BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN, CallFunc_SetVisible_self_CastInput_2) == 0x000028, "Member 'BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN, CallFunc_SetVisible_self_CastInput_3) == 0x000038, "Member 'BP_ItemToolTip_ContextMenu_BTN_C_ExecuteUbergraph_BP_ItemToolTip_ContextMenu_BTN::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");

}

