#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionActionIcon_PC

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractionActionIcon_PC.BP_InteractionActionIcon_PC_C.ExecuteUbergraph_BP_InteractionActionIcon_PC
// 0x0068 (0x0068 - 0x0000)
struct BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECastingEndReason                             K2Node_Event_CastingEndReason;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsMyPc;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC) == 0x000008, "Wrong alignment on BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC");
static_assert(sizeof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC) == 0x000068, "Wrong size on BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, EntryPoint) == 0x000000, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, K2Node_Event_CastingEndReason) == 0x000005, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::K2Node_Event_CastingEndReason' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_SetVisible_self_CastInput_1) == 0x000018, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_SetVisible_self_CastInput_2) == 0x000028, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000048, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000050, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000058, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC, K2Node_Event_bIsMyPc) == 0x000060, "Member 'BP_InteractionActionIcon_PC_C_ExecuteUbergraph_BP_InteractionActionIcon_PC::K2Node_Event_bIsMyPc' has a wrong offset!");

// Function BP_InteractionActionIcon_PC.BP_InteractionActionIcon_PC_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionActionIcon_PC_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractionActionIcon_PC_C_PreConstruct) == 0x000001, "Wrong alignment on BP_InteractionActionIcon_PC_C_PreConstruct");
static_assert(sizeof(BP_InteractionActionIcon_PC_C_PreConstruct) == 0x000001, "Wrong size on BP_InteractionActionIcon_PC_C_PreConstruct");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_InteractionActionIcon_PC_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_InteractionActionIcon_PC.BP_InteractionActionIcon_PC_C.OnCastingEnd
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionActionIcon_PC_C_OnCastingEnd final
{
public:
	ECastingEndReason                             CastingEndReason;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionActionIcon_PC_C_OnCastingEnd) == 0x000001, "Wrong alignment on BP_InteractionActionIcon_PC_C_OnCastingEnd");
static_assert(sizeof(BP_InteractionActionIcon_PC_C_OnCastingEnd) == 0x000001, "Wrong size on BP_InteractionActionIcon_PC_C_OnCastingEnd");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_OnCastingEnd, CastingEndReason) == 0x000000, "Member 'BP_InteractionActionIcon_PC_C_OnCastingEnd::CastingEndReason' has a wrong offset!");

// Function BP_InteractionActionIcon_PC.BP_InteractionActionIcon_PC_C.OnCastingStart
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionActionIcon_PC_C_OnCastingStart final
{
public:
	bool                                          bIsMyPc;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractionActionIcon_PC_C_OnCastingStart) == 0x000001, "Wrong alignment on BP_InteractionActionIcon_PC_C_OnCastingStart");
static_assert(sizeof(BP_InteractionActionIcon_PC_C_OnCastingStart) == 0x000001, "Wrong size on BP_InteractionActionIcon_PC_C_OnCastingStart");
static_assert(offsetof(BP_InteractionActionIcon_PC_C_OnCastingStart, bIsMyPc) == 0x000000, "Member 'BP_InteractionActionIcon_PC_C_OnCastingStart::bIsMyPc' has a wrong offset!");

}

