#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_StatType_Effect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemTooltip_Equip_StatType_Effect.BP_ItemTooltip_Equip_StatType_Effect_C.ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect
// 0x0018 (0x0018 - 0x0000)
struct BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect) == 0x000004, "Wrong alignment on BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect");
static_assert(sizeof(BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect) == 0x000018, "Wrong size on BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect, EntryPoint) == 0x000000, "Member 'BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x000014, "Member 'BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect, K2Node_Event_IsDesignTime) == 0x000015, "Member 'BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect, CallFunc_AddTextBinding_ReturnValue) == 0x000016, "Member 'BP_ItemTooltip_Equip_StatType_Effect_C_ExecuteUbergraph_BP_ItemTooltip_Equip_StatType_Effect::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");

// Function BP_ItemTooltip_Equip_StatType_Effect.BP_ItemTooltip_Equip_StatType_Effect_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTooltip_Equip_StatType_Effect_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_Equip_StatType_Effect_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ItemTooltip_Equip_StatType_Effect_C_PreConstruct");
static_assert(sizeof(BP_ItemTooltip_Equip_StatType_Effect_C_PreConstruct) == 0x000001, "Wrong size on BP_ItemTooltip_Equip_StatType_Effect_C_PreConstruct");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_Effect_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ItemTooltip_Equip_StatType_Effect_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_ItemTooltip_Equip_StatType_Effect.BP_ItemTooltip_Equip_StatType_Effect_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemTooltip_Equip_StatType_Effect_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTooltip_Equip_StatType_Effect_C_GetListItemObject) == 0x000008, "Wrong alignment on BP_ItemTooltip_Equip_StatType_Effect_C_GetListItemObject");
static_assert(sizeof(BP_ItemTooltip_Equip_StatType_Effect_C_GetListItemObject) == 0x000008, "Wrong size on BP_ItemTooltip_Equip_StatType_Effect_C_GetListItemObject");
static_assert(offsetof(BP_ItemTooltip_Equip_StatType_Effect_C_GetListItemObject, ReturnValue) == 0x000000, "Member 'BP_ItemTooltip_Equip_StatType_Effect_C_GetListItemObject::ReturnValue' has a wrong offset!");

}

