#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemToolTip_ContextMenuConsoleFrame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemToolTip_ContextMenuConsoleFrame.BP_ItemToolTip_ContextMenuConsoleFrame_C
// 0x0040 (0x1630 - 0x15F0)
class UBP_ItemToolTip_ContextMenuConsoleFrame_C final : public UTLUserWidgetContextMenuList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ItemToolTip_ContextMenu_ConsoleBTN_C* BP_ItemToolTip_ContextMenu_ConsoleBTN;             // 0x15F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_ConsoleBTN_C* BP_ItemToolTip_ContextMenu_ConsoleBTN_1;           // 0x1600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_ConsoleBTN_C* BP_ItemToolTip_ContextMenu_ConsoleBTN_2;           // 0x1608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_ConsoleBTN_C* BP_ItemToolTip_ContextMenu_ConsoleBTN_3;           // 0x1610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenu_ConsoleBTN_C* BP_ItemToolTip_ContextMenu_ConsoleBTN_4;           // 0x1618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         MenuList;                                          // 0x1620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_0;                                       // 0x1628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemToolTip_ContextMenuConsoleFrame(int32 EntryPoint);
	void BP_OnChangeCharacterAlive(bool InAlive, ETLSetAliveSource InAliveSource);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemToolTip_ContextMenuConsoleFrame_C">();
	}
	static class UBP_ItemToolTip_ContextMenuConsoleFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemToolTip_ContextMenuConsoleFrame_C>();
	}
};
static_assert(alignof(UBP_ItemToolTip_ContextMenuConsoleFrame_C) == 0x000010, "Wrong alignment on UBP_ItemToolTip_ContextMenuConsoleFrame_C");
static_assert(sizeof(UBP_ItemToolTip_ContextMenuConsoleFrame_C) == 0x001630, "Wrong size on UBP_ItemToolTip_ContextMenuConsoleFrame_C");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, UberGraphFrame) == 0x0015F0, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, BP_ItemToolTip_ContextMenu_ConsoleBTN) == 0x0015F8, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::BP_ItemToolTip_ContextMenu_ConsoleBTN' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, BP_ItemToolTip_ContextMenu_ConsoleBTN_1) == 0x001600, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::BP_ItemToolTip_ContextMenu_ConsoleBTN_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, BP_ItemToolTip_ContextMenu_ConsoleBTN_2) == 0x001608, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::BP_ItemToolTip_ContextMenu_ConsoleBTN_2' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, BP_ItemToolTip_ContextMenu_ConsoleBTN_3) == 0x001610, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::BP_ItemToolTip_ContextMenu_ConsoleBTN_3' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, BP_ItemToolTip_ContextMenu_ConsoleBTN_4) == 0x001618, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::BP_ItemToolTip_ContextMenu_ConsoleBTN_4' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, MenuList) == 0x001620, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::MenuList' has a wrong offset!");
static_assert(offsetof(UBP_ItemToolTip_ContextMenuConsoleFrame_C, TLSizeBox_0) == 0x001628, "Member 'UBP_ItemToolTip_ContextMenuConsoleFrame_C::TLSizeBox_0' has a wrong offset!");

}

