#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_RuneSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_RuneSystem.BP_ItemTooltip_RuneSystem_C
// 0x0068 (0x0CF0 - 0x0C88)
class UBP_ItemTooltip_RuneSystem_C final : public UTLUserWidgetTooltipItemRuneSocket
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ItemTooltip_RuneSystem_Slot_C*      BP_ItemTooltip_RuneSystem_Slot;                    // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_RuneSystem_Slot_C*      BP_ItemTooltip_RuneSystem_Slot_1;                  // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_RuneSystem_Slot_C*      BP_ItemTooltip_RuneSystem_Slot_2;                  // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_RuneSystem_Synergy_Text_C*          BP_RuneSystem_Synergy_Text;                        // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_Soket_Back;                                // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_Soket_Line;                                // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Synergy_On;                                   // 0x0CC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Synergy_Off;                                  // 0x0CD8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemTooltip_RuneSystem(int32 EntryPoint);
	void OnActiveRuneSynergy(bool InIsActive, EItemGrade InSynergyGrade);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_RuneSystem_C">();
	}
	static class UBP_ItemTooltip_RuneSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_RuneSystem_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_RuneSystem_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_RuneSystem_C");
static_assert(sizeof(UBP_ItemTooltip_RuneSystem_C) == 0x000CF0, "Wrong size on UBP_ItemTooltip_RuneSystem_C");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, UberGraphFrame) == 0x000C88, "Member 'UBP_ItemTooltip_RuneSystem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, BP_ItemTooltip_RuneSystem_Slot) == 0x000C90, "Member 'UBP_ItemTooltip_RuneSystem_C::BP_ItemTooltip_RuneSystem_Slot' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, BP_ItemTooltip_RuneSystem_Slot_1) == 0x000C98, "Member 'UBP_ItemTooltip_RuneSystem_C::BP_ItemTooltip_RuneSystem_Slot_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, BP_ItemTooltip_RuneSystem_Slot_2) == 0x000CA0, "Member 'UBP_ItemTooltip_RuneSystem_C::BP_ItemTooltip_RuneSystem_Slot_2' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, BP_RuneSystem_Synergy_Text) == 0x000CA8, "Member 'UBP_ItemTooltip_RuneSystem_C::BP_RuneSystem_Synergy_Text' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, TLImage_Soket_Back) == 0x000CB0, "Member 'UBP_ItemTooltip_RuneSystem_C::TLImage_Soket_Back' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, TLImage_Soket_Line) == 0x000CB8, "Member 'UBP_ItemTooltip_RuneSystem_C::TLImage_Soket_Line' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, Path_Synergy_On) == 0x000CC0, "Member 'UBP_ItemTooltip_RuneSystem_C::Path_Synergy_On' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_RuneSystem_C, Path_Synergy_Off) == 0x000CD8, "Member 'UBP_ItemTooltip_RuneSystem_C::Path_Synergy_Off' has a wrong offset!");

}

