#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Equip_EnchantTrait_Stat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_Equip_EnchantTrait_Stat.BP_ItemTooltip_Equip_EnchantTrait_Stat_C
// 0x0058 (0x0B40 - 0x0AE8)
class UBP_ItemTooltip_Equip_EnchantTrait_Stat_C final : public UTLUserWidgetTooltipItemTraitStatSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLTextBlock*                           TXT_NAME;                                          // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Stat;                                          // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Unit_01;                                           // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Unit_02;                                           // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Unit_03;                                           // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Unit_04;                                           // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Unit_05;                                           // 0x0B20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Unit_06;                                           // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       UnitGroup;                                         // 0x0B30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Enalbe_Text;                                       // 0x0B38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ItemTooltip_Equip_EnchantTrait_Stat(int32 EntryPoint);
	void OnTraitStatState(bool InIsOpenStat);
	void PreConstruct(bool IsDesignTime);

	class UObject* GetListItemObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_Equip_EnchantTrait_Stat_C">();
	}
	static class UBP_ItemTooltip_Equip_EnchantTrait_Stat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_Equip_EnchantTrait_Stat_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_Equip_EnchantTrait_Stat_C");
static_assert(sizeof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C) == 0x000B40, "Wrong size on UBP_ItemTooltip_Equip_EnchantTrait_Stat_C");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, UberGraphFrame) == 0x000AE8, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, TXT_NAME) == 0x000AF0, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::TXT_NAME' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, TXT_Stat) == 0x000AF8, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::TXT_Stat' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, Unit_01) == 0x000B00, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::Unit_01' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, Unit_02) == 0x000B08, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::Unit_02' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, Unit_03) == 0x000B10, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::Unit_03' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, Unit_04) == 0x000B18, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::Unit_04' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, Unit_05) == 0x000B20, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::Unit_05' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, Unit_06) == 0x000B28, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::Unit_06' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, UnitGroup) == 0x000B30, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::UnitGroup' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Equip_EnchantTrait_Stat_C, Enalbe_Text) == 0x000B38, "Member 'UBP_ItemTooltip_Equip_EnchantTrait_Stat_C::Enalbe_Text' has a wrong offset!");

}

