#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_ItemIconList_Type

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemTooltip_ItemIconList_Type.BP_ItemTooltip_ItemIconList_Type_C.ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type
// 0x0038 (0x0038 - 0x0000)
struct BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0008(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type) == 0x000008, "Wrong alignment on BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type");
static_assert(sizeof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type) == 0x000038, "Wrong size on BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type, EntryPoint) == 0x000000, "Member 'BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type, CallFunc_AddTextBinding_ReturnValue) == 0x000005, "Member 'BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type, K2Node_Event_InText) == 0x000008, "Member 'BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type, CallFunc_SetVisible_self_CastInput) == 0x000028, "Member 'BP_ItemTooltip_ItemIconList_Type_C_ExecuteUbergraph_BP_ItemTooltip_ItemIconList_Type::CallFunc_SetVisible_self_CastInput' has a wrong offset!");

// Function BP_ItemTooltip_ItemIconList_Type.BP_ItemTooltip_ItemIconList_Type_C.OnUpdateDescription
// 0x0018 (0x0018 - 0x0000)
struct BP_ItemTooltip_ItemIconList_Type_C_OnUpdateDescription final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ItemTooltip_ItemIconList_Type_C_OnUpdateDescription) == 0x000008, "Wrong alignment on BP_ItemTooltip_ItemIconList_Type_C_OnUpdateDescription");
static_assert(sizeof(BP_ItemTooltip_ItemIconList_Type_C_OnUpdateDescription) == 0x000018, "Wrong size on BP_ItemTooltip_ItemIconList_Type_C_OnUpdateDescription");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_OnUpdateDescription, InText) == 0x000000, "Member 'BP_ItemTooltip_ItemIconList_Type_C_OnUpdateDescription::InText' has a wrong offset!");

// Function BP_ItemTooltip_ItemIconList_Type.BP_ItemTooltip_ItemIconList_Type_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTooltip_ItemIconList_Type_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTooltip_ItemIconList_Type_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ItemTooltip_ItemIconList_Type_C_PreConstruct");
static_assert(sizeof(BP_ItemTooltip_ItemIconList_Type_C_PreConstruct) == 0x000001, "Wrong size on BP_ItemTooltip_ItemIconList_Type_C_PreConstruct");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ItemTooltip_ItemIconList_Type_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_ItemTooltip_ItemIconList_Type.BP_ItemTooltip_ItemIconList_Type_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemTooltip_ItemIconList_Type_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTooltip_ItemIconList_Type_C_GetListItemObject) == 0x000008, "Wrong alignment on BP_ItemTooltip_ItemIconList_Type_C_GetListItemObject");
static_assert(sizeof(BP_ItemTooltip_ItemIconList_Type_C_GetListItemObject) == 0x000008, "Wrong size on BP_ItemTooltip_ItemIconList_Type_C_GetListItemObject");
static_assert(offsetof(BP_ItemTooltip_ItemIconList_Type_C_GetListItemObject, ReturnValue) == 0x000000, "Member 'BP_ItemTooltip_ItemIconList_Type_C_GetListItemObject::ReturnValue' has a wrong offset!");

}

