#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Info_Icon_Tooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Info_Icon_Tooltip.BP_Info_Icon_Tooltip_C.ExecuteUbergraph_BP_Info_Icon_Tooltip
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip) == 0x000008, "Wrong alignment on BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip");
static_assert(sizeof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip) == 0x0000B8, "Wrong size on BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, EntryPoint) == 0x000000, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_MakeStruct_Margin) == 0x000004, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_Event_IsDesignTime) == 0x000014, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_BreakVector2D_X) == 0x000018, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_BreakVector2D_Y) == 0x00001C, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_MakeStruct_Margin_1) == 0x000028, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000038, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_BreakVector2D_X_1) == 0x000040, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_BreakVector2D_Y_1) == 0x000044, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_MakeStruct_Margin_2) == 0x000048, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_MakeStruct_LinearColor) == 0x000058, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_MakeStruct_LinearColor_1) == 0x000068, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_SwitchInteger_CmpSuccess) == 0x000078, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000080, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000088, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_MakeStruct_Margin_3) == 0x000090, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, K2Node_MakeStruct_Margin_4) == 0x0000A0, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x0000B0, "Member 'BP_Info_Icon_Tooltip_C_ExecuteUbergraph_BP_Info_Icon_Tooltip::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");

// Function BP_Info_Icon_Tooltip.BP_Info_Icon_Tooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Info_Icon_Tooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Info_Icon_Tooltip_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Info_Icon_Tooltip_C_PreConstruct");
static_assert(sizeof(BP_Info_Icon_Tooltip_C_PreConstruct) == 0x000001, "Wrong size on BP_Info_Icon_Tooltip_C_PreConstruct");
static_assert(offsetof(BP_Info_Icon_Tooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Info_Icon_Tooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

