#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InGameModeGameLobbyRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InGameModeGameLobbyRoot.BP_InGameModeGameLobbyRoot_C
// 0x0020 (0x1450 - 0x1430)
class UBP_InGameModeGameLobbyRoot_C final : public UTLUserWidgetInGameModeGameLobbyRoot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ScreenMessage_C*                    BP_ScreenMessage;                                  // 0x1438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         RootCanvasPanel;                                   // 0x1440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InGameModeGameLobbyRoot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InGameModeGameLobbyRoot_C">();
	}
	static class UBP_InGameModeGameLobbyRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InGameModeGameLobbyRoot_C>();
	}
};
static_assert(alignof(UBP_InGameModeGameLobbyRoot_C) == 0x000010, "Wrong alignment on UBP_InGameModeGameLobbyRoot_C");
static_assert(sizeof(UBP_InGameModeGameLobbyRoot_C) == 0x001450, "Wrong size on UBP_InGameModeGameLobbyRoot_C");
static_assert(offsetof(UBP_InGameModeGameLobbyRoot_C, UberGraphFrame) == 0x001430, "Member 'UBP_InGameModeGameLobbyRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InGameModeGameLobbyRoot_C, BP_ScreenMessage) == 0x001438, "Member 'UBP_InGameModeGameLobbyRoot_C::BP_ScreenMessage' has a wrong offset!");
static_assert(offsetof(UBP_InGameModeGameLobbyRoot_C, RootCanvasPanel) == 0x001440, "Member 'UBP_InGameModeGameLobbyRoot_C::RootCanvasPanel' has a wrong offset!");

}

