#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_Consume_Frame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_structs.hpp"
#include "TLClient_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_Consume_Frame.BP_ItemTooltip_Consume_Frame_C
// 0x0160 (0x1008 - 0x0EA8)
class UBP_ItemTooltip_Consume_Frame_C final : public UTLUserWidgetItemTooltipUsableContent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLSizeBox*                             ActionGuideBox;                                    // 0x0EB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Black;                                             // 0x0EB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Cant_ICO_BTN_C*         BP_Cant_Collection;                                // 0x0EC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Cant_ICO_BTN_C*         BP_Cant_Decompose;                                 // 0x0EC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Cant_ICO_BTN_C*         BP_Cant_ExShop;                                    // 0x0ED0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Cant_ICO_BTN_C*         BP_Cant_TrashCan;                                  // 0x0ED8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Cant_ICO_BTN_C*         BP_Cant_Warehouse;                                 // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tem_Icon_BTN_C*                     BP_Chat_Sharing;                                   // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ConsumeStatGroup_C*     BP_ItemTooltip_ConsumeStatGroup;                   // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemToolTip_ContextMenuConsoleFrame_C* BP_ItemToolTip_ContextMenuConsoleFrame;            // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_StatType_1_C*     BP_ItemTooltip_Equip_StatType_1;                   // 0x0F00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_StatType_2_C*     BP_ItemTooltip_Equip_StatType_91;                  // 0x0F08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_StatType_2_C*     BP_ItemTooltip_Equip_StatType_2_C_92;              // 0x0F10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_ItemSlot_Frame_C*                BP_UI_ItemSlot_Frame;                              // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ImageHover_Line;                                   // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           IMG_IMAGES;                                        // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemSlot_Frame;                                    // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              KeyGuide_ContextMenu;                              // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             PanelMinSize;                                      // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_MoveArea;                          // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLScrollBox*                           TLScrollBox_Stat;                                  // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_0;                                     // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_1;                                     // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_4;                                     // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_Level;                                 // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         TopInfo_VBox;                                      // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_ActionGuide;                                   // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_ActionGuide_1;                                 // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_ActionGuide_2;                                 // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_ActionGuide_6;                                 // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_ActionGuide_7;                                 // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETLItemCollectableState                       CollectableState;                                  // 0x0FA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA9[0x7];                                      // 0x0FA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           SubStatPanelWidget;                                // 0x0FB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Skill_Get;                                     // 0x0FB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0FC0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSoftObjectPath                        Lucky_Bind;                                        // 0x0FD8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Normal_Bind;                                       // 0x0FF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemTooltip_Consume_Frame(int32 EntryPoint);
	void OnUpdateFocusMoveAreaGuide(const bool bShow);
	void PreConstruct(bool IsDesignTime);
	void OnChangeScrollContentAutonFocus(const bool bFocus);
	void OnUpdateTotalMenu(bool bInEnable, bool bInShow);
	void OnUpdateTradableIcon(bool bIsTradable, bool bIsOverwriteExchangeable);
	void OnUnLockMemorial(bool IsUnLock);
	void OnCollectionClick();
	void OnUpdateCollectable(ETLItemCollectableState InCollectableState, int32 InConditionLevel);
	void OnUpdateDecomposable(bool bIsDecomposable);
	void OnUpdateDestructible(bool bIsDestructible);
	void OnUpdateTradePriceInfo(bool InShowTradePrice, const class FText& RecentPriceText, const class FText& SaleCountText);
	void OnUpdateStorable(bool bIsStorable);
	void OnUpdateRequireLevel(int32 InRequireLevel, int32 InPcLevel);
	void OnPosetUpdateContent();
	void OnUpdateCategoryName(const class FText& InName);
	void OnItemLockUpdate(const bool InLock);
	void OnUpdateGradeColor(const class FText& InGradeName, class FName InColorTableKey);
	void OnUpdateItemName(const class FText& InName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_Consume_Frame_C">();
	}
	static class UBP_ItemTooltip_Consume_Frame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_Consume_Frame_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_Consume_Frame_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_Consume_Frame_C");
static_assert(sizeof(UBP_ItemTooltip_Consume_Frame_C) == 0x001008, "Wrong size on UBP_ItemTooltip_Consume_Frame_C");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, UberGraphFrame) == 0x000EA8, "Member 'UBP_ItemTooltip_Consume_Frame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, ActionGuideBox) == 0x000EB0, "Member 'UBP_ItemTooltip_Consume_Frame_C::ActionGuideBox' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, Black) == 0x000EB8, "Member 'UBP_ItemTooltip_Consume_Frame_C::Black' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_Cant_Collection) == 0x000EC0, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_Cant_Collection' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_Cant_Decompose) == 0x000EC8, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_Cant_Decompose' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_Cant_ExShop) == 0x000ED0, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_Cant_ExShop' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_Cant_TrashCan) == 0x000ED8, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_Cant_TrashCan' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_Cant_Warehouse) == 0x000EE0, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_Cant_Warehouse' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_Chat_Sharing) == 0x000EE8, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_Chat_Sharing' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_ItemTooltip_ConsumeStatGroup) == 0x000EF0, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_ItemTooltip_ConsumeStatGroup' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_ItemToolTip_ContextMenuConsoleFrame) == 0x000EF8, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_ItemToolTip_ContextMenuConsoleFrame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_ItemTooltip_Equip_StatType_1) == 0x000F00, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_ItemTooltip_Equip_StatType_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_ItemTooltip_Equip_StatType_91) == 0x000F08, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_ItemTooltip_Equip_StatType_91' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_ItemTooltip_Equip_StatType_2_C_92) == 0x000F10, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_ItemTooltip_Equip_StatType_2_C_92' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, BP_UI_ItemSlot_Frame) == 0x000F18, "Member 'UBP_ItemTooltip_Consume_Frame_C::BP_UI_ItemSlot_Frame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, ImageHover_Line) == 0x000F20, "Member 'UBP_ItemTooltip_Consume_Frame_C::ImageHover_Line' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, IMG_IMAGES) == 0x000F28, "Member 'UBP_ItemTooltip_Consume_Frame_C::IMG_IMAGES' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, ItemSlot_Frame) == 0x000F30, "Member 'UBP_ItemTooltip_Consume_Frame_C::ItemSlot_Frame' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, KeyGuide_ContextMenu) == 0x000F38, "Member 'UBP_ItemTooltip_Consume_Frame_C::KeyGuide_ContextMenu' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, PanelMinSize) == 0x000F40, "Member 'UBP_ItemTooltip_Consume_Frame_C::PanelMinSize' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TLHorizontalBox_MoveArea) == 0x000F48, "Member 'UBP_ItemTooltip_Consume_Frame_C::TLHorizontalBox_MoveArea' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TLScrollBox_Stat) == 0x000F50, "Member 'UBP_ItemTooltip_Consume_Frame_C::TLScrollBox_Stat' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TLTextBlock_0) == 0x000F58, "Member 'UBP_ItemTooltip_Consume_Frame_C::TLTextBlock_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TLTextBlock_1) == 0x000F60, "Member 'UBP_ItemTooltip_Consume_Frame_C::TLTextBlock_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TLTextBlock_4) == 0x000F68, "Member 'UBP_ItemTooltip_Consume_Frame_C::TLTextBlock_4' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TLTextBlock_Level) == 0x000F70, "Member 'UBP_ItemTooltip_Consume_Frame_C::TLTextBlock_Level' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TopInfo_VBox) == 0x000F78, "Member 'UBP_ItemTooltip_Consume_Frame_C::TopInfo_VBox' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TXT_ActionGuide) == 0x000F80, "Member 'UBP_ItemTooltip_Consume_Frame_C::TXT_ActionGuide' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TXT_ActionGuide_1) == 0x000F88, "Member 'UBP_ItemTooltip_Consume_Frame_C::TXT_ActionGuide_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TXT_ActionGuide_2) == 0x000F90, "Member 'UBP_ItemTooltip_Consume_Frame_C::TXT_ActionGuide_2' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TXT_ActionGuide_6) == 0x000F98, "Member 'UBP_ItemTooltip_Consume_Frame_C::TXT_ActionGuide_6' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TXT_ActionGuide_7) == 0x000FA0, "Member 'UBP_ItemTooltip_Consume_Frame_C::TXT_ActionGuide_7' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, CollectableState) == 0x000FA8, "Member 'UBP_ItemTooltip_Consume_Frame_C::CollectableState' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, SubStatPanelWidget) == 0x000FB0, "Member 'UBP_ItemTooltip_Consume_Frame_C::SubStatPanelWidget' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, TXT_Skill_Get) == 0x000FB8, "Member 'UBP_ItemTooltip_Consume_Frame_C::TXT_Skill_Get' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, Description) == 0x000FC0, "Member 'UBP_ItemTooltip_Consume_Frame_C::Description' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, Lucky_Bind) == 0x000FD8, "Member 'UBP_ItemTooltip_Consume_Frame_C::Lucky_Bind' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_Consume_Frame_C, Normal_Bind) == 0x000FF0, "Member 'UBP_ItemTooltip_Consume_Frame_C::Normal_Bind' has a wrong offset!");

}

