#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTooltip_EquipStatGroup

#include "Basic.hpp"

#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ItemTooltip_EquipStatGroup.BP_ItemTooltip_EquipStatGroup_C
// 0x0110 (0x0BA0 - 0x0A90)
class UBP_ItemTooltip_EquipStatGroup_C final : public UTLUserWidgetTooltipScrollContent
{
public:
	class UTLVerticalBox*                         BottomPanel_Vbox;                                  // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Box_CostumeSystem;                                 // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_ItemIconList_Type_C*    BP_ItemTooltip_Equip_SetEquip;                     // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_StatType_3_C*     BP_ItemTooltip_Equip_StatType_136;                 // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_SetEnchant_C*     BP_ItemTooltip_ItemTrait;                          // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_LatestDeal_State_C*     BP_ItemTooltip_LatestDeal_State;                   // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_LatestVolume_State_C*   BP_ItemTooltip_LatestVolume_State;                 // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_RuneSystem_C*           BP_ItemTooltip_RuneSystem;                         // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLGridPanel*                           Grid_StatGroup;                                    // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ItemTooltip_Equip_StatType_2_V_C*   MaterialInfo_V;                                    // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       RequireLevel_HorizontalBox;                        // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RequireLevelNumber_TextBlock;                      // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Set_Equipment;                                     // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Skill_SpecializationGuide;                         // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               StatGroup_List_Normal;                             // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLDynamicEntryBox*                     TLDynamicEntryBox_95;                              // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLDynamicEntryBox*                     TLDynamicEntryBox_Costume;                         // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_0;                                 // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_63;                                        // 0x0B20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_11;                                    // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_12;                                    // 0x0B30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_DeScription;                                   // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Description_SpecializationGuide;               // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Description_SpecializationGuide_1;             // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Description_SpecializationGuide_2;             // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Description_SpecializationGuide_3;             // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Description_SpecializationGuide_4;             // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_ItemLifeTime;                                  // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_SetEffectTitle;                                // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_SetEffectTitle_1;                              // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         VBox_CompareStat;                                  // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         VBox_LevelStat;                                    // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         VBox_OptionStat;                                   // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Vbox_PassiveSkill;                                 // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemTooltip_EquipStatGroup_C">();
	}
	static class UBP_ItemTooltip_EquipStatGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemTooltip_EquipStatGroup_C>();
	}
};
static_assert(alignof(UBP_ItemTooltip_EquipStatGroup_C) == 0x000008, "Wrong alignment on UBP_ItemTooltip_EquipStatGroup_C");
static_assert(sizeof(UBP_ItemTooltip_EquipStatGroup_C) == 0x000BA0, "Wrong size on UBP_ItemTooltip_EquipStatGroup_C");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, BottomPanel_Vbox) == 0x000A90, "Member 'UBP_ItemTooltip_EquipStatGroup_C::BottomPanel_Vbox' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, Box_CostumeSystem) == 0x000A98, "Member 'UBP_ItemTooltip_EquipStatGroup_C::Box_CostumeSystem' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, BP_ItemTooltip_Equip_SetEquip) == 0x000AA0, "Member 'UBP_ItemTooltip_EquipStatGroup_C::BP_ItemTooltip_Equip_SetEquip' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, BP_ItemTooltip_Equip_StatType_136) == 0x000AA8, "Member 'UBP_ItemTooltip_EquipStatGroup_C::BP_ItemTooltip_Equip_StatType_136' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, BP_ItemTooltip_ItemTrait) == 0x000AB0, "Member 'UBP_ItemTooltip_EquipStatGroup_C::BP_ItemTooltip_ItemTrait' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, BP_ItemTooltip_LatestDeal_State) == 0x000AB8, "Member 'UBP_ItemTooltip_EquipStatGroup_C::BP_ItemTooltip_LatestDeal_State' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, BP_ItemTooltip_LatestVolume_State) == 0x000AC0, "Member 'UBP_ItemTooltip_EquipStatGroup_C::BP_ItemTooltip_LatestVolume_State' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, BP_ItemTooltip_RuneSystem) == 0x000AC8, "Member 'UBP_ItemTooltip_EquipStatGroup_C::BP_ItemTooltip_RuneSystem' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, Grid_StatGroup) == 0x000AD0, "Member 'UBP_ItemTooltip_EquipStatGroup_C::Grid_StatGroup' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, MaterialInfo_V) == 0x000AD8, "Member 'UBP_ItemTooltip_EquipStatGroup_C::MaterialInfo_V' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, RequireLevel_HorizontalBox) == 0x000AE0, "Member 'UBP_ItemTooltip_EquipStatGroup_C::RequireLevel_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, RequireLevelNumber_TextBlock) == 0x000AE8, "Member 'UBP_ItemTooltip_EquipStatGroup_C::RequireLevelNumber_TextBlock' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, Set_Equipment) == 0x000AF0, "Member 'UBP_ItemTooltip_EquipStatGroup_C::Set_Equipment' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, Skill_SpecializationGuide) == 0x000AF8, "Member 'UBP_ItemTooltip_EquipStatGroup_C::Skill_SpecializationGuide' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, StatGroup_List_Normal) == 0x000B00, "Member 'UBP_ItemTooltip_EquipStatGroup_C::StatGroup_List_Normal' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TLDynamicEntryBox_95) == 0x000B08, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TLDynamicEntryBox_95' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TLDynamicEntryBox_Costume) == 0x000B10, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TLDynamicEntryBox_Costume' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TLHorizontalBox_0) == 0x000B18, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TLHorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TLImage_63) == 0x000B20, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TLImage_63' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TLTextBlock_11) == 0x000B28, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TLTextBlock_11' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TLTextBlock_12) == 0x000B30, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TLTextBlock_12' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_DeScription) == 0x000B38, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_DeScription' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_Description_SpecializationGuide) == 0x000B40, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_Description_SpecializationGuide' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_Description_SpecializationGuide_1) == 0x000B48, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_Description_SpecializationGuide_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_Description_SpecializationGuide_2) == 0x000B50, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_Description_SpecializationGuide_2' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_Description_SpecializationGuide_3) == 0x000B58, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_Description_SpecializationGuide_3' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_Description_SpecializationGuide_4) == 0x000B60, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_Description_SpecializationGuide_4' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_ItemLifeTime) == 0x000B68, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_ItemLifeTime' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_SetEffectTitle) == 0x000B70, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_SetEffectTitle' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, TXT_SetEffectTitle_1) == 0x000B78, "Member 'UBP_ItemTooltip_EquipStatGroup_C::TXT_SetEffectTitle_1' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, VBox_CompareStat) == 0x000B80, "Member 'UBP_ItemTooltip_EquipStatGroup_C::VBox_CompareStat' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, VBox_LevelStat) == 0x000B88, "Member 'UBP_ItemTooltip_EquipStatGroup_C::VBox_LevelStat' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, VBox_OptionStat) == 0x000B90, "Member 'UBP_ItemTooltip_EquipStatGroup_C::VBox_OptionStat' has a wrong offset!");
static_assert(offsetof(UBP_ItemTooltip_EquipStatGroup_C, Vbox_PassiveSkill) == 0x000B98, "Member 'UBP_ItemTooltip_EquipStatGroup_C::Vbox_PassiveSkill' has a wrong offset!");

}

