#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lobby_TitleTop_Tab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Lobby_TitleTop_Tab.BP_Lobby_TitleTop_Tab_C
// 0x0020 (0x1480 - 0x1460)
class UBP_Lobby_TitleTop_Tab_C final : public UTLUserWidgetSystemButtons
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Tem_KeyGuide_BTN_C*                 BP_Tem_KeyGuide_BTN;                               // 0x1468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_0;                                       // 0x1470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Lobby_TitleTop_Tab(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lobby_TitleTop_Tab_C">();
	}
	static class UBP_Lobby_TitleTop_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Lobby_TitleTop_Tab_C>();
	}
};
static_assert(alignof(UBP_Lobby_TitleTop_Tab_C) == 0x000010, "Wrong alignment on UBP_Lobby_TitleTop_Tab_C");
static_assert(sizeof(UBP_Lobby_TitleTop_Tab_C) == 0x001480, "Wrong size on UBP_Lobby_TitleTop_Tab_C");
static_assert(offsetof(UBP_Lobby_TitleTop_Tab_C, UberGraphFrame) == 0x001460, "Member 'UBP_Lobby_TitleTop_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Lobby_TitleTop_Tab_C, BP_Tem_KeyGuide_BTN) == 0x001468, "Member 'UBP_Lobby_TitleTop_Tab_C::BP_Tem_KeyGuide_BTN' has a wrong offset!");
static_assert(offsetof(UBP_Lobby_TitleTop_Tab_C, TLSizeBox_0) == 0x001470, "Member 'UBP_Lobby_TitleTop_Tab_C::TLSizeBox_0' has a wrong offset!");

}

