#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lobby_Loading_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Lobby_Loading_Widget.BP_Lobby_Loading_Widget_C.ExecuteUbergraph_BP_Lobby_Loading_Widget
// 0x0020 (0x0020 - 0x0000)
struct BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget) == 0x000008, "Wrong alignment on BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget");
static_assert(sizeof(BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget) == 0x000020, "Wrong size on BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget");
static_assert(offsetof(BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget, EntryPoint) == 0x000000, "Member 'BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'BP_Lobby_Loading_Widget_C_ExecuteUbergraph_BP_Lobby_Loading_Widget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_Lobby_Loading_Widget.BP_Lobby_Loading_Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Lobby_Loading_Widget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lobby_Loading_Widget_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Lobby_Loading_Widget_C_PreConstruct");
static_assert(sizeof(BP_Lobby_Loading_Widget_C_PreConstruct) == 0x000001, "Wrong size on BP_Lobby_Loading_Widget_C_PreConstruct");
static_assert(offsetof(BP_Lobby_Loading_Widget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Lobby_Loading_Widget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

