#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lobby_Loading_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Lobby_Loading_Widget.BP_Lobby_Loading_Widget_C
// 0x0020 (0x1460 - 0x1440)
class UBP_Lobby_Loading_Widget_C final : public UTLUserWidgetLoadingIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x1448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x1450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Lobby_Loading_Widget(int32 EntryPoint);
	void OnLoadingDeactivation();
	void OnLoadingActivation();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lobby_Loading_Widget_C">();
	}
	static class UBP_Lobby_Loading_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Lobby_Loading_Widget_C>();
	}
};
static_assert(alignof(UBP_Lobby_Loading_Widget_C) == 0x000010, "Wrong alignment on UBP_Lobby_Loading_Widget_C");
static_assert(sizeof(UBP_Lobby_Loading_Widget_C) == 0x001460, "Wrong size on UBP_Lobby_Loading_Widget_C");
static_assert(offsetof(UBP_Lobby_Loading_Widget_C, UberGraphFrame) == 0x001440, "Member 'UBP_Lobby_Loading_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Lobby_Loading_Widget_C, HideAnim) == 0x001448, "Member 'UBP_Lobby_Loading_Widget_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UBP_Lobby_Loading_Widget_C, ShowAnim) == 0x001450, "Member 'UBP_Lobby_Loading_Widget_C::ShowAnim' has a wrong offset!");

}

