#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lobby_ShaderCompile_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Lobby_ShaderCompile_Widget.BP_Lobby_ShaderCompile_Widget_C.ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget
// 0x0048 (0x0048 - 0x0000)
struct BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsSelected)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsSelected;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget) == 0x000008, "Wrong alignment on BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget");
static_assert(sizeof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget) == 0x000048, "Wrong size on BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, EntryPoint) == 0x000000, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, CallFunc_IsChecked_ReturnValue) == 0x000004, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, K2Node_Event_IsDesignTime) == 0x000019, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, K2Node_CustomEvent_bIsSelected) == 0x00001A, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::K2Node_CustomEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, CallFunc_SetVisible_self_CastInput) == 0x000020, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000030, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget, CallFunc_SetVisible_self_CastInput_1) == 0x000038, "Member 'BP_Lobby_ShaderCompile_Widget_C_ExecuteUbergraph_BP_Lobby_ShaderCompile_Widget::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");

// Function BP_Lobby_ShaderCompile_Widget.BP_Lobby_ShaderCompile_Widget_C.OnChecked
// 0x0001 (0x0001 - 0x0000)
struct BP_Lobby_ShaderCompile_Widget_C_OnChecked final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lobby_ShaderCompile_Widget_C_OnChecked) == 0x000001, "Wrong alignment on BP_Lobby_ShaderCompile_Widget_C_OnChecked");
static_assert(sizeof(BP_Lobby_ShaderCompile_Widget_C_OnChecked) == 0x000001, "Wrong size on BP_Lobby_ShaderCompile_Widget_C_OnChecked");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_OnChecked, bIsSelected) == 0x000000, "Member 'BP_Lobby_ShaderCompile_Widget_C_OnChecked::bIsSelected' has a wrong offset!");

// Function BP_Lobby_ShaderCompile_Widget.BP_Lobby_ShaderCompile_Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Lobby_ShaderCompile_Widget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lobby_ShaderCompile_Widget_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Lobby_ShaderCompile_Widget_C_PreConstruct");
static_assert(sizeof(BP_Lobby_ShaderCompile_Widget_C_PreConstruct) == 0x000001, "Wrong size on BP_Lobby_ShaderCompile_Widget_C_PreConstruct");
static_assert(offsetof(BP_Lobby_ShaderCompile_Widget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Lobby_ShaderCompile_Widget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

