#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MsgBox_Item_Slot

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_MsgBox_Item_Slot.BP_MsgBox_Item_Slot_C.ExecuteUbergraph_BP_MsgBox_Item_Slot
// 0x0030 (0x0030 - 0x0000)
struct BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemGrade                                    K2Node_Event_InGrade;                              // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot) == 0x000008, "Wrong alignment on BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot");
static_assert(sizeof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot) == 0x000030, "Wrong size on BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot, EntryPoint) == 0x000000, "Member 'BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot, K2Node_Event_InGrade) == 0x000018, "Member 'BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot::K2Node_Event_InGrade' has a wrong offset!");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot, CallFunc_SetVisible_self_CastInput_1) == 0x000020, "Member 'BP_MsgBox_Item_Slot_C_ExecuteUbergraph_BP_MsgBox_Item_Slot::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");

// Function BP_MsgBox_Item_Slot.BP_MsgBox_Item_Slot_C.OnItemGradeUpdate
// 0x0001 (0x0001 - 0x0000)
struct BP_MsgBox_Item_Slot_C_OnItemGradeUpdate final
{
public:
	EItemGrade                                    InGrade;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MsgBox_Item_Slot_C_OnItemGradeUpdate) == 0x000001, "Wrong alignment on BP_MsgBox_Item_Slot_C_OnItemGradeUpdate");
static_assert(sizeof(BP_MsgBox_Item_Slot_C_OnItemGradeUpdate) == 0x000001, "Wrong size on BP_MsgBox_Item_Slot_C_OnItemGradeUpdate");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_OnItemGradeUpdate, InGrade) == 0x000000, "Member 'BP_MsgBox_Item_Slot_C_OnItemGradeUpdate::InGrade' has a wrong offset!");

// Function BP_MsgBox_Item_Slot.BP_MsgBox_Item_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_MsgBox_Item_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MsgBox_Item_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on BP_MsgBox_Item_Slot_C_PreConstruct");
static_assert(sizeof(BP_MsgBox_Item_Slot_C_PreConstruct) == 0x000001, "Wrong size on BP_MsgBox_Item_Slot_C_PreConstruct");
static_assert(offsetof(BP_MsgBox_Item_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_MsgBox_Item_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

