#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MsgBox_Base_Frame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MsgBox_Base_Frame.BP_MsgBox_Base_Frame_C
// 0x0090 (0x0B10 - 0x0A80)
class UBP_MsgBox_Base_Frame_C final : public UTLUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_UI_BTN_TextBox_C*                   BP_BTN_Cancle;                                     // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_BTN_TextBox_C*                   BP_BTN_No;                                         // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_BTN_TextBox_C*                   BP_BTN_YES;                                        // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tem_KeyGuideGroup_C*                BP_Tem_KeyGuideGroup;                              // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_Popup_Msg_BackGround_C*          BP_UI_Popup_Msg_BackGround;                        // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               MinSize;                                           // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_POPUPTITLE_LINE_Sprite;                        // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_POPUPTITLE_PATTERN;                            // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           Titile;                                            // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_155;                                       // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           TLNamedSlot_0;                                     // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_Top;                                      // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         TLVerticalBox_0;                                   // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         TLVerticalBox_1;                                   // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          TitleOn;                                           // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF9[0x3];                                      // 0x0AF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                In_Offset;                                         // 0x0AFC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MsgBox_Base_Frame(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MsgBox_Base_Frame_C">();
	}
	static class UBP_MsgBox_Base_Frame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MsgBox_Base_Frame_C>();
	}
};
static_assert(alignof(UBP_MsgBox_Base_Frame_C) == 0x000008, "Wrong alignment on UBP_MsgBox_Base_Frame_C");
static_assert(sizeof(UBP_MsgBox_Base_Frame_C) == 0x000B10, "Wrong size on UBP_MsgBox_Base_Frame_C");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, UberGraphFrame) == 0x000A80, "Member 'UBP_MsgBox_Base_Frame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, BP_BTN_Cancle) == 0x000A88, "Member 'UBP_MsgBox_Base_Frame_C::BP_BTN_Cancle' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, BP_BTN_No) == 0x000A90, "Member 'UBP_MsgBox_Base_Frame_C::BP_BTN_No' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, BP_BTN_YES) == 0x000A98, "Member 'UBP_MsgBox_Base_Frame_C::BP_BTN_YES' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, BP_Tem_KeyGuideGroup) == 0x000AA0, "Member 'UBP_MsgBox_Base_Frame_C::BP_Tem_KeyGuideGroup' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, BP_UI_Popup_Msg_BackGround) == 0x000AA8, "Member 'UBP_MsgBox_Base_Frame_C::BP_UI_Popup_Msg_BackGround' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, MinSize) == 0x000AB0, "Member 'UBP_MsgBox_Base_Frame_C::MinSize' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TEX_POPUPTITLE_LINE_Sprite) == 0x000AB8, "Member 'UBP_MsgBox_Base_Frame_C::TEX_POPUPTITLE_LINE_Sprite' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TEX_POPUPTITLE_PATTERN) == 0x000AC0, "Member 'UBP_MsgBox_Base_Frame_C::TEX_POPUPTITLE_PATTERN' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, Titile) == 0x000AC8, "Member 'UBP_MsgBox_Base_Frame_C::Titile' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TLImage_155) == 0x000AD0, "Member 'UBP_MsgBox_Base_Frame_C::TLImage_155' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TLNamedSlot_0) == 0x000AD8, "Member 'UBP_MsgBox_Base_Frame_C::TLNamedSlot_0' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TLSpacer_Top) == 0x000AE0, "Member 'UBP_MsgBox_Base_Frame_C::TLSpacer_Top' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TLVerticalBox_0) == 0x000AE8, "Member 'UBP_MsgBox_Base_Frame_C::TLVerticalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TLVerticalBox_1) == 0x000AF0, "Member 'UBP_MsgBox_Base_Frame_C::TLVerticalBox_1' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, TitleOn) == 0x000AF8, "Member 'UBP_MsgBox_Base_Frame_C::TitleOn' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Base_Frame_C, In_Offset) == 0x000AFC, "Member 'UBP_MsgBox_Base_Frame_C::In_Offset' has a wrong offset!");

}

