#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagicDoll_Detail_Growth_Skill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MagicDoll_Detail_Growth_Skill.BP_MagicDoll_Detail_Growth_Skill_C
// 0x0068 (0x0EC0 - 0x0E58)
class UBP_MagicDoll_Detail_Growth_Skill_C final : public UTLUserWidgetSimpleSkillSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Polymorph_Detail_Skill_Icon_C*      BP_Polymorph_Detail_Skill_Icon;                    // 0x0E60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Description_TXT;                                   // 0x0E68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Magicdoll_Properties;                              // 0x0E70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Name_TXT;                                          // 0x0E78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_HUd_Heal_potion;                               // 0x0E80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_HUd_Heal_potion_1;                             // 0x0E88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_66;                                // 0x0E90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_DollProperties;                    // 0x0E98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Cooltime_Name;                                 // 0x0EA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Cooltime_Value;                                // 0x0EA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Item_Value;                                    // 0x0EB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Item_Value_1;                                  // 0x0EB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MagicDoll_Detail_Growth_Skill(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MagicDoll_Detail_Growth_Skill_C">();
	}
	static class UBP_MagicDoll_Detail_Growth_Skill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MagicDoll_Detail_Growth_Skill_C>();
	}
};
static_assert(alignof(UBP_MagicDoll_Detail_Growth_Skill_C) == 0x000008, "Wrong alignment on UBP_MagicDoll_Detail_Growth_Skill_C");
static_assert(sizeof(UBP_MagicDoll_Detail_Growth_Skill_C) == 0x000EC0, "Wrong size on UBP_MagicDoll_Detail_Growth_Skill_C");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, UberGraphFrame) == 0x000E58, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, BP_Polymorph_Detail_Skill_Icon) == 0x000E60, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::BP_Polymorph_Detail_Skill_Icon' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, Description_TXT) == 0x000E68, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::Description_TXT' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, Magicdoll_Properties) == 0x000E70, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::Magicdoll_Properties' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, Name_TXT) == 0x000E78, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::Name_TXT' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, Tex_HUd_Heal_potion) == 0x000E80, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::Tex_HUd_Heal_potion' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, Tex_HUd_Heal_potion_1) == 0x000E88, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::Tex_HUd_Heal_potion_1' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, TLHorizontalBox_66) == 0x000E90, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::TLHorizontalBox_66' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, TLHorizontalBox_DollProperties) == 0x000E98, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::TLHorizontalBox_DollProperties' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, TXT_Cooltime_Name) == 0x000EA0, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::TXT_Cooltime_Name' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, TXT_Cooltime_Value) == 0x000EA8, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::TXT_Cooltime_Value' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, TXT_Item_Value) == 0x000EB0, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::TXT_Item_Value' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Growth_Skill_C, TXT_Item_Value_1) == 0x000EB8, "Member 'UBP_MagicDoll_Detail_Growth_Skill_C::TXT_Item_Value_1' has a wrong offset!");

}

