#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MyPCComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_PolymorphTrails_structs.hpp"
#include "Struct_PolymorphTrailData_structs.hpp"
#include "Engine_structs.hpp"
#include "TLScene_structs.hpp"


namespace SDK::Params
{

// Function BP_MyPCComponent.BP_MyPCComponent_C.ExecuteUbergraph_BP_MyPCComponent
// 0x01D0 (0x01D0 - 0x0000)
struct BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_Event_SkeletalMeshComponent;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x004C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FlowGenBall_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FlowGenBall_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeXYSquared_ReturnValue;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_TrailsManager_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0140(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TrailsManager_C*                    CallFunc_Array_Get_Item_1;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TLGetFluidSimFootprintAutoGeneration_ReturnValue; // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TLGetUseFlowingSandBall_ReturnValue;      // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMovementMode                                 K2Node_Event_CurrentMovementMode;                  // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_CurrentCustomMode;                    // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_Event_PreviousMovementMode;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_PreviousCustomMode;                   // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17F[0x1];                                      // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0188(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_3;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue_1;            // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent) == 0x000010, "Wrong alignment on BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent");
static_assert(sizeof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent) == 0x0001D0, "Wrong size on BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, EntryPoint) == 0x000000, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, K2Node_Event_SkeletalMeshComponent) == 0x000028, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::K2Node_Event_SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, K2Node_Event_location) == 0x00004C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BreakVector_X) == 0x000060, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BreakVector_Y) == 0x000064, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BreakVector_Z) == 0x000068, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_GetActorForwardVector_ReturnValue) == 0x00006C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_MakeVector_ReturnValue_1) == 0x000088, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_MakeTransform_ReturnValue_1) == 0x0000D0, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000108, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000110, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000118, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_GetOwner_ReturnValue_2) == 0x000120, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000128, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_GetVelocity_ReturnValue) == 0x00012C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_VSizeXYSquared_ReturnValue) == 0x000138, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_VSizeXYSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00013C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_GetAllActorsOfClass_OutActors) == 0x000140, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, Temp_int_Loop_Counter_Variable_1) == 0x000150, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000160, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Length_ReturnValue_1) == 0x000164, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, Temp_int_Loop_Counter_Variable_2) == 0x000168, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Greater_IntInt_ReturnValue) == 0x00016C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00016D, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Add_IntInt_ReturnValue_2) == 0x000170, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_TLGetFluidSimFootprintAutoGeneration_ReturnValue) == 0x000174, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_TLGetFluidSimFootprintAutoGeneration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_TLGetUseFlowingSandBall_ReturnValue) == 0x000175, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_TLGetUseFlowingSandBall_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, K2Node_Event_CurrentMovementMode) == 0x000176, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::K2Node_Event_CurrentMovementMode' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, K2Node_Event_CurrentCustomMode) == 0x000177, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::K2Node_Event_CurrentCustomMode' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, K2Node_Event_PreviousMovementMode) == 0x000178, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::K2Node_Event_PreviousMovementMode' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, K2Node_Event_PreviousCustomMode) == 0x000179, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::K2Node_Event_PreviousCustomMode' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BooleanAND_ReturnValue) == 0x00017A, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00017B, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BooleanAND_ReturnValue_1) == 0x00017C, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00017D, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_BooleanOR_ReturnValue) == 0x00017E, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_GetOwner_ReturnValue_3) == 0x000180, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000188, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Length_ReturnValue_2) == 0x000198, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Get_Item_2) == 0x0001A0, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001A8, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Add_ReturnValue) == 0x0001AC, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_ComponentHasTag_ReturnValue) == 0x0001B0, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Get_Item_3) == 0x0001B8, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Not_PreBool_ReturnValue) == 0x0001C0, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_ComponentHasTag_ReturnValue_1) == 0x0001C1, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_ComponentHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_Length_ReturnValue_3) == 0x0001C4, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001C8, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001C9, "Member 'BP_MyPCComponent_C_ExecuteUbergraph_BP_MyPCComponent::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function BP_MyPCComponent.BP_MyPCComponent_C.OnMovementModeChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_MyPCComponent_C_OnMovementModeChanged final
{
public:
	EMovementMode                                 CurrentMovementMode;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CurrentCustomMode;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 PreviousMovementMode;                              // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PreviousCustomMode;                                // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MyPCComponent_C_OnMovementModeChanged) == 0x000001, "Wrong alignment on BP_MyPCComponent_C_OnMovementModeChanged");
static_assert(sizeof(BP_MyPCComponent_C_OnMovementModeChanged) == 0x000004, "Wrong size on BP_MyPCComponent_C_OnMovementModeChanged");
static_assert(offsetof(BP_MyPCComponent_C_OnMovementModeChanged, CurrentMovementMode) == 0x000000, "Member 'BP_MyPCComponent_C_OnMovementModeChanged::CurrentMovementMode' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_OnMovementModeChanged, CurrentCustomMode) == 0x000001, "Member 'BP_MyPCComponent_C_OnMovementModeChanged::CurrentCustomMode' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_OnMovementModeChanged, PreviousMovementMode) == 0x000002, "Member 'BP_MyPCComponent_C_OnMovementModeChanged::PreviousMovementMode' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_OnMovementModeChanged, PreviousCustomMode) == 0x000003, "Member 'BP_MyPCComponent_C_OnMovementModeChanged::PreviousCustomMode' has a wrong offset!");

// Function BP_MyPCComponent.BP_MyPCComponent_C.OnFootprint
// 0x000C (0x000C - 0x0000)
struct BP_MyPCComponent_C_OnFootprint final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MyPCComponent_C_OnFootprint) == 0x000004, "Wrong alignment on BP_MyPCComponent_C_OnFootprint");
static_assert(sizeof(BP_MyPCComponent_C_OnFootprint) == 0x00000C, "Wrong size on BP_MyPCComponent_C_OnFootprint");
static_assert(offsetof(BP_MyPCComponent_C_OnFootprint, Location) == 0x000000, "Member 'BP_MyPCComponent_C_OnFootprint::Location' has a wrong offset!");

// Function BP_MyPCComponent.BP_MyPCComponent_C.OnModelLoaded
// 0x0008 (0x0008 - 0x0000)
struct BP_MyPCComponent_C_OnModelLoaded final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MyPCComponent_C_OnModelLoaded) == 0x000008, "Wrong alignment on BP_MyPCComponent_C_OnModelLoaded");
static_assert(sizeof(BP_MyPCComponent_C_OnModelLoaded) == 0x000008, "Wrong size on BP_MyPCComponent_C_OnModelLoaded");
static_assert(offsetof(BP_MyPCComponent_C_OnModelLoaded, SkeletalMeshComponent) == 0x000000, "Member 'BP_MyPCComponent_C_OnModelLoaded::SkeletalMeshComponent' has a wrong offset!");

// Function BP_MyPCComponent.BP_MyPCComponent_C.Try Spawn Flowing Sand
// 0x0130 (0x0130 - 0x0000)
struct BP_MyPCComponent_C_Try_Spawn_Flowing_Sand final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FlowingSandDynamic_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESnPhysicalSurface                            CallFunc_TLGetPhysicalSurfaceFinalWeather_OutSurface; // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TLGetPhysicalSurfaceFinalWeather_OutTextureBlendingWeight; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand) == 0x000010, "Wrong alignment on BP_MyPCComponent_C_Try_Spawn_Flowing_Sand");
static_assert(sizeof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand) == 0x000130, "Wrong size on BP_MyPCComponent_C_Try_Spawn_Flowing_Sand");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, Location) == 0x000000, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::Location' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, Temp_object_Variable) == 0x000010, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000090, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000118, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_TLGetPhysicalSurfaceFinalWeather_OutSurface) == 0x000119, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_TLGetPhysicalSurfaceFinalWeather_OutSurface' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_TLGetPhysicalSurfaceFinalWeather_OutTextureBlendingWeight) == 0x00011C, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_TLGetPhysicalSurfaceFinalWeather_OutTextureBlendingWeight' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Try_Spawn_Flowing_Sand, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000120, "Member 'BP_MyPCComponent_C_Try_Spawn_Flowing_Sand::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_MyPCComponent.BP_MyPCComponent_C.Is Valid Skeleton
// 0x0048 (0x0048 - 0x0000)
struct BP_MyPCComponent_C_Is_Valid_Skeleton final
{
public:
	class USkinnedMeshComponent*                  SkinnedMeshComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bValid;                                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBoneIndex_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MyPCComponent_C_Is_Valid_Skeleton) == 0x000008, "Wrong alignment on BP_MyPCComponent_C_Is_Valid_Skeleton");
static_assert(sizeof(BP_MyPCComponent_C_Is_Valid_Skeleton) == 0x000048, "Wrong size on BP_MyPCComponent_C_Is_Valid_Skeleton");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, SkinnedMeshComponent) == 0x000000, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::SkinnedMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, Valid) == 0x000008, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::Valid' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, bValid) == 0x000009, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::bValid' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, Temp_bool_True_if_break_was_hit_Variable) == 0x00000A, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_Conv_StringToName_ReturnValue) == 0x000034, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_DoesSocketExist_ReturnValue) == 0x00003D, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_BooleanAND_ReturnValue) == 0x00003E, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003F, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_GetBoneIndex_ReturnValue) == 0x000040, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_GetBoneIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MyPCComponent_C_Is_Valid_Skeleton, CallFunc_BooleanAND_ReturnValue_1) == 0x000045, "Member 'BP_MyPCComponent_C_Is_Valid_Skeleton::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_MyPCComponent.BP_MyPCComponent_C.RebuildTrailComponents
// 0x0280 (0x0280 - 0x0000)
struct BP_MyPCComponent_C_RebuildTrailComponents final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         SkeletonNameSplitted;                              // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FStruct_PolymorphTrails                PlymorphTrails;                                    // 0x0018(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ValidSkeletalMeshComponent;                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USkeleton*                        CallFunc_GetSkeleton_ReturnValue;                  // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0070(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_PolymorphTrails                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0088(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_TrailComponent_C*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_PolymorphTrails                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0108(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TrailComponent_C*                   CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_PolymorphTrailData             CallFunc_Array_Get_Item_1;                         // 0x0174(0x0038)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_PolymorphTrailData             CallFunc_Array_Get_Item_2;                         // 0x01FC(0x0038)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_1;        // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MyPCComponent_C_RebuildTrailComponents) == 0x000010, "Wrong alignment on BP_MyPCComponent_C_RebuildTrailComponents");
static_assert(sizeof(BP_MyPCComponent_C_RebuildTrailComponents) == 0x000280, "Wrong size on BP_MyPCComponent_C_RebuildTrailComponents");
static_assert(offsetof(BP_MyPCComponent_C_RebuildTrailComponents, SkeletalMeshComponent) == 0x000000, "Member 'BP_MyPCComponent_C_RebuildTrailComponents::SkeletalMeshComponent' has a wrong offset!");
