#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagicDoll_Detail_Stat

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MagicDoll_Detail_Stat.BP_MagicDoll_Detail_Stat_C.ExecuteUbergraph_BP_MagicDoll_Detail_Stat
// 0x002C (0x002C - 0x0000)
struct BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_2;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue_1;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue;            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat) == 0x000004, "Wrong alignment on BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat");
static_assert(sizeof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat) == 0x00002C, "Wrong size on BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, EntryPoint) == 0x000000, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, CallFunc_AddTextBinding_ReturnValue) == 0x000024, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, CallFunc_AddTextBinding_ReturnValue_1) == 0x000025, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, K2Node_Event_IsDesignTime) == 0x000026, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, CallFunc_BooleanOR_ReturnValue) == 0x000027, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x000028, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, CallFunc_AddTextBinding_ReturnValue_2) == 0x000029, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::CallFunc_AddTextBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, CallFunc_SetOnUpdateDefault_ReturnValue_1) == 0x00002A, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::CallFunc_SetOnUpdateDefault_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat, CallFunc_AddVisibleBinding_ReturnValue) == 0x00002B, "Member 'BP_MagicDoll_Detail_Stat_C_ExecuteUbergraph_BP_MagicDoll_Detail_Stat::CallFunc_AddVisibleBinding_ReturnValue' has a wrong offset!");

// Function BP_MagicDoll_Detail_Stat.BP_MagicDoll_Detail_Stat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_MagicDoll_Detail_Stat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MagicDoll_Detail_Stat_C_PreConstruct) == 0x000001, "Wrong alignment on BP_MagicDoll_Detail_Stat_C_PreConstruct");
static_assert(sizeof(BP_MagicDoll_Detail_Stat_C_PreConstruct) == 0x000001, "Wrong size on BP_MagicDoll_Detail_Stat_C_PreConstruct");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_MagicDoll_Detail_Stat_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_MagicDoll_Detail_Stat.BP_MagicDoll_Detail_Stat_C.SetBold
// 0x0001 (0x0001 - 0x0000)
struct BP_MagicDoll_Detail_Stat_C_SetBold final
{
public:
	bool                                          Bold_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MagicDoll_Detail_Stat_C_SetBold) == 0x000001, "Wrong alignment on BP_MagicDoll_Detail_Stat_C_SetBold");
static_assert(sizeof(BP_MagicDoll_Detail_Stat_C_SetBold) == 0x000001, "Wrong size on BP_MagicDoll_Detail_Stat_C_SetBold");
static_assert(offsetof(BP_MagicDoll_Detail_Stat_C_SetBold, Bold_0) == 0x000000, "Member 'BP_MagicDoll_Detail_Stat_C_SetBold::Bold_0' has a wrong offset!");

}

