#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MsgBox_Text_Frame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MsgBox_Text_Frame.BP_MsgBox_Text_Frame_C
// 0x01A0 (0x17C0 - 0x1620)
class UBP_MsgBox_Text_Frame_C final : public UTLUserWidgetMsgBoxText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x1628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x1630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_Contract_Confirm_Title_C*           BP_Contract_Confirm_Title;                         // 0x1638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Info_Icon_Tooltip_C*                BP_Info_Icon_Tooltip;                              // 0x1640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MsgBox_Base_Frame_C*                BP_MsgBox_Base_Frame;                              // 0x1648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PCPortrait_C*                       BP_PCPortrait;                                     // 0x1650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tem_KeyIcon_BTN_C*                  BP_Tem_KeyIcon_BTN;                                // 0x1658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_BTN_CheckBox_C*                  BP_UI_BTN_CheckBox;                                // 0x1660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CenterText01;                                      // 0x1668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CenterText02;                                      // 0x1670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CenterText03;                                      // 0x1678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CenterText04;                                      // 0x1680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       CheckboxGroup;                                     // 0x1688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Count01;                                           // 0x1690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Count02;                                           // 0x1698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               CountIcon01;                                       // 0x16A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               CountIcon02;                                       // 0x16A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       CountText01Group;                                  // 0x16B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       CountText02Group;                                  // 0x16B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CountTitle01;                                      // 0x16C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CountTitle02;                                      // 0x16C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Dimmed;                                            // 0x16D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Guild_Withdrawal;                                  // 0x16D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemIcon;                                          // 0x16E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemIconBg;                                        // 0x16E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           ItemName;                                          // 0x16F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MsgBox_Item_Slot_C*                 ItemSlot;                                          // 0x16F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           LeftText01;                                        // 0x1700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           LeftText02;                                        // 0x1708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           LeftText03;                                        // 0x1710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           LeftText04;                                        // 0x1718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           LowerText;                                         // 0x1720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       LowerTextGroup;                                    // 0x1728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           LowerTitleText;                                    // 0x1730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           MainText;                                          // 0x1738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         MultiLineTextGroup;                                // 0x1740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               NoticeIcon;                                        // 0x1748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           NoticeTextBlock;                                   // 0x1750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLGridPanel*                           NoticeTextGroup;                                   // 0x1758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           REWARD_LIMITED;                                    // 0x1760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           REWARD_LIMITED_CONTRACT;                           // 0x1768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           REWARD_LIMITED_RAID;                               // 0x1770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RightText01;                                       // 0x1778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RightText02;                                       // 0x1780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RightText03;                                       // 0x1788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RightText04;                                       // 0x1790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           SubText;                                           // 0x1798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         TLCanvasPanel_0;                                   // 0x17A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_160;                                       // 0x17A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_5;                                       // 0x17B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MsgBox_Text_Frame(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MsgBox_Text_Frame_C">();
	}
	static class UBP_MsgBox_Text_Frame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MsgBox_Text_Frame_C>();
	}
};
static_assert(alignof(UBP_MsgBox_Text_Frame_C) == 0x000010, "Wrong alignment on UBP_MsgBox_Text_Frame_C");
static_assert(sizeof(UBP_MsgBox_Text_Frame_C) == 0x0017C0, "Wrong size on UBP_MsgBox_Text_Frame_C");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, UberGraphFrame) == 0x001620, "Member 'UBP_MsgBox_Text_Frame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, HideAnim) == 0x001628, "Member 'UBP_MsgBox_Text_Frame_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, ShowAnim) == 0x001630, "Member 'UBP_MsgBox_Text_Frame_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, BP_Contract_Confirm_Title) == 0x001638, "Member 'UBP_MsgBox_Text_Frame_C::BP_Contract_Confirm_Title' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, BP_Info_Icon_Tooltip) == 0x001640, "Member 'UBP_MsgBox_Text_Frame_C::BP_Info_Icon_Tooltip' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, BP_MsgBox_Base_Frame) == 0x001648, "Member 'UBP_MsgBox_Text_Frame_C::BP_MsgBox_Base_Frame' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, BP_PCPortrait) == 0x001650, "Member 'UBP_MsgBox_Text_Frame_C::BP_PCPortrait' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, BP_Tem_KeyIcon_BTN) == 0x001658, "Member 'UBP_MsgBox_Text_Frame_C::BP_Tem_KeyIcon_BTN' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, BP_UI_BTN_CheckBox) == 0x001660, "Member 'UBP_MsgBox_Text_Frame_C::BP_UI_BTN_CheckBox' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CenterText01) == 0x001668, "Member 'UBP_MsgBox_Text_Frame_C::CenterText01' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CenterText02) == 0x001670, "Member 'UBP_MsgBox_Text_Frame_C::CenterText02' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CenterText03) == 0x001678, "Member 'UBP_MsgBox_Text_Frame_C::CenterText03' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CenterText04) == 0x001680, "Member 'UBP_MsgBox_Text_Frame_C::CenterText04' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CheckboxGroup) == 0x001688, "Member 'UBP_MsgBox_Text_Frame_C::CheckboxGroup' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, Count01) == 0x001690, "Member 'UBP_MsgBox_Text_Frame_C::Count01' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, Count02) == 0x001698, "Member 'UBP_MsgBox_Text_Frame_C::Count02' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CountIcon01) == 0x0016A0, "Member 'UBP_MsgBox_Text_Frame_C::CountIcon01' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CountIcon02) == 0x0016A8, "Member 'UBP_MsgBox_Text_Frame_C::CountIcon02' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CountText01Group) == 0x0016B0, "Member 'UBP_MsgBox_Text_Frame_C::CountText01Group' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CountText02Group) == 0x0016B8, "Member 'UBP_MsgBox_Text_Frame_C::CountText02Group' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CountTitle01) == 0x0016C0, "Member 'UBP_MsgBox_Text_Frame_C::CountTitle01' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, CountTitle02) == 0x0016C8, "Member 'UBP_MsgBox_Text_Frame_C::CountTitle02' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, Dimmed) == 0x0016D0, "Member 'UBP_MsgBox_Text_Frame_C::Dimmed' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, Guild_Withdrawal) == 0x0016D8, "Member 'UBP_MsgBox_Text_Frame_C::Guild_Withdrawal' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, ItemIcon) == 0x0016E0, "Member 'UBP_MsgBox_Text_Frame_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, ItemIconBg) == 0x0016E8, "Member 'UBP_MsgBox_Text_Frame_C::ItemIconBg' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, ItemName) == 0x0016F0, "Member 'UBP_MsgBox_Text_Frame_C::ItemName' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, ItemSlot) == 0x0016F8, "Member 'UBP_MsgBox_Text_Frame_C::ItemSlot' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, LeftText01) == 0x001700, "Member 'UBP_MsgBox_Text_Frame_C::LeftText01' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, LeftText02) == 0x001708, "Member 'UBP_MsgBox_Text_Frame_C::LeftText02' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, LeftText03) == 0x001710, "Member 'UBP_MsgBox_Text_Frame_C::LeftText03' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, LeftText04) == 0x001718, "Member 'UBP_MsgBox_Text_Frame_C::LeftText04' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, LowerText) == 0x001720, "Member 'UBP_MsgBox_Text_Frame_C::LowerText' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, LowerTextGroup) == 0x001728, "Member 'UBP_MsgBox_Text_Frame_C::LowerTextGroup' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, LowerTitleText) == 0x001730, "Member 'UBP_MsgBox_Text_Frame_C::LowerTitleText' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, MainText) == 0x001738, "Member 'UBP_MsgBox_Text_Frame_C::MainText' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, MultiLineTextGroup) == 0x001740, "Member 'UBP_MsgBox_Text_Frame_C::MultiLineTextGroup' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, NoticeIcon) == 0x001748, "Member 'UBP_MsgBox_Text_Frame_C::NoticeIcon' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, NoticeTextBlock) == 0x001750, "Member 'UBP_MsgBox_Text_Frame_C::NoticeTextBlock' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, NoticeTextGroup) == 0x001758, "Member 'UBP_MsgBox_Text_Frame_C::NoticeTextGroup' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, REWARD_LIMITED) == 0x001760, "Member 'UBP_MsgBox_Text_Frame_C::REWARD_LIMITED' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, REWARD_LIMITED_CONTRACT) == 0x001768, "Member 'UBP_MsgBox_Text_Frame_C::REWARD_LIMITED_CONTRACT' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, REWARD_LIMITED_RAID) == 0x001770, "Member 'UBP_MsgBox_Text_Frame_C::REWARD_LIMITED_RAID' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, RightText01) == 0x001778, "Member 'UBP_MsgBox_Text_Frame_C::RightText01' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, RightText02) == 0x001780, "Member 'UBP_MsgBox_Text_Frame_C::RightText02' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, RightText03) == 0x001788, "Member 'UBP_MsgBox_Text_Frame_C::RightText03' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, RightText04) == 0x001790, "Member 'UBP_MsgBox_Text_Frame_C::RightText04' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, SubText) == 0x001798, "Member 'UBP_MsgBox_Text_Frame_C::SubText' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, TLCanvasPanel_0) == 0x0017A0, "Member 'UBP_MsgBox_Text_Frame_C::TLCanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, TLImage_160) == 0x0017A8, "Member 'UBP_MsgBox_Text_Frame_C::TLImage_160' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Text_Frame_C, TLSizeBox_5) == 0x0017B0, "Member 'UBP_MsgBox_Text_Frame_C::TLSizeBox_5' has a wrong offset!");

}

