#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagicDoll_Nomal

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MagicDoll_Nomal.BP_MagicDoll_Nomal_C
// 0x0048 (0x0278 - 0x0230)
class ABP_MagicDoll_Nomal_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Floor_Reflection;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_Flowmap_White;                                // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_Purple;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_Flowmap_Line;                                 // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Doom_sphere_MagicDoll;                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Fog_Smoke_Lit_6004;                                // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MagicDoll_Nomal_C">();
	}
	static class ABP_MagicDoll_Nomal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MagicDoll_Nomal_C>();
	}
};
static_assert(alignof(ABP_MagicDoll_Nomal_C) == 0x000008, "Wrong alignment on ABP_MagicDoll_Nomal_C");
static_assert(sizeof(ABP_MagicDoll_Nomal_C) == 0x000278, "Wrong size on ABP_MagicDoll_Nomal_C");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, Floor_Reflection) == 0x000230, "Member 'ABP_MagicDoll_Nomal_C::Floor_Reflection' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, ParticleSystem) == 0x000238, "Member 'ABP_MagicDoll_Nomal_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, Wall_Flowmap_White) == 0x000240, "Member 'ABP_MagicDoll_Nomal_C::Wall_Flowmap_White' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, Wall_Purple) == 0x000248, "Member 'ABP_MagicDoll_Nomal_C::Wall_Purple' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, Wall_Flowmap_Line) == 0x000250, "Member 'ABP_MagicDoll_Nomal_C::Wall_Flowmap_Line' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, Doom_sphere_MagicDoll) == 0x000258, "Member 'ABP_MagicDoll_Nomal_C::Doom_sphere_MagicDoll' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, Fog_Smoke_Lit_6004) == 0x000260, "Member 'ABP_MagicDoll_Nomal_C::Fog_Smoke_Lit_6004' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, SkeletalMesh) == 0x000268, "Member 'ABP_MagicDoll_Nomal_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_MagicDoll_Nomal_C, DefaultSceneRoot) == 0x000270, "Member 'ABP_MagicDoll_Nomal_C::DefaultSceneRoot' has a wrong offset!");

}

