#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MsgBox_Item_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MsgBox_Item_Slot.BP_MsgBox_Item_Slot_C
// 0x0090 (0x1318 - 0x1288)
class UBP_MsgBox_Item_Slot_C final : public UTLUserWidgetItemSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focus;                                             // 0x1290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLTextBlock*                           CountText;                                         // 0x12A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Deco_L;                                            // 0x12A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Deco_R;                                            // 0x12B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Equip_Icon;                                        // 0x12B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Hover_Glow_IMG;                                    // 0x12C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemGradeImage;                                    // 0x12C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemIconImage;                                     // 0x12D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             LevelPoint;                                        // 0x12D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              TLGradeBorder;                                     // 0x12E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLGradeLine;                                       // 0x12E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_35;                                        // 0x12F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_88;                                       // 0x12F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           UpgradeText;                                       // 0x1300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DecoON;                                            // 0x1308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1309[0x3];                                     // 0x1309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              In_Size;                                           // 0x130C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MsgBox_Item_Slot(int32 EntryPoint);
	void OnItemGradeUpdate(const EItemGrade InGrade);
	void OnItemEquipUpdate();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MsgBox_Item_Slot_C">();
	}
	static class UBP_MsgBox_Item_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MsgBox_Item_Slot_C>();
	}
};
static_assert(alignof(UBP_MsgBox_Item_Slot_C) == 0x000008, "Wrong alignment on UBP_MsgBox_Item_Slot_C");
static_assert(sizeof(UBP_MsgBox_Item_Slot_C) == 0x001318, "Wrong size on UBP_MsgBox_Item_Slot_C");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, UberGraphFrame) == 0x001288, "Member 'UBP_MsgBox_Item_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, Focus) == 0x001290, "Member 'UBP_MsgBox_Item_Slot_C::Focus' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, Hover) == 0x001298, "Member 'UBP_MsgBox_Item_Slot_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, CountText) == 0x0012A0, "Member 'UBP_MsgBox_Item_Slot_C::CountText' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, Deco_L) == 0x0012A8, "Member 'UBP_MsgBox_Item_Slot_C::Deco_L' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, Deco_R) == 0x0012B0, "Member 'UBP_MsgBox_Item_Slot_C::Deco_R' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, Equip_Icon) == 0x0012B8, "Member 'UBP_MsgBox_Item_Slot_C::Equip_Icon' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, Hover_Glow_IMG) == 0x0012C0, "Member 'UBP_MsgBox_Item_Slot_C::Hover_Glow_IMG' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, ItemGradeImage) == 0x0012C8, "Member 'UBP_MsgBox_Item_Slot_C::ItemGradeImage' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, ItemIconImage) == 0x0012D0, "Member 'UBP_MsgBox_Item_Slot_C::ItemIconImage' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, LevelPoint) == 0x0012D8, "Member 'UBP_MsgBox_Item_Slot_C::LevelPoint' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, TLGradeBorder) == 0x0012E0, "Member 'UBP_MsgBox_Item_Slot_C::TLGradeBorder' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, TLGradeLine) == 0x0012E8, "Member 'UBP_MsgBox_Item_Slot_C::TLGradeLine' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, TLImage_35) == 0x0012F0, "Member 'UBP_MsgBox_Item_Slot_C::TLImage_35' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, TLSpacer_88) == 0x0012F8, "Member 'UBP_MsgBox_Item_Slot_C::TLSpacer_88' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, UpgradeText) == 0x001300, "Member 'UBP_MsgBox_Item_Slot_C::UpgradeText' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, DecoON) == 0x001308, "Member 'UBP_MsgBox_Item_Slot_C::DecoON' has a wrong offset!");
static_assert(offsetof(UBP_MsgBox_Item_Slot_C, In_Size) == 0x00130C, "Member 'UBP_MsgBox_Item_Slot_C::In_Size' has a wrong offset!");

}

