#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagicDoll_Detail_Description

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MagicDoll_Detail_Description.BP_MagicDoll_Detail_Description_C
// 0x00A8 (0x0B80 - 0x0AD8)
class UBP_MagicDoll_Detail_Description_C final : public UTLUserWidgetMagicDollDetailDescription
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MyLevel;                                           // 0x0AE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_MagicDoll_Detail_Growth_Skill_C*    BP_MagicDoll_Detail_Growth_Skill;                  // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MagicDoll_Detail_Stat_C*            BP_MagicDoll_Detail_Stat;                          // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MagicDoll_Detail_Stat_C*            BP_MagicDoll_Detail_Stat_1;                        // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MagicDoll_Detail_Stat_C*            BP_MagicDoll_Detail_Stat_2;                        // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MagicDoll_Detail_Stat_C*            BP_MagicDoll_Detail_Stat_3;                        // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         MainStat;                                          // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Skilleffect;                                       // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         TLCanvasPanel_0;                                   // 0x0B20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         TLVerticalBox_BasicEffect;                         // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, struct FSoftObjectPath>           LevelBorderImageMap;                               // 0x0B30(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_MagicDoll_Detail_Description(int32 EntryPoint);
	void Construct();
	void NewFunction_0(const class FText& NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MagicDoll_Detail_Description_C">();
	}
	static class UBP_MagicDoll_Detail_Description_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MagicDoll_Detail_Description_C>();
	}
};
static_assert(alignof(UBP_MagicDoll_Detail_Description_C) == 0x000008, "Wrong alignment on UBP_MagicDoll_Detail_Description_C");
static_assert(sizeof(UBP_MagicDoll_Detail_Description_C) == 0x000B80, "Wrong size on UBP_MagicDoll_Detail_Description_C");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, UberGraphFrame) == 0x000AD8, "Member 'UBP_MagicDoll_Detail_Description_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, MyLevel) == 0x000AE0, "Member 'UBP_MagicDoll_Detail_Description_C::MyLevel' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, BP_MagicDoll_Detail_Growth_Skill) == 0x000AE8, "Member 'UBP_MagicDoll_Detail_Description_C::BP_MagicDoll_Detail_Growth_Skill' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, BP_MagicDoll_Detail_Stat) == 0x000AF0, "Member 'UBP_MagicDoll_Detail_Description_C::BP_MagicDoll_Detail_Stat' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, BP_MagicDoll_Detail_Stat_1) == 0x000AF8, "Member 'UBP_MagicDoll_Detail_Description_C::BP_MagicDoll_Detail_Stat_1' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, BP_MagicDoll_Detail_Stat_2) == 0x000B00, "Member 'UBP_MagicDoll_Detail_Description_C::BP_MagicDoll_Detail_Stat_2' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, BP_MagicDoll_Detail_Stat_3) == 0x000B08, "Member 'UBP_MagicDoll_Detail_Description_C::BP_MagicDoll_Detail_Stat_3' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, MainStat) == 0x000B10, "Member 'UBP_MagicDoll_Detail_Description_C::MainStat' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, Skilleffect) == 0x000B18, "Member 'UBP_MagicDoll_Detail_Description_C::Skilleffect' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, TLCanvasPanel_0) == 0x000B20, "Member 'UBP_MagicDoll_Detail_Description_C::TLCanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, TLVerticalBox_BasicEffect) == 0x000B28, "Member 'UBP_MagicDoll_Detail_Description_C::TLVerticalBox_BasicEffect' has a wrong offset!");
static_assert(offsetof(UBP_MagicDoll_Detail_Description_C, LevelBorderImageMap) == 0x000B30, "Member 'UBP_MagicDoll_Detail_Description_C::LevelBorderImageMap' has a wrong offset!");

}

