#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Minimap_ContentsItem_Tooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Minimap_ContentsItem_Tooltip.BP_Minimap_ContentsItem_Tooltip_C.ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip
// 0x0018 (0x0018 - 0x0000)
struct BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip) == 0x000004, "Wrong alignment on BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip");
static_assert(sizeof(BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip) == 0x000018, "Wrong size on BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip");
static_assert(offsetof(BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip, EntryPoint) == 0x000000, "Member 'BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x000014, "Member 'BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'BP_Minimap_ContentsItem_Tooltip_C_ExecuteUbergraph_BP_Minimap_ContentsItem_Tooltip::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

