#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_MagicDoll_tooltip

#include "Basic.hpp"

#include "TLClient_structs.hpp"


namespace SDK::Params
{

// Function Bp_MagicDoll_tooltip.Bp_MagicDoll_tooltip_C.ExecuteUbergraph_Bp_MagicDoll_tooltip
// 0x000C (0x000C - 0x0000)
struct Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMagicDollGuideType                           K2Node_Event_InGuideType;                          // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageBrushBinding_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_2;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_1;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_3;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip) == 0x000004, "Wrong alignment on Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip");
static_assert(sizeof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip) == 0x00000C, "Wrong size on Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, EntryPoint) == 0x000000, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, CallFunc_AddTextBinding_ReturnValue) == 0x000004, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, CallFunc_AddTextBinding_ReturnValue_1) == 0x000005, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, K2Node_Event_InGuideType) == 0x000006, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::K2Node_Event_InGuideType' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, CallFunc_AddVisibleBinding_ReturnValue) == 0x000007, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::CallFunc_AddVisibleBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, CallFunc_AddImageBrushBinding_ReturnValue) == 0x000008, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::CallFunc_AddImageBrushBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, CallFunc_AddTextBinding_ReturnValue_2) == 0x000009, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::CallFunc_AddTextBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, CallFunc_AddVisibleBinding_ReturnValue_1) == 0x00000A, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::CallFunc_AddVisibleBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip, CallFunc_AddTextBinding_ReturnValue_3) == 0x00000B, "Member 'Bp_MagicDoll_tooltip_C_ExecuteUbergraph_Bp_MagicDoll_tooltip::CallFunc_AddTextBinding_ReturnValue_3' has a wrong offset!");

// Function Bp_MagicDoll_tooltip.Bp_MagicDoll_tooltip_C.SetGuideTextTextBlockStyle
// 0x0001 (0x0001 - 0x0000)
struct Bp_MagicDoll_tooltip_C_SetGuideTextTextBlockStyle final
{
public:
	EMagicDollGuideType                           InGuideType;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_MagicDoll_tooltip_C_SetGuideTextTextBlockStyle) == 0x000001, "Wrong alignment on Bp_MagicDoll_tooltip_C_SetGuideTextTextBlockStyle");
static_assert(sizeof(Bp_MagicDoll_tooltip_C_SetGuideTextTextBlockStyle) == 0x000001, "Wrong size on Bp_MagicDoll_tooltip_C_SetGuideTextTextBlockStyle");
static_assert(offsetof(Bp_MagicDoll_tooltip_C_SetGuideTextTextBlockStyle, InGuideType) == 0x000000, "Member 'Bp_MagicDoll_tooltip_C_SetGuideTextTextBlockStyle::InGuideType' has a wrong offset!");

}

