#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NamePlate_CostGauge_Optimization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_NamePlate_CostGauge_Optimization.BP_NamePlate_CostGauge_Optimization_C
// 0x0038 (0x0AC0 - 0x0A88)
class UBP_NamePlate_CostGauge_Optimization_C final : public UTLUserWidgetNamePlateProgressBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               BG_Dark;                                           // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLProgressBar*                         GaugePoint;                                        // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IMG_HPLight_inc;                                   // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_GaugeSize;                                // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Zero_PCMinus1_NPC;                                 // 0x0AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SET_Size;                                          // 0x0AB4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NamePlate_CostGauge_Optimization(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NamePlate_CostGauge_Optimization_C">();
	}
	static class UBP_NamePlate_CostGauge_Optimization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NamePlate_CostGauge_Optimization_C>();
	}
};
static_assert(alignof(UBP_NamePlate_CostGauge_Optimization_C) == 0x000008, "Wrong alignment on UBP_NamePlate_CostGauge_Optimization_C");
static_assert(sizeof(UBP_NamePlate_CostGauge_Optimization_C) == 0x000AC0, "Wrong size on UBP_NamePlate_CostGauge_Optimization_C");
static_assert(offsetof(UBP_NamePlate_CostGauge_Optimization_C, UberGraphFrame) == 0x000A88, "Member 'UBP_NamePlate_CostGauge_Optimization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_CostGauge_Optimization_C, BG_Dark) == 0x000A90, "Member 'UBP_NamePlate_CostGauge_Optimization_C::BG_Dark' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_CostGauge_Optimization_C, GaugePoint) == 0x000A98, "Member 'UBP_NamePlate_CostGauge_Optimization_C::GaugePoint' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_CostGauge_Optimization_C, IMG_HPLight_inc) == 0x000AA0, "Member 'UBP_NamePlate_CostGauge_Optimization_C::IMG_HPLight_inc' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_CostGauge_Optimization_C, TLSpacer_GaugeSize) == 0x000AA8, "Member 'UBP_NamePlate_CostGauge_Optimization_C::TLSpacer_GaugeSize' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_CostGauge_Optimization_C, Zero_PCMinus1_NPC) == 0x000AB0, "Member 'UBP_NamePlate_CostGauge_Optimization_C::Zero_PCMinus1_NPC' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_CostGauge_Optimization_C, SET_Size) == 0x000AB4, "Member 'UBP_NamePlate_CostGauge_Optimization_C::SET_Size' has a wrong offset!");

}

