#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NamePlate_UsupringCrown_Optimization

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NamePlate_UsupringCrown_Optimization.BP_NamePlate_UsupringCrown_Optimization_C.ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization
// 0x0048 (0x0048 - 0x0000)
struct BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InbHasPerfect;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization) == 0x000008, "Wrong alignment on BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization");
static_assert(sizeof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization) == 0x000048, "Wrong size on BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization, EntryPoint) == 0x000000, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization, K2Node_Event_InbHasPerfect) == 0x000004, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization::K2Node_Event_InbHasPerfect' has a wrong offset!");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization, CallFunc_SetVisible_self_CastInput) == 0x000018, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization, CallFunc_SetVisible_self_CastInput_1) == 0x000028, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization, CallFunc_SetVisible_self_CastInput_2) == 0x000038, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_ExecuteUbergraph_BP_NamePlate_UsupringCrown_Optimization::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");

// Function BP_NamePlate_UsupringCrown_Optimization.BP_NamePlate_UsupringCrown_Optimization_C.OnUpdateUsurperBuff
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlate_UsupringCrown_Optimization_C_OnUpdateUsurperBuff final
{
public:
	bool                                          InbHasPerfect;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlate_UsupringCrown_Optimization_C_OnUpdateUsurperBuff) == 0x000001, "Wrong alignment on BP_NamePlate_UsupringCrown_Optimization_C_OnUpdateUsurperBuff");
static_assert(sizeof(BP_NamePlate_UsupringCrown_Optimization_C_OnUpdateUsurperBuff) == 0x000001, "Wrong size on BP_NamePlate_UsupringCrown_Optimization_C_OnUpdateUsurperBuff");
static_assert(offsetof(BP_NamePlate_UsupringCrown_Optimization_C_OnUpdateUsurperBuff, InbHasPerfect) == 0x000000, "Member 'BP_NamePlate_UsupringCrown_Optimization_C_OnUpdateUsurperBuff::InbHasPerfect' has a wrong offset!");

}

