#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Nameplate_DropFo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Nameplate_DropFo.BP_Nameplate_DropFo_C
// 0x00C0 (0x10C0 - 0x1000)
class UBP_Nameplate_DropFo_C final : public UTLUserWidgetNamePlate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1000(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       End_Anim_2;                                        // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SHOW_ANIM_2;                                       // 0x1010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SHOW_ANIM;                                         // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BTNDisable_Reverse;                                // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BTNDisable;                                        // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BTNUnhover;                                        // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BTNHover;                                          // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               Contents_Icon_FX;                                  // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Name_Pattern;                                      // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               NameBG_Base;                                       // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextItmeName;                                    // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        OwnerText_Path;                                    // 0x1060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        LostOwnerText_Path;                                // 0x1078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        OwnerNameBase_Path;                                // 0x1090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        LostOwnerNameBase_Path;                            // 0x10A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Nameplate_DropFo(int32 EntryPoint);
	void Construct();
	void OnOwnershipGained();
	void OnOwnershipLost();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Nameplate_DropFo_C">();
	}
	static class UBP_Nameplate_DropFo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Nameplate_DropFo_C>();
	}
};
static_assert(alignof(UBP_Nameplate_DropFo_C) == 0x000008, "Wrong alignment on UBP_Nameplate_DropFo_C");
static_assert(sizeof(UBP_Nameplate_DropFo_C) == 0x0010C0, "Wrong size on UBP_Nameplate_DropFo_C");
static_assert(offsetof(UBP_Nameplate_DropFo_C, UberGraphFrame) == 0x001000, "Member 'UBP_Nameplate_DropFo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, End_Anim_2) == 0x001008, "Member 'UBP_Nameplate_DropFo_C::End_Anim_2' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, SHOW_ANIM_2) == 0x001010, "Member 'UBP_Nameplate_DropFo_C::SHOW_ANIM_2' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, SHOW_ANIM) == 0x001018, "Member 'UBP_Nameplate_DropFo_C::SHOW_ANIM' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, BTNDisable_Reverse) == 0x001020, "Member 'UBP_Nameplate_DropFo_C::BTNDisable_Reverse' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, BTNDisable) == 0x001028, "Member 'UBP_Nameplate_DropFo_C::BTNDisable' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, BTNUnhover) == 0x001030, "Member 'UBP_Nameplate_DropFo_C::BTNUnhover' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, BTNHover) == 0x001038, "Member 'UBP_Nameplate_DropFo_C::BTNHover' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, Contents_Icon_FX) == 0x001040, "Member 'UBP_Nameplate_DropFo_C::Contents_Icon_FX' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, Name_Pattern) == 0x001048, "Member 'UBP_Nameplate_DropFo_C::Name_Pattern' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, NameBG_Base) == 0x001050, "Member 'UBP_Nameplate_DropFo_C::NameBG_Base' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, TLTextItmeName) == 0x001058, "Member 'UBP_Nameplate_DropFo_C::TLTextItmeName' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, OwnerText_Path) == 0x001060, "Member 'UBP_Nameplate_DropFo_C::OwnerText_Path' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, LostOwnerText_Path) == 0x001078, "Member 'UBP_Nameplate_DropFo_C::LostOwnerText_Path' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, OwnerNameBase_Path) == 0x001090, "Member 'UBP_Nameplate_DropFo_C::OwnerNameBase_Path' has a wrong offset!");
static_assert(offsetof(UBP_Nameplate_DropFo_C, LostOwnerNameBase_Path) == 0x0010A8, "Member 'UBP_Nameplate_DropFo_C::LostOwnerNameBase_Path' has a wrong offset!");

}

