#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NamePlateFrame_PcSimple_Optimization2C

#include "Basic.hpp"

#include "TLClient_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLScheme_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C
// 0x01E8 (0x01E8 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InTarget;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsAlive;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Event_InRenderTransformOffset;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLStealthDectectionState                     K2Node_Event_State;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0034(0x001C)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_4;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageColorAndOpacityBinding_ReturnValue; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInMassCombatMode;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageBrushBinding_ReturnValue;         // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLNameplateSimpleLayout                      K2Node_Event_InLayout;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_5;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_6;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_7;              // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_8;              // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_9;              // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_10;             // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_11;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_12;             // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_13;             // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetBrushByName_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_1;             // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_2;             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x013C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector4_X;                           // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Y;                           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Z;                           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_W;                           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_14;             // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_15;             // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_16;             // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_17;             // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHpBarType                                    K2Node_Event_InHpBarType;                          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C) == 0x000008, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C) == 0x0001E8, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, EntryPoint) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_InTarget) == 0x000004, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_InTarget' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_bIsAlive) == 0x000005, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_bIsAlive' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_1) == 0x000018, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_InRenderTransformOffset) == 0x000028, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_InRenderTransformOffset' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_State) == 0x000030, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_MakeStruct_WidgetTransform) == 0x000034, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_2) == 0x000058, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_3) == 0x000068, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_4) == 0x000078, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_AddImageColorAndOpacityBinding_ReturnValue) == 0x000088, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_AddImageColorAndOpacityBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_bInMassCombatMode) == 0x000089, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_bInMassCombatMode' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_AddImageBrushBinding_ReturnValue) == 0x00008A, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_AddImageBrushBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000090, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_InLayout) == 0x000098, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_InLayout' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_SwitchEnum_CmpSuccess_1) == 0x000099, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_5) == 0x0000A0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_6) == 0x0000B0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_7) == 0x0000C0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_7' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_8) == 0x0000D0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_8' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_9) == 0x0000E0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_9' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_10) == 0x0000F0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_10' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_11) == 0x000100, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_11' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_12) == 0x000110, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_12' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_13) == 0x000120, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_13' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SlotAsGridSlot_ReturnValue_1) == 0x000130, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SlotAsGridSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetBrushByName_ReturnValue) == 0x000138, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetBrushByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetBrushByName_ReturnValue_1) == 0x000139, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetBrushByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetBrushByName_ReturnValue_2) == 0x00013A, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetBrushByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_CreateDelegate_OutputDelegate) == 0x00013C, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector4_X) == 0x00014C, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector4_X' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector4_Y) == 0x000150, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector4_Y' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector4_Z) == 0x000154, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector4_Z' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector4_W) == 0x000158, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector4_W' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x00015C, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_MakeVector2D_ReturnValue) == 0x000160, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_MakeVector2D_ReturnValue_1) == 0x000168, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_MakeVector2D_ReturnValue_2) == 0x000170, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_MakeVector2D_ReturnValue_3) == 0x000178, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_14) == 0x000180, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_14' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_15) == 0x000190, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_15' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_16) == 0x0001A0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_16' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_SetVisible_self_CastInput_17) == 0x0001B0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_SetVisible_self_CastInput_17' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_InHpBarType) == 0x0001C0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_InHpBarType' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_SwitchEnum_CmpSuccess_2) == 0x0001C1, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_MakeVector2D_ReturnValue_4) == 0x0001C4, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector2D_X) == 0x0001CC, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector2D_Y) == 0x0001D0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_MakeVector2D_ReturnValue_5) == 0x0001D4, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_MakeVector2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, K2Node_Event_IsDesignTime) == 0x0001DC, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector2D_X_1) == 0x0001E0, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C, CallFunc_BreakVector2D_Y_1) == 0x0001E4, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_ExecuteUbergraph_BP_NamePlateFrame_PcSimple_Optimization2C::CallFunc_BreakVector2D_Y_1' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_PreConstruct) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_PreConstruct");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_PreConstruct) == 0x000001, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_PreConstruct");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.OnUpdateHpBarType
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateHpBarType final
{
public:
	EHpBarType                                    InHpBarType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateHpBarType) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateHpBarType");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateHpBarType) == 0x000001, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateHpBarType");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateHpBarType, InHpBarType) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateHpBarType::InHpBarType' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.OnUpdateSimpleLayout
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateSimpleLayout final
{
public:
	ETLNameplateSimpleLayout                      InLayout;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateSimpleLayout) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateSimpleLayout");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateSimpleLayout) == 0x000001, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateSimpleLayout");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateSimpleLayout, InLayout) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdateSimpleLayout::InLayout' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.OnUpdatedMassCombatMode
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdatedMassCombatMode final
{
public:
	bool                                          bInMassCombatMode;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdatedMassCombatMode) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdatedMassCombatMode");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdatedMassCombatMode) == 0x000001, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdatedMassCombatMode");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdatedMassCombatMode, bInMassCombatMode) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_OnUpdatedMassCombatMode::bInMassCombatMode' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.OnChangeStealthDetectionState
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeStealthDetectionState final
{
public:
	ETLStealthDectectionState                     State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeStealthDetectionState) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeStealthDetectionState");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeStealthDetectionState) == 0x000001, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeStealthDetectionState");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeStealthDetectionState, State) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeStealthDetectionState::State' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.OnSimpleModeOffsetForConsole
// 0x0008 (0x0008 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSimpleModeOffsetForConsole final
{
public:
	struct FVector2D                              InRenderTransformOffset;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSimpleModeOffsetForConsole) == 0x000004, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSimpleModeOffsetForConsole");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSimpleModeOffsetForConsole) == 0x000008, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSimpleModeOffsetForConsole");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSimpleModeOffsetForConsole, InRenderTransformOffset) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSimpleModeOffsetForConsole::InRenderTransformOffset' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.OnChangeOtherPCAlive
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeOtherPCAlive final
{
public:
	bool                                          bIsAlive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeOtherPCAlive) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeOtherPCAlive");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeOtherPCAlive) == 0x000001, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeOtherPCAlive");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeOtherPCAlive, bIsAlive) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_OnChangeOtherPCAlive::bIsAlive' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.OnSetInteractPCTarget
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSetInteractPCTarget final
{
public:
	bool                                          InTarget;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSetInteractPCTarget) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSetInteractPCTarget");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSetInteractPCTarget) == 0x000001, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSetInteractPCTarget");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSetInteractPCTarget, InTarget) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_OnSetInteractPCTarget::InTarget' has a wrong offset!");

// Function BP_NamePlateFrame_PcSimple_Optimization2C.BP_NamePlateFrame_PcSimple_Optimization2C_C.Fn_SetGuildRelationColor
// 0x0013 (0x0013 - 0x0000)
struct BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor final
{
public:
	bool                                          ConflictZone;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_1;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_2;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_3;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_4;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_5;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_6;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_7;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_8;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_9;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_10;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_11;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_12;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_13;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_14;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_15;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLRelationColorToMyPc                        CallFunc_GetRelationColorToMyPc_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor) == 0x000001, "Wrong alignment on BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor");
static_assert(sizeof(BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor) == 0x000013, "Wrong size on BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor, ConflictZone) == 0x000000, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor::ConflictZone' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor, CallFunc_SetBrushByName_ReturnValue) == 0x000001, "Member 'BP_NamePlateFrame_PcSimple_Optimization2C_C_Fn_SetGuildRelationColor::CallFunc_SetBrushByName_ReturnValue' has a wrong offset!");
