#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NamePlateFrame_Simple_Optimization

#include "Basic.hpp"

#include "TLClient_structs.hpp"
#include "TLScheme_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NamePlateFrame_Simple_Optimization.BP_NamePlateFrame_Simple_Optimization_C.ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization
// 0x0148 (0x0148 - 0x0000)
struct BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InTarget;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLStealthDectectionState                     K2Node_Event_State;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_IsShow_self_CastInput;                    // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShow_ReturnValue;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBrushByName_ReturnValue_1;             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_4;              // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShow_ReturnValue_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLNameplateSimpleLayout                      K2Node_Event_InLayout;                             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_1;           // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLBossGateCrowdingStatus                     K2Node_Event_InBossGateStatus;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_5;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_6;              // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSoftObjectPath                        CallFunc_Array_Get_Item;                           // 0x00F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_Array_Get_Item_1;                         // 0x0110(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_Array_Get_Item_2;                         // 0x0128(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageColorAndOpacityBinding_ReturnValue; // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageBrushBinding_ReturnValue;         // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization) == 0x000008, "Wrong alignment on BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization");
static_assert(sizeof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization) == 0x000148, "Wrong size on BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, EntryPoint) == 0x000000, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_Event_InTarget) == 0x000004, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_Event_InTarget' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetBrushByName_ReturnValue) == 0x000018, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetBrushByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_Event_State) == 0x000019, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetVisible_self_CastInput_1) == 0x000020, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetVisible_self_CastInput_2) == 0x000030, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetVisible_self_CastInput_3) == 0x000040, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_BreakSoftObjectPath_PathString) == 0x000050, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_IsEmpty_ReturnValue) == 0x000060, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_IsShow_self_CastInput) == 0x000068, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_IsShow_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_IsShow_ReturnValue) == 0x000078, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_IsShow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetBrushByName_ReturnValue_1) == 0x00007A, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetBrushByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_ShowWithValue_self_CastInput) == 0x000080, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_NotEqual_NameName_ReturnValue) == 0x000090, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetVisible_self_CastInput_4) == 0x000098, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetVisible_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_IsShow_ReturnValue_1) == 0x0000A8, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_IsShow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_Event_InLayout) == 0x0000A9, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_Event_InLayout' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_ShowWithValue_self_CastInput_1) == 0x0000B0, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_ShowWithValue_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x0000D0, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_Event_InBossGateStatus) == 0x0000D1, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_Event_InBossGateStatus' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000D2, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetVisible_self_CastInput_5) == 0x0000D8, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetVisible_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_SetVisible_self_CastInput_6) == 0x0000E8, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_SetVisible_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_Array_Get_Item_2) == 0x000128, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, K2Node_Event_IsDesignTime) == 0x000140, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_AddImageColorAndOpacityBinding_ReturnValue) == 0x000141, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_AddImageColorAndOpacityBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization, CallFunc_AddImageBrushBinding_ReturnValue) == 0x000142, "Member 'BP_NamePlateFrame_Simple_Optimization_C_ExecuteUbergraph_BP_NamePlateFrame_Simple_Optimization::CallFunc_AddImageBrushBinding_ReturnValue' has a wrong offset!");

// Function BP_NamePlateFrame_Simple_Optimization.BP_NamePlateFrame_Simple_Optimization_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_Simple_Optimization_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_Simple_Optimization_C_PreConstruct) == 0x000001, "Wrong alignment on BP_NamePlateFrame_Simple_Optimization_C_PreConstruct");
static_assert(sizeof(BP_NamePlateFrame_Simple_Optimization_C_PreConstruct) == 0x000001, "Wrong size on BP_NamePlateFrame_Simple_Optimization_C_PreConstruct");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_NamePlateFrame_Simple_Optimization_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_NamePlateFrame_Simple_Optimization.BP_NamePlateFrame_Simple_Optimization_C.OnUpdateBossGate
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_Simple_Optimization_C_OnUpdateBossGate final
{
public:
	ETLBossGateCrowdingStatus                     InBossGateStatus;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_Simple_Optimization_C_OnUpdateBossGate) == 0x000001, "Wrong alignment on BP_NamePlateFrame_Simple_Optimization_C_OnUpdateBossGate");
static_assert(sizeof(BP_NamePlateFrame_Simple_Optimization_C_OnUpdateBossGate) == 0x000001, "Wrong size on BP_NamePlateFrame_Simple_Optimization_C_OnUpdateBossGate");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_OnUpdateBossGate, InBossGateStatus) == 0x000000, "Member 'BP_NamePlateFrame_Simple_Optimization_C_OnUpdateBossGate::InBossGateStatus' has a wrong offset!");

// Function BP_NamePlateFrame_Simple_Optimization.BP_NamePlateFrame_Simple_Optimization_C.OnUpdateSimpleLayout
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_Simple_Optimization_C_OnUpdateSimpleLayout final
{
public:
	ETLNameplateSimpleLayout                      InLayout;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_Simple_Optimization_C_OnUpdateSimpleLayout) == 0x000001, "Wrong alignment on BP_NamePlateFrame_Simple_Optimization_C_OnUpdateSimpleLayout");
static_assert(sizeof(BP_NamePlateFrame_Simple_Optimization_C_OnUpdateSimpleLayout) == 0x000001, "Wrong size on BP_NamePlateFrame_Simple_Optimization_C_OnUpdateSimpleLayout");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_OnUpdateSimpleLayout, InLayout) == 0x000000, "Member 'BP_NamePlateFrame_Simple_Optimization_C_OnUpdateSimpleLayout::InLayout' has a wrong offset!");

// Function BP_NamePlateFrame_Simple_Optimization.BP_NamePlateFrame_Simple_Optimization_C.OnChangeStealthDetectionState
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_Simple_Optimization_C_OnChangeStealthDetectionState final
{
public:
	ETLStealthDectectionState                     State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NamePlateFrame_Simple_Optimization_C_OnChangeStealthDetectionState) == 0x000001, "Wrong alignment on BP_NamePlateFrame_Simple_Optimization_C_OnChangeStealthDetectionState");
static_assert(sizeof(BP_NamePlateFrame_Simple_Optimization_C_OnChangeStealthDetectionState) == 0x000001, "Wrong size on BP_NamePlateFrame_Simple_Optimization_C_OnChangeStealthDetectionState");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_OnChangeStealthDetectionState, State) == 0x000000, "Member 'BP_NamePlateFrame_Simple_Optimization_C_OnChangeStealthDetectionState::State' has a wrong offset!");

// Function BP_NamePlateFrame_Simple_Optimization.BP_NamePlateFrame_Simple_Optimization_C.OnSetInteractPCTarget
// 0x0001 (0x0001 - 0x0000)
struct BP_NamePlateFrame_Simple_Optimization_C_OnSetInteractPCTarget final
{
public:
	bool                                          InTarget;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NamePlateFrame_Simple_Optimization_C_OnSetInteractPCTarget) == 0x000001, "Wrong alignment on BP_NamePlateFrame_Simple_Optimization_C_OnSetInteractPCTarget");
static_assert(sizeof(BP_NamePlateFrame_Simple_Optimization_C_OnSetInteractPCTarget) == 0x000001, "Wrong size on BP_NamePlateFrame_Simple_Optimization_C_OnSetInteractPCTarget");
static_assert(offsetof(BP_NamePlateFrame_Simple_Optimization_C_OnSetInteractPCTarget, InTarget) == 0x000000, "Member 'BP_NamePlateFrame_Simple_Optimization_C_OnSetInteractPCTarget::InTarget' has a wrong offset!");

}

