#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NamePlate_Guild_Optimization2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_NamePlate_Guild_Optimization2.BP_NamePlate_Guild_Optimization2_C
// 0x0038 (0x0AB8 - 0x0A80)
class UBP_NamePlate_Guild_Optimization2_C final : public UTLUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLSizeBox*                             GuildEmb_SizeBox;                                  // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Image_GuildEmblem;                                 // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Img_GuildRelation;                                 // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_NamePlete_Tem_Emblem_Optimization_C* Tem_Emblem_Optimization;                           // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             Temp_SizeBox;                                      // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              GuildSize;                                         // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NamePlate_Guild_Optimization2(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NamePlate_Guild_Optimization2_C">();
	}
	static class UBP_NamePlate_Guild_Optimization2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NamePlate_Guild_Optimization2_C>();
	}
};
static_assert(alignof(UBP_NamePlate_Guild_Optimization2_C) == 0x000008, "Wrong alignment on UBP_NamePlate_Guild_Optimization2_C");
static_assert(sizeof(UBP_NamePlate_Guild_Optimization2_C) == 0x000AB8, "Wrong size on UBP_NamePlate_Guild_Optimization2_C");
static_assert(offsetof(UBP_NamePlate_Guild_Optimization2_C, UberGraphFrame) == 0x000A80, "Member 'UBP_NamePlate_Guild_Optimization2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_Guild_Optimization2_C, GuildEmb_SizeBox) == 0x000A88, "Member 'UBP_NamePlate_Guild_Optimization2_C::GuildEmb_SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_Guild_Optimization2_C, Image_GuildEmblem) == 0x000A90, "Member 'UBP_NamePlate_Guild_Optimization2_C::Image_GuildEmblem' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_Guild_Optimization2_C, Img_GuildRelation) == 0x000A98, "Member 'UBP_NamePlate_Guild_Optimization2_C::Img_GuildRelation' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_Guild_Optimization2_C, Tem_Emblem_Optimization) == 0x000AA0, "Member 'UBP_NamePlate_Guild_Optimization2_C::Tem_Emblem_Optimization' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_Guild_Optimization2_C, Temp_SizeBox) == 0x000AA8, "Member 'UBP_NamePlate_Guild_Optimization2_C::Temp_SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_NamePlate_Guild_Optimization2_C, GuildSize) == 0x000AB0, "Member 'UBP_NamePlate_Guild_Optimization2_C::GuildSize' has a wrong offset!");

}

