#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_PolyMorph_TotalTooltip_Frame_EX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Bp_PolyMorph_TotalTooltip_Frame_EX.Bp_PolyMorph_TotalTooltip_Frame_EX_C
// 0x00F8 (0x0E68 - 0x0D70)
class UBp_PolyMorph_TotalTooltip_Frame_EX_C final : public UTLUserWidgetPolymorphItemTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0D78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0D80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLSizeBox*                             ActionGuideBox;                                    // 0x0D88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MagicDoll_Detail_Description_C*     BP_MagicDoll_Detail_Description;                   // 0x0D90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PolyMorph_Tooltip_Portrait_C*       BP_MagicDoll_List_ItemSlot_Portrait;               // 0x0D98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         DetailStat_MainInfo;                               // 0x0DA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         DetailStat_MainSummonInfo;                         // 0x0DA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         DetailStat_SubInfo;                                // 0x0DB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         DetailStat_SubSummonInfo;                          // 0x0DB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         ExtraMaterialChanceByCondition_Panel;              // 0x0DC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemSlot_Frame;                                    // 0x0DC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_2;                                 // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_Acquired;                          // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage;                                           // 0x0DE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_1;                                         // 0x0DE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         TLPolymorph_Detail_Description;                    // 0x0DF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Tooltip_DetailStats_Info;                          // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Tooltip_DetailStats_Skill_Main;                    // 0x0E00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Tooltip_DetailStats_Skill_Sub;                     // 0x0E08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Tooltip_DetailSummonStats_Info;                    // 0x0E10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLVerticalBox*                         Tooltip_SpeciesStats_Info;                         // 0x0E18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Grade_1;                                       // 0x0E20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Grade_2;                                       // 0x0E28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Grade_3;                                       // 0x0E30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Label;                                         // 0x0E38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Species;                                       // 0x0E40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Summoned;                                      // 0x0E48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Tooltip_Description;                           // 0x0E50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Tooltip_PolyMorph_Name_1;                      // 0x0E58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Tooltip_SpeciesEffect;                         // 0x0E60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_PolyMorph_TotalTooltip_Frame_EX_C">();
	}
	static class UBp_PolyMorph_TotalTooltip_Frame_EX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBp_PolyMorph_TotalTooltip_Frame_EX_C>();
	}
};
static_assert(alignof(UBp_PolyMorph_TotalTooltip_Frame_EX_C) == 0x000008, "Wrong alignment on UBp_PolyMorph_TotalTooltip_Frame_EX_C");
static_assert(sizeof(UBp_PolyMorph_TotalTooltip_Frame_EX_C) == 0x000E68, "Wrong size on UBp_PolyMorph_TotalTooltip_Frame_EX_C");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, UberGraphFrame) == 0x000D70, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, HideAnim) == 0x000D78, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, ShowAnim) == 0x000D80, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, ActionGuideBox) == 0x000D88, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::ActionGuideBox' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, BP_MagicDoll_Detail_Description) == 0x000D90, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::BP_MagicDoll_Detail_Description' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, BP_MagicDoll_List_ItemSlot_Portrait) == 0x000D98, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::BP_MagicDoll_List_ItemSlot_Portrait' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, DetailStat_MainInfo) == 0x000DA0, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::DetailStat_MainInfo' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, DetailStat_MainSummonInfo) == 0x000DA8, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::DetailStat_MainSummonInfo' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, DetailStat_SubInfo) == 0x000DB0, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::DetailStat_SubInfo' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, DetailStat_SubSummonInfo) == 0x000DB8, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::DetailStat_SubSummonInfo' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, ExtraMaterialChanceByCondition_Panel) == 0x000DC0, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::ExtraMaterialChanceByCondition_Panel' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, ItemSlot_Frame) == 0x000DC8, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::ItemSlot_Frame' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TLHorizontalBox_2) == 0x000DD0, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TLHorizontalBox_2' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TLHorizontalBox_Acquired) == 0x000DD8, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TLHorizontalBox_Acquired' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TLImage) == 0x000DE0, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TLImage' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TLImage_1) == 0x000DE8, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TLImage_1' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TLPolymorph_Detail_Description) == 0x000DF0, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TLPolymorph_Detail_Description' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, Tooltip_DetailStats_Info) == 0x000DF8, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::Tooltip_DetailStats_Info' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, Tooltip_DetailStats_Skill_Main) == 0x000E00, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::Tooltip_DetailStats_Skill_Main' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, Tooltip_DetailStats_Skill_Sub) == 0x000E08, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::Tooltip_DetailStats_Skill_Sub' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, Tooltip_DetailSummonStats_Info) == 0x000E10, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::Tooltip_DetailSummonStats_Info' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, Tooltip_SpeciesStats_Info) == 0x000E18, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::Tooltip_SpeciesStats_Info' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Grade_1) == 0x000E20, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Grade_1' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Grade_2) == 0x000E28, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Grade_2' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Grade_3) == 0x000E30, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Grade_3' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Label) == 0x000E38, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Label' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Species) == 0x000E40, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Species' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Summoned) == 0x000E48, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Summoned' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Tooltip_Description) == 0x000E50, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Tooltip_Description' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Tooltip_PolyMorph_Name_1) == 0x000E58, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Tooltip_PolyMorph_Name_1' has a wrong offset!");
static_assert(offsetof(UBp_PolyMorph_TotalTooltip_Frame_EX_C, TXT_Tooltip_SpeciesEffect) == 0x000E60, "Member 'UBp_PolyMorph_TotalTooltip_Frame_EX_C::TXT_Tooltip_SpeciesEffect' has a wrong offset!");

}

