#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_Polymorph_TotalTooltip_DetailStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Bp_Polymorph_TotalTooltip_DetailStats.Bp_Polymorph_TotalTooltip_DetailStats_C
// 0x0098 (0x0BF0 - 0x0B58)
class UBp_Polymorph_TotalTooltip_DetailStats_C final : public UTLUserWidgetPolymorphStat
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0B60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0B68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_DetailStatName;                                // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_DetailStatValue;                               // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Bold;                                              // 0x0B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B81[0x7];                                      // 0x0B81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        StylePath_BoldName;                                // 0x0B88(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        StylePath_NormalName;                              // 0x0BA0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        StylePath_BoldValue;                               // 0x0BB8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        StylePath_NormalValue;                             // 0x0BD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           _C;                                                // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Bp_Polymorph_TotalTooltip_DetailStats(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void CustomEvent_0();
	void Construct();
	void SetBold(bool Bold_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_Polymorph_TotalTooltip_DetailStats_C">();
	}
	static class UBp_Polymorph_TotalTooltip_DetailStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBp_Polymorph_TotalTooltip_DetailStats_C>();
	}
};
static_assert(alignof(UBp_Polymorph_TotalTooltip_DetailStats_C) == 0x000008, "Wrong alignment on UBp_Polymorph_TotalTooltip_DetailStats_C");
static_assert(sizeof(UBp_Polymorph_TotalTooltip_DetailStats_C) == 0x000BF0, "Wrong size on UBp_Polymorph_TotalTooltip_DetailStats_C");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, UberGraphFrame) == 0x000B58, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, HideAnim) == 0x000B60, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, ShowAnim) == 0x000B68, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, TXT_DetailStatName) == 0x000B70, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::TXT_DetailStatName' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, TXT_DetailStatValue) == 0x000B78, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::TXT_DetailStatValue' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, Bold) == 0x000B80, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::Bold' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, StylePath_BoldName) == 0x000B88, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::StylePath_BoldName' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, StylePath_NormalName) == 0x000BA0, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::StylePath_NormalName' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, StylePath_BoldValue) == 0x000BB8, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::StylePath_BoldValue' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, StylePath_NormalValue) == 0x000BD0, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::StylePath_NormalValue' has a wrong offset!");
static_assert(offsetof(UBp_Polymorph_TotalTooltip_DetailStats_C, _C) == 0x000BE8, "Member 'UBp_Polymorph_TotalTooltip_DetailStats_C::_C' has a wrong offset!");

}

