#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PolyMorph_Tooltip_Portrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PolyMorph_Tooltip_Portrait.BP_PolyMorph_Tooltip_Portrait_C
// 0x0028 (0x0B00 - 0x0AD8)
class UBP_PolyMorph_Tooltip_Portrait_C final : public UTLUserWidgetPolymorphTooltipIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               Dim;                                               // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               DollIcon_Image;                                    // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               LevelBG;                                           // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Line;                                              // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PolyMorph_Tooltip_Portrait(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PolyMorph_Tooltip_Portrait_C">();
	}
	static class UBP_PolyMorph_Tooltip_Portrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PolyMorph_Tooltip_Portrait_C>();
	}
};
static_assert(alignof(UBP_PolyMorph_Tooltip_Portrait_C) == 0x000008, "Wrong alignment on UBP_PolyMorph_Tooltip_Portrait_C");
static_assert(sizeof(UBP_PolyMorph_Tooltip_Portrait_C) == 0x000B00, "Wrong size on UBP_PolyMorph_Tooltip_Portrait_C");
static_assert(offsetof(UBP_PolyMorph_Tooltip_Portrait_C, UberGraphFrame) == 0x000AD8, "Member 'UBP_PolyMorph_Tooltip_Portrait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PolyMorph_Tooltip_Portrait_C, Dim) == 0x000AE0, "Member 'UBP_PolyMorph_Tooltip_Portrait_C::Dim' has a wrong offset!");
static_assert(offsetof(UBP_PolyMorph_Tooltip_Portrait_C, DollIcon_Image) == 0x000AE8, "Member 'UBP_PolyMorph_Tooltip_Portrait_C::DollIcon_Image' has a wrong offset!");
static_assert(offsetof(UBP_PolyMorph_Tooltip_Portrait_C, LevelBG) == 0x000AF0, "Member 'UBP_PolyMorph_Tooltip_Portrait_C::LevelBG' has a wrong offset!");
static_assert(offsetof(UBP_PolyMorph_Tooltip_Portrait_C, Line) == 0x000AF8, "Member 'UBP_PolyMorph_Tooltip_Portrait_C::Line' has a wrong offset!");

}

