#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Polymorph_Detail_Skill_Icon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Polymorph_Detail_Skill_Icon.BP_Polymorph_Detail_Skill_Icon_C
// 0x0048 (0x0AC8 - 0x0A80)
class UBP_Polymorph_Detail_Skill_Icon_C final : public UTLUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Dimmed;                                            // 0x0A88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               SkillFrame;                                        // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               SkillIcon;                                         // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               SkillIcon_Background;                              // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_HUd_Heal_potion;                               // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_0;                                       // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Count;                                         // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         SkillSize_W;                                       // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_Size_H;                                      // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SetInfo(const struct FSoftObjectPath& Icon, bool bIsActive_, bool bIsUnveiled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Polymorph_Detail_Skill_Icon_C">();
	}
	static class UBP_Polymorph_Detail_Skill_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Polymorph_Detail_Skill_Icon_C>();
	}
};
static_assert(alignof(UBP_Polymorph_Detail_Skill_Icon_C) == 0x000008, "Wrong alignment on UBP_Polymorph_Detail_Skill_Icon_C");
static_assert(sizeof(UBP_Polymorph_Detail_Skill_Icon_C) == 0x000AC8, "Wrong size on UBP_Polymorph_Detail_Skill_Icon_C");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, UberGraphFrame) == 0x000A80, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, Dimmed) == 0x000A88, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::Dimmed' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, SkillFrame) == 0x000A90, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::SkillFrame' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, SkillIcon) == 0x000A98, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::SkillIcon' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, SkillIcon_Background) == 0x000AA0, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::SkillIcon_Background' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, Tex_HUd_Heal_potion) == 0x000AA8, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::Tex_HUd_Heal_potion' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, TLSizeBox_0) == 0x000AB0, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::TLSizeBox_0' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, TXT_Count) == 0x000AB8, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::TXT_Count' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, SkillSize_W) == 0x000AC0, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::SkillSize_W' has a wrong offset!");
static_assert(offsetof(UBP_Polymorph_Detail_Skill_Icon_C, Skill_Size_H) == 0x000AC4, "Member 'UBP_Polymorph_Detail_Skill_Icon_C::Skill_Size_H' has a wrong offset!");

}

