#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_PolyMorph_TotalTooltip_Frame_EX

#include "Basic.hpp"


namespace SDK::Params
{

// Function Bp_PolyMorph_TotalTooltip_Frame_EX.Bp_PolyMorph_TotalTooltip_Frame_EX_C.ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX
// 0x0018 (0x0018 - 0x0000)
struct Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_2;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_3;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_2;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_3;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_4;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_5;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_6;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_7;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_8;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_9;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_10;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_11;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_4;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX) == 0x000004, "Wrong alignment on Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX");
static_assert(sizeof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX) == 0x000018, "Wrong size on Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, EntryPoint) == 0x000000, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddTextBinding_ReturnValue) == 0x000004, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddTextBinding_ReturnValue_1) == 0x000005, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddTextBinding_ReturnValue_2) == 0x000006, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddTextBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue) == 0x000007, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddTextBinding_ReturnValue_3) == 0x000008, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddTextBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_1) == 0x000009, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_2) == 0x00000A, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_3) == 0x00000B, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_4) == 0x00000C, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_5) == 0x00000D, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_6) == 0x00000E, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_7) == 0x00000F, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_8) == 0x000010, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_9) == 0x000011, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_10) == 0x000012, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddVisibleBinding_ReturnValue_11) == 0x000013, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddVisibleBinding_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX, CallFunc_AddTextBinding_ReturnValue_4) == 0x000014, "Member 'Bp_PolyMorph_TotalTooltip_Frame_EX_C_ExecuteUbergraph_Bp_PolyMorph_TotalTooltip_Frame_EX::CallFunc_AddTextBinding_ReturnValue_4' has a wrong offset!");

}

