#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartyDungeon_SpecialPoint_Tooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PartyDungeon_SpecialPoint_Tooltip.BP_PartyDungeon_SpecialPoint_Tooltip_C
// 0x0040 (0x0AE8 - 0x0AA8)
class UBP_PartyDungeon_SpecialPoint_Tooltip_C final : public UTLUserWidgetDungeonRewardPointTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_TooltipPanel_Bg_C*                  BP_TooltipPanel_Bg;                                // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ICO_Membership;                                    // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLProgressBar*                         ProgressBar;                                       // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Point_Charge;                                  // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Point_Charge_Title;                            // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_slash;                                         // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_SpecialPoint_Info;                             // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PartyDungeon_SpecialPoint_Tooltip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PartyDungeon_SpecialPoint_Tooltip_C">();
	}
	static class UBP_PartyDungeon_SpecialPoint_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PartyDungeon_SpecialPoint_Tooltip_C>();
	}
};
static_assert(alignof(UBP_PartyDungeon_SpecialPoint_Tooltip_C) == 0x000008, "Wrong alignment on UBP_PartyDungeon_SpecialPoint_Tooltip_C");
static_assert(sizeof(UBP_PartyDungeon_SpecialPoint_Tooltip_C) == 0x000AE8, "Wrong size on UBP_PartyDungeon_SpecialPoint_Tooltip_C");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, UberGraphFrame) == 0x000AA8, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, BP_TooltipPanel_Bg) == 0x000AB0, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::BP_TooltipPanel_Bg' has a wrong offset!");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, ICO_Membership) == 0x000AB8, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::ICO_Membership' has a wrong offset!");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, ProgressBar) == 0x000AC0, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, TXT_Point_Charge) == 0x000AC8, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::TXT_Point_Charge' has a wrong offset!");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, TXT_Point_Charge_Title) == 0x000AD0, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::TXT_Point_Charge_Title' has a wrong offset!");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, TXT_slash) == 0x000AD8, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::TXT_slash' has a wrong offset!");
static_assert(offsetof(UBP_PartyDungeon_SpecialPoint_Tooltip_C, TXT_SpecialPoint_Info) == 0x000AE0, "Member 'UBP_PartyDungeon_SpecialPoint_Tooltip_C::TXT_SpecialPoint_Info' has a wrong offset!");

}

