#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Polymorph_Detail_Skill_Icon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Polymorph_Detail_Skill_Icon.BP_Polymorph_Detail_Skill_Icon_C.ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon
// 0x0008 (0x0008 - 0x0000)
struct BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon) == 0x000004, "Wrong alignment on BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon");
static_assert(sizeof(BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon) == 0x000008, "Wrong size on BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon, EntryPoint) == 0x000000, "Member 'BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_Polymorph_Detail_Skill_Icon_C_ExecuteUbergraph_BP_Polymorph_Detail_Skill_Icon::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BP_Polymorph_Detail_Skill_Icon.BP_Polymorph_Detail_Skill_Icon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Polymorph_Detail_Skill_Icon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Polymorph_Detail_Skill_Icon_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Polymorph_Detail_Skill_Icon_C_PreConstruct");
static_assert(sizeof(BP_Polymorph_Detail_Skill_Icon_C_PreConstruct) == 0x000001, "Wrong size on BP_Polymorph_Detail_Skill_Icon_C_PreConstruct");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Polymorph_Detail_Skill_Icon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Polymorph_Detail_Skill_Icon.BP_Polymorph_Detail_Skill_Icon_C.SetInfo
// 0x0078 (0x0078 - 0x0000)
struct BP_Polymorph_Detail_Skill_Icon_C_SetInfo final
{
public:
	struct FSoftObjectPath                        Icon;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsActive_;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsUnveiled;                                       // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             PassiveFrameTexture;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ActiveFrameTexture;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               PassiveMaskTexture;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ActiveMaskTexture;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAssetPath_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_1;           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_2;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo) == 0x000008, "Wrong alignment on BP_Polymorph_Detail_Skill_Icon_C_SetInfo");
static_assert(sizeof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo) == 0x000078, "Wrong size on BP_Polymorph_Detail_Skill_Icon_C_SetInfo");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, Icon) == 0x000000, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::Icon' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, bIsActive_) == 0x000018, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::bIsActive_' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, bIsUnveiled) == 0x000019, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::bIsUnveiled' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, PassiveFrameTexture) == 0x000020, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::PassiveFrameTexture' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, ActiveFrameTexture) == 0x000028, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::ActiveFrameTexture' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, PassiveMaskTexture) == 0x000030, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::PassiveMaskTexture' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, ActiveMaskTexture) == 0x000038, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::ActiveMaskTexture' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, CallFunc_IsValidAssetPath_ReturnValue) == 0x000040, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::CallFunc_IsValidAssetPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, CallFunc_ShowWithValue_self_CastInput) == 0x000048, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, CallFunc_ShowWithValue_self_CastInput_1) == 0x000058, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::CallFunc_ShowWithValue_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Polymorph_Detail_Skill_Icon_C_SetInfo, CallFunc_ShowWithValue_self_CastInput_2) == 0x000068, "Member 'BP_Polymorph_Detail_Skill_Icon_C_SetInfo::CallFunc_ShowWithValue_self_CastInput_2' has a wrong offset!");

}

