#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuneSystem_Synergy_Text

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_RuneSystem_Synergy_Text.BP_RuneSystem_Synergy_Text_C.ExecuteUbergraph_BP_RuneSystem_Synergy_Text
// 0x0040 (0x0040 - 0x0000)
struct BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTLImage*>                       K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_Event_InIsActive;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemGrade                                    K2Node_Event_InSynergyGrade;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text) == 0x000008, "Wrong alignment on BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text");
static_assert(sizeof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text) == 0x000040, "Wrong size on BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, EntryPoint) == 0x000000, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, K2Node_Event_InIsActive) == 0x000018, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::K2Node_Event_InIsActive' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, K2Node_Event_InSynergyGrade) == 0x000019, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::K2Node_Event_InSynergyGrade' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, CallFunc_SetVisible_self_CastInput) == 0x000020, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text, CallFunc_SetVisible_self_CastInput_1) == 0x000030, "Member 'BP_RuneSystem_Synergy_Text_C_ExecuteUbergraph_BP_RuneSystem_Synergy_Text::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");

// Function BP_RuneSystem_Synergy_Text.BP_RuneSystem_Synergy_Text_C.OnActiveRuneSynergy
// 0x0002 (0x0002 - 0x0000)
struct BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy final
{
public:
	bool                                          InIsActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemGrade                                    InSynergyGrade;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy) == 0x000001, "Wrong alignment on BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy");
static_assert(sizeof(BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy) == 0x000002, "Wrong size on BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy, InIsActive) == 0x000000, "Member 'BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy::InIsActive' has a wrong offset!");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy, InSynergyGrade) == 0x000001, "Member 'BP_RuneSystem_Synergy_Text_C_OnActiveRuneSynergy::InSynergyGrade' has a wrong offset!");

// Function BP_RuneSystem_Synergy_Text.BP_RuneSystem_Synergy_Text_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_RuneSystem_Synergy_Text_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RuneSystem_Synergy_Text_C_PreConstruct) == 0x000001, "Wrong alignment on BP_RuneSystem_Synergy_Text_C_PreConstruct");
static_assert(sizeof(BP_RuneSystem_Synergy_Text_C_PreConstruct) == 0x000001, "Wrong size on BP_RuneSystem_Synergy_Text_C_PreConstruct");
static_assert(offsetof(BP_RuneSystem_Synergy_Text_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_RuneSystem_Synergy_Text_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

