#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuneSystem_Synergy_Text

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_RuneSystem_Synergy_Text.BP_RuneSystem_Synergy_Text_C
// 0x0098 (0x0B48 - 0x0AB0)
class UBP_RuneSystem_Synergy_Text_C final : public UTLUserWidgetRuneSynergyListSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               Rune1;                                             // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Rune2;                                             // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Rune3;                                             // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_BG;                                        // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_Fx;                                        // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Stat;                                          // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Synergy;                                           // 0x0AE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        Normal;                                            // 0x0B00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        In_TLText_Block_Active;                            // 0x0B18(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        In_TLText_Block_UnActive;                          // 0x0B30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RuneSystem_Synergy_Text(int32 EntryPoint);
	void OnActiveRuneSynergy(bool InIsActive, EItemGrade InSynergyGrade);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RuneSystem_Synergy_Text_C">();
	}
	static class UBP_RuneSystem_Synergy_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RuneSystem_Synergy_Text_C>();
	}
};
static_assert(alignof(UBP_RuneSystem_Synergy_Text_C) == 0x000008, "Wrong alignment on UBP_RuneSystem_Synergy_Text_C");
static_assert(sizeof(UBP_RuneSystem_Synergy_Text_C) == 0x000B48, "Wrong size on UBP_RuneSystem_Synergy_Text_C");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, UberGraphFrame) == 0x000AB0, "Member 'UBP_RuneSystem_Synergy_Text_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, Rune1) == 0x000AB8, "Member 'UBP_RuneSystem_Synergy_Text_C::Rune1' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, Rune2) == 0x000AC0, "Member 'UBP_RuneSystem_Synergy_Text_C::Rune2' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, Rune3) == 0x000AC8, "Member 'UBP_RuneSystem_Synergy_Text_C::Rune3' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, TLImage_BG) == 0x000AD0, "Member 'UBP_RuneSystem_Synergy_Text_C::TLImage_BG' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, TLImage_Fx) == 0x000AD8, "Member 'UBP_RuneSystem_Synergy_Text_C::TLImage_Fx' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, TXT_Stat) == 0x000AE0, "Member 'UBP_RuneSystem_Synergy_Text_C::TXT_Stat' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, Synergy) == 0x000AE8, "Member 'UBP_RuneSystem_Synergy_Text_C::Synergy' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, Normal) == 0x000B00, "Member 'UBP_RuneSystem_Synergy_Text_C::Normal' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, In_TLText_Block_Active) == 0x000B18, "Member 'UBP_RuneSystem_Synergy_Text_C::In_TLText_Block_Active' has a wrong offset!");
static_assert(offsetof(UBP_RuneSystem_Synergy_Text_C, In_TLText_Block_UnActive) == 0x000B30, "Member 'UBP_RuneSystem_Synergy_Text_C::In_TLText_Block_UnActive' has a wrong offset!");

}

