#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skill_LevelupSetting_Slot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Skill_LevelupSetting_Slot.BP_Skill_LevelupSetting_Slot_C.ExecuteUbergraph_BP_Skill_LevelupSetting_Slot
// 0x0030 (0x0030 - 0x0000)
struct BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_InDimmed;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddImageBrushBinding_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextColorAndOpacityBinding_ReturnValue; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot) == 0x000008, "Wrong alignment on BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot");
static_assert(sizeof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot) == 0x000030, "Wrong size on BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, EntryPoint) == 0x000000, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, K2Node_Event_InDimmed) == 0x000014, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::K2Node_Event_InDimmed' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, K2Node_Event_IsDesignTime) == 0x000015, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, CallFunc_SetVisible_self_CastInput) == 0x000018, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, CallFunc_AddImageBrushBinding_ReturnValue) == 0x000028, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::CallFunc_AddImageBrushBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, CallFunc_AddTextBinding_ReturnValue) == 0x000029, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x00002A, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot, CallFunc_AddTextColorAndOpacityBinding_ReturnValue) == 0x00002B, "Member 'BP_Skill_LevelupSetting_Slot_C_ExecuteUbergraph_BP_Skill_LevelupSetting_Slot::CallFunc_AddTextColorAndOpacityBinding_ReturnValue' has a wrong offset!");

// Function BP_Skill_LevelupSetting_Slot.BP_Skill_LevelupSetting_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Skill_LevelupSetting_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skill_LevelupSetting_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Skill_LevelupSetting_Slot_C_PreConstruct");
static_assert(sizeof(BP_Skill_LevelupSetting_Slot_C_PreConstruct) == 0x000001, "Wrong size on BP_Skill_LevelupSetting_Slot_C_PreConstruct");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Skill_LevelupSetting_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Skill_LevelupSetting_Slot.BP_Skill_LevelupSetting_Slot_C.OnDimmed
// 0x0001 (0x0001 - 0x0000)
struct BP_Skill_LevelupSetting_Slot_C_OnDimmed final
{
public:
	bool                                          InDimmed;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skill_LevelupSetting_Slot_C_OnDimmed) == 0x000001, "Wrong alignment on BP_Skill_LevelupSetting_Slot_C_OnDimmed");
static_assert(sizeof(BP_Skill_LevelupSetting_Slot_C_OnDimmed) == 0x000001, "Wrong size on BP_Skill_LevelupSetting_Slot_C_OnDimmed");
static_assert(offsetof(BP_Skill_LevelupSetting_Slot_C_OnDimmed, InDimmed) == 0x000000, "Member 'BP_Skill_LevelupSetting_Slot_C_OnDimmed::InDimmed' has a wrong offset!");

}

