#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillTooltip_Specialization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SkillTooltip_Specialization.BP_SkillTooltip_Specialization_C
// 0x0018 (0x0AA8 - 0x0A90)
class UBP_SkillTooltip_Specialization_C final : public UTLUserWidgetActivateSkillTraitInSkillTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               Specialization_Icon;                               // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Specialization_Name;                           // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkillTooltip_Specialization(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillTooltip_Specialization_C">();
	}
	static class UBP_SkillTooltip_Specialization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkillTooltip_Specialization_C>();
	}
};
static_assert(alignof(UBP_SkillTooltip_Specialization_C) == 0x000008, "Wrong alignment on UBP_SkillTooltip_Specialization_C");
static_assert(sizeof(UBP_SkillTooltip_Specialization_C) == 0x000AA8, "Wrong size on UBP_SkillTooltip_Specialization_C");
static_assert(offsetof(UBP_SkillTooltip_Specialization_C, UberGraphFrame) == 0x000A90, "Member 'UBP_SkillTooltip_Specialization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkillTooltip_Specialization_C, Specialization_Icon) == 0x000A98, "Member 'UBP_SkillTooltip_Specialization_C::Specialization_Icon' has a wrong offset!");
static_assert(offsetof(UBP_SkillTooltip_Specialization_C, TXT_Specialization_Name) == 0x000AA0, "Member 'UBP_SkillTooltip_Specialization_C::TXT_Specialization_Name' has a wrong offset!");

}

