#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Subtitle_Frame_Lobby

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Subtitle_Frame_Lobby.BP_Subtitle_Frame_Lobby_C.ExecuteUbergraph_BP_Subtitle_Frame_Lobby
// 0x000C (0x000C - 0x0000)
struct BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_2;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_3;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_4;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby) == 0x000004, "Wrong alignment on BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby");
static_assert(sizeof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby) == 0x00000C, "Wrong size on BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, EntryPoint) == 0x000000, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, CallFunc_AddTextBinding_ReturnValue) == 0x000004, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, CallFunc_AddVisibleBinding_ReturnValue) == 0x000005, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::CallFunc_AddVisibleBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, CallFunc_AddVisibleBinding_ReturnValue_1) == 0x000006, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::CallFunc_AddVisibleBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, CallFunc_AddVisibleBinding_ReturnValue_2) == 0x000007, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::CallFunc_AddVisibleBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, CallFunc_AddTextBinding_ReturnValue_1) == 0x000008, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, CallFunc_AddVisibleBinding_ReturnValue_3) == 0x000009, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::CallFunc_AddVisibleBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby, CallFunc_AddVisibleBinding_ReturnValue_4) == 0x00000B, "Member 'BP_Subtitle_Frame_Lobby_C_ExecuteUbergraph_BP_Subtitle_Frame_Lobby::CallFunc_AddVisibleBinding_ReturnValue_4' has a wrong offset!");

// Function BP_Subtitle_Frame_Lobby.BP_Subtitle_Frame_Lobby_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Subtitle_Frame_Lobby_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Subtitle_Frame_Lobby_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Subtitle_Frame_Lobby_C_PreConstruct");
static_assert(sizeof(BP_Subtitle_Frame_Lobby_C_PreConstruct) == 0x000001, "Wrong size on BP_Subtitle_Frame_Lobby_C_PreConstruct");
static_assert(offsetof(BP_Subtitle_Frame_Lobby_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Subtitle_Frame_Lobby_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

