#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillUp_Tooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillUp_Tooltip.BP_SkillUp_Tooltip_C.ExecuteUbergraph_BP_SkillUp_Tooltip
// 0x0188 (0x0188 - 0x0000)
struct BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00C0(0x0018)()
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0158(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTLUserWidgetSkillLevelUpIngredient*> K2Node_MakeArray_Array_3;                          // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip) == 0x000008, "Wrong alignment on BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip");
static_assert(sizeof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip) == 0x000188, "Wrong size on BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, EntryPoint) == 0x000000, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_MakeArray_Array) == 0x000048, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_Format_ReturnValue) == 0x000058, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_MakeArray_Array_1) == 0x0000B0, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_Format_ReturnValue_1) == 0x0000C0, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_SetVisible_self_CastInput) == 0x0000D8, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_SetVisible_self_CastInput_1) == 0x0000E8, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000100, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_MakeArray_Array_2) == 0x000148, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, CallFunc_Format_ReturnValue_2) == 0x000158, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_Event_IsDesignTime) == 0x000170, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip, K2Node_MakeArray_Array_3) == 0x000178, "Member 'BP_SkillUp_Tooltip_C_ExecuteUbergraph_BP_SkillUp_Tooltip::K2Node_MakeArray_Array_3' has a wrong offset!");

// Function BP_SkillUp_Tooltip.BP_SkillUp_Tooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillUp_Tooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillUp_Tooltip_C_PreConstruct) == 0x000001, "Wrong alignment on BP_SkillUp_Tooltip_C_PreConstruct");
static_assert(sizeof(BP_SkillUp_Tooltip_C_PreConstruct) == 0x000001, "Wrong size on BP_SkillUp_Tooltip_C_PreConstruct");
static_assert(offsetof(BP_SkillUp_Tooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_SkillUp_Tooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

