#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skill_LevelupSetting_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Skill_LevelupSetting_Slot.BP_Skill_LevelupSetting_Slot_C
// 0x0038 (0x0E90 - 0x0E58)
class UBP_Skill_LevelupSetting_Slot_C final : public UTLUserWidgetSimpleSkillSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0E60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0E68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_SkillSlot_Active_C*                 BP_Tem_SkillSlot;                                  // 0x0E70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         RankInfoPanel;                                     // 0x0E78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               SkillPoint_Up_Image;                               // 0x0E80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Rank;                                          // 0x0E88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Skill_LevelupSetting_Slot(int32 EntryPoint);
	void ___t___0();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnDimmed(bool InDimmed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Skill_LevelupSetting_Slot_C">();
	}
	static class UBP_Skill_LevelupSetting_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Skill_LevelupSetting_Slot_C>();
	}
};
static_assert(alignof(UBP_Skill_LevelupSetting_Slot_C) == 0x000008, "Wrong alignment on UBP_Skill_LevelupSetting_Slot_C");
static_assert(sizeof(UBP_Skill_LevelupSetting_Slot_C) == 0x000E90, "Wrong size on UBP_Skill_LevelupSetting_Slot_C");
static_assert(offsetof(UBP_Skill_LevelupSetting_Slot_C, UberGraphFrame) == 0x000E58, "Member 'UBP_Skill_LevelupSetting_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Skill_LevelupSetting_Slot_C, Hover) == 0x000E60, "Member 'UBP_Skill_LevelupSetting_Slot_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_Skill_LevelupSetting_Slot_C, Select) == 0x000E68, "Member 'UBP_Skill_LevelupSetting_Slot_C::Select' has a wrong offset!");
static_assert(offsetof(UBP_Skill_LevelupSetting_Slot_C, BP_Tem_SkillSlot) == 0x000E70, "Member 'UBP_Skill_LevelupSetting_Slot_C::BP_Tem_SkillSlot' has a wrong offset!");
static_assert(offsetof(UBP_Skill_LevelupSetting_Slot_C, RankInfoPanel) == 0x000E78, "Member 'UBP_Skill_LevelupSetting_Slot_C::RankInfoPanel' has a wrong offset!");
static_assert(offsetof(UBP_Skill_LevelupSetting_Slot_C, SkillPoint_Up_Image) == 0x000E80, "Member 'UBP_Skill_LevelupSetting_Slot_C::SkillPoint_Up_Image' has a wrong offset!");
static_assert(offsetof(UBP_Skill_LevelupSetting_Slot_C, TXT_Rank) == 0x000E88, "Member 'UBP_Skill_LevelupSetting_Slot_C::TXT_Rank' has a wrong offset!");

}

