#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillUp_Tooltip_MiscList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillUp_Tooltip_MiscList.BP_SkillUp_Tooltip_MiscList_C.ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList
// 0x0048 (0x0048 - 0x0000)
struct BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InName;                               // 0x0008(0x0018)(ConstParm)
	struct FSlateColor                            K2Node_Event_InColor;                              // 0x0020(0x0028)(ConstParm)
};
static_assert(alignof(BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList) == 0x000008, "Wrong alignment on BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList");
static_assert(sizeof(BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList) == 0x000048, "Wrong size on BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList");
static_assert(offsetof(BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList, EntryPoint) == 0x000000, "Member 'BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList, K2Node_Event_InName) == 0x000008, "Member 'BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList::K2Node_Event_InName' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList, K2Node_Event_InColor) == 0x000020, "Member 'BP_SkillUp_Tooltip_MiscList_C_ExecuteUbergraph_BP_SkillUp_Tooltip_MiscList::K2Node_Event_InColor' has a wrong offset!");

// Function BP_SkillUp_Tooltip_MiscList.BP_SkillUp_Tooltip_MiscList_C.OnUpdateItemName
// 0x0040 (0x0040 - 0x0000)
struct BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateColor                            InColor;                                           // 0x0018(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName) == 0x000008, "Wrong alignment on BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName");
static_assert(sizeof(BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName) == 0x000040, "Wrong size on BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName");
static_assert(offsetof(BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName, InName) == 0x000000, "Member 'BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName::InName' has a wrong offset!");
static_assert(offsetof(BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName, InColor) == 0x000018, "Member 'BP_SkillUp_Tooltip_MiscList_C_OnUpdateItemName::InColor' has a wrong offset!");

}

