#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpeechBalloon_PC

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_SpeechBalloon_PC.BP_SpeechBalloon_PC_C.ExecuteUbergraph_BP_SpeechBalloon_PC
// 0x000C (0x000C - 0x0000)
struct BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsMyPc;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EChatMessageCategory                          K2Node_Event_InChatCategory;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC) == 0x000004, "Wrong alignment on BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC");
static_assert(sizeof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC) == 0x00000C, "Wrong size on BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC");
static_assert(offsetof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC, EntryPoint) == 0x000000, "Member 'BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC, K2Node_Event_IsMyPc) == 0x000005, "Member 'BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC::K2Node_Event_IsMyPc' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC, K2Node_Event_InChatCategory) == 0x000006, "Member 'BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC::K2Node_Event_InChatCategory' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000007, "Member 'BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000008, "Member 'BP_SpeechBalloon_PC_C_ExecuteUbergraph_BP_SpeechBalloon_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_SpeechBalloon_PC.BP_SpeechBalloon_PC_C.OnChangeChatBalloonStyle
// 0x0002 (0x0002 - 0x0000)
struct BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle final
{
public:
	bool                                          IsMyPc;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EChatMessageCategory                          InChatCategory;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle) == 0x000001, "Wrong alignment on BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle");
static_assert(sizeof(BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle) == 0x000002, "Wrong size on BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle");
static_assert(offsetof(BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle, IsMyPc) == 0x000000, "Member 'BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle::IsMyPc' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle, InChatCategory) == 0x000001, "Member 'BP_SpeechBalloon_PC_C_OnChangeChatBalloonStyle::InChatCategory' has a wrong offset!");

// Function BP_SpeechBalloon_PC.BP_SpeechBalloon_PC_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_SpeechBalloon_PC_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpeechBalloon_PC_C_PreConstruct) == 0x000001, "Wrong alignment on BP_SpeechBalloon_PC_C_PreConstruct");
static_assert(sizeof(BP_SpeechBalloon_PC_C_PreConstruct) == 0x000001, "Wrong size on BP_SpeechBalloon_PC_C_PreConstruct");
static_assert(offsetof(BP_SpeechBalloon_PC_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_SpeechBalloon_PC_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

