#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpeechBalloon_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SpeechBalloon_PC.BP_SpeechBalloon_PC_C
// 0x00F0 (0x1660 - 0x1570)
class UBP_SpeechBalloon_PC_C final : public UTLUserWidgetChatBalloon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Opacity;                                           // 0x1578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x1580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x1588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               BaseBG;                                            // 0x1590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Baseglow;                                          // 0x1598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Baseline_C;                                        // 0x15A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Baseline_L;                                        // 0x15A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Baseline_R;                                        // 0x15B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TextSpeech;                                        // 0x15B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLGridPanel*                           TLGridPanel_0;                                     // 0x15C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_NAME;                                          // 0x15C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        MyPCBox;                                           // 0x15D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        PCBox;                                             // 0x15E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Gold_Deco;                                         // 0x1600(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Gold_Line;                                         // 0x1618(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Silver_Deco;                                       // 0x1630(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Silver_Line;                                       // 0x1648(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SpeechBalloon_PC(int32 EntryPoint);
	void OnChangeChatBalloonStyle(bool IsMyPc, EChatMessageCategory InChatCategory);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpeechBalloon_PC_C">();
	}
	static class UBP_SpeechBalloon_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SpeechBalloon_PC_C>();
	}
};
static_assert(alignof(UBP_SpeechBalloon_PC_C) == 0x000010, "Wrong alignment on UBP_SpeechBalloon_PC_C");
static_assert(sizeof(UBP_SpeechBalloon_PC_C) == 0x001660, "Wrong size on UBP_SpeechBalloon_PC_C");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, UberGraphFrame) == 0x001570, "Member 'UBP_SpeechBalloon_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Opacity) == 0x001578, "Member 'UBP_SpeechBalloon_PC_C::Opacity' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, HideAnim) == 0x001580, "Member 'UBP_SpeechBalloon_PC_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, ShowAnim) == 0x001588, "Member 'UBP_SpeechBalloon_PC_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, BaseBG) == 0x001590, "Member 'UBP_SpeechBalloon_PC_C::BaseBG' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Baseglow) == 0x001598, "Member 'UBP_SpeechBalloon_PC_C::Baseglow' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Baseline_C) == 0x0015A0, "Member 'UBP_SpeechBalloon_PC_C::Baseline_C' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Baseline_L) == 0x0015A8, "Member 'UBP_SpeechBalloon_PC_C::Baseline_L' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Baseline_R) == 0x0015B0, "Member 'UBP_SpeechBalloon_PC_C::Baseline_R' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, TextSpeech) == 0x0015B8, "Member 'UBP_SpeechBalloon_PC_C::TextSpeech' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, TLGridPanel_0) == 0x0015C0, "Member 'UBP_SpeechBalloon_PC_C::TLGridPanel_0' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, TXT_NAME) == 0x0015C8, "Member 'UBP_SpeechBalloon_PC_C::TXT_NAME' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, MyPCBox) == 0x0015D0, "Member 'UBP_SpeechBalloon_PC_C::MyPCBox' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, PCBox) == 0x0015E8, "Member 'UBP_SpeechBalloon_PC_C::PCBox' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Gold_Deco) == 0x001600, "Member 'UBP_SpeechBalloon_PC_C::Gold_Deco' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Gold_Line) == 0x001618, "Member 'UBP_SpeechBalloon_PC_C::Gold_Line' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Silver_Deco) == 0x001630, "Member 'UBP_SpeechBalloon_PC_C::Silver_Deco' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_PC_C, Silver_Line) == 0x001648, "Member 'UBP_SpeechBalloon_PC_C::Silver_Line' has a wrong offset!");

}

