#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpeechBalloon_FO_Clue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SpeechBalloon_FO_Clue.BP_SpeechBalloon_FO_Clue_C
// 0x0060 (0x15D0 - 0x1570)
class UBP_SpeechBalloon_FO_Clue_C final : public UTLUserWidgetChatBalloon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Opacity;                                           // 0x1578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HintAnim;                                          // 0x1580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x1588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x1590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_ChatBallon_ContextFrame_C*          BP_ChatBallon_ContextFrame;                        // 0x1598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Speech_BTN_C*                       BP_Speech_BTN;                                     // 0x15A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               CalibratedBG;                                      // 0x15A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             Text;                                              // 0x15B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TextSpeech;                                        // 0x15B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         TLCanvasPanel_0;                                   // 0x15C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SpeechBalloon_FO_Clue(int32 EntryPoint);
	void OnPositionCalibrated(bool bCalibrated, ECalibratedEdgeType InEdgeType);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpeechBalloon_FO_Clue_C">();
	}
	static class UBP_SpeechBalloon_FO_Clue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SpeechBalloon_FO_Clue_C>();
	}
};
static_assert(alignof(UBP_SpeechBalloon_FO_Clue_C) == 0x000010, "Wrong alignment on UBP_SpeechBalloon_FO_Clue_C");
static_assert(sizeof(UBP_SpeechBalloon_FO_Clue_C) == 0x0015D0, "Wrong size on UBP_SpeechBalloon_FO_Clue_C");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, UberGraphFrame) == 0x001570, "Member 'UBP_SpeechBalloon_FO_Clue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, Opacity) == 0x001578, "Member 'UBP_SpeechBalloon_FO_Clue_C::Opacity' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, HintAnim) == 0x001580, "Member 'UBP_SpeechBalloon_FO_Clue_C::HintAnim' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, HideAnim) == 0x001588, "Member 'UBP_SpeechBalloon_FO_Clue_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, ShowAnim) == 0x001590, "Member 'UBP_SpeechBalloon_FO_Clue_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, BP_ChatBallon_ContextFrame) == 0x001598, "Member 'UBP_SpeechBalloon_FO_Clue_C::BP_ChatBallon_ContextFrame' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, BP_Speech_BTN) == 0x0015A0, "Member 'UBP_SpeechBalloon_FO_Clue_C::BP_Speech_BTN' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, CalibratedBG) == 0x0015A8, "Member 'UBP_SpeechBalloon_FO_Clue_C::CalibratedBG' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, Text) == 0x0015B0, "Member 'UBP_SpeechBalloon_FO_Clue_C::Text' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, TextSpeech) == 0x0015B8, "Member 'UBP_SpeechBalloon_FO_Clue_C::TextSpeech' has a wrong offset!");
static_assert(offsetof(UBP_SpeechBalloon_FO_Clue_C, TLCanvasPanel_0) == 0x0015C0, "Member 'UBP_SpeechBalloon_FO_Clue_C::TLCanvasPanel_0' has a wrong offset!");

}

