#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpeechBalloon_NPC_Clue

#include "Basic.hpp"

#include "TLClient_structs.hpp"


namespace SDK::Params
{

// Function BP_SpeechBalloon_NPC_Clue.BP_SpeechBalloon_NPC_Clue_C.ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue
// 0x00C8 (0x00C8 - 0x0000)
struct BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bCalibrated;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECalibratedEdgeType                           K2Node_Event_InEdgeType;                           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_1;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_2;           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_3;           // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_4;           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_5;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_6;           // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue) == 0x000008, "Wrong alignment on BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue");
static_assert(sizeof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue) == 0x0000C8, "Wrong size on BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, EntryPoint) == 0x000000, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, K2Node_Event_bCalibrated) == 0x000005, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::K2Node_Event_bCalibrated' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, K2Node_Event_InEdgeType) == 0x000006, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::K2Node_Event_InEdgeType' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000007, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000008, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000009, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00000A, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_ShowWithValue_self_CastInput) == 0x000010, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_ShowWithValue_self_CastInput_1) == 0x000020, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_ShowWithValue_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_AddTextBinding_ReturnValue) == 0x000030, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_ShowWithValue_self_CastInput_2) == 0x000038, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_ShowWithValue_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_ShowWithValue_self_CastInput_3) == 0x000048, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_ShowWithValue_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_ShowWithValue_self_CastInput_4) == 0x000058, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_ShowWithValue_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_ShowWithValue_self_CastInput_5) == 0x000068, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_ShowWithValue_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_SetVisible_self_CastInput) == 0x000078, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_SetVisible_self_CastInput_1) == 0x000088, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_SetVisible_self_CastInput_2) == 0x000098, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_ShowWithValue_self_CastInput_6) == 0x0000A8, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_ShowWithValue_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue, CallFunc_SetVisible_self_CastInput_3) == 0x0000B8, "Member 'BP_SpeechBalloon_NPC_Clue_C_ExecuteUbergraph_BP_SpeechBalloon_NPC_Clue::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");

// Function BP_SpeechBalloon_NPC_Clue.BP_SpeechBalloon_NPC_Clue_C.OnPositionCalibrated
// 0x0002 (0x0002 - 0x0000)
struct BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated final
{
public:
	bool                                          bCalibrated;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECalibratedEdgeType                           InEdgeType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated) == 0x000001, "Wrong alignment on BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated");
static_assert(sizeof(BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated) == 0x000002, "Wrong size on BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated, bCalibrated) == 0x000000, "Member 'BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated::bCalibrated' has a wrong offset!");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated, InEdgeType) == 0x000001, "Member 'BP_SpeechBalloon_NPC_Clue_C_OnPositionCalibrated::InEdgeType' has a wrong offset!");

// Function BP_SpeechBalloon_NPC_Clue.BP_SpeechBalloon_NPC_Clue_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_SpeechBalloon_NPC_Clue_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpeechBalloon_NPC_Clue_C_PreConstruct) == 0x000001, "Wrong alignment on BP_SpeechBalloon_NPC_Clue_C_PreConstruct");
static_assert(sizeof(BP_SpeechBalloon_NPC_Clue_C_PreConstruct) == 0x000001, "Wrong size on BP_SpeechBalloon_NPC_Clue_C_PreConstruct");
static_assert(offsetof(BP_SpeechBalloon_NPC_Clue_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_SpeechBalloon_NPC_Clue_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

