#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillTootip_Option

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SkillTootip_Option.BP_SkillTootip_Option_C.ExecuteUbergraph_BP_SkillTootip_Option
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option) == 0x000004, "Wrong alignment on BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option");
static_assert(sizeof(BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option) == 0x000008, "Wrong size on BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option");
static_assert(offsetof(BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option, EntryPoint) == 0x000000, "Member 'BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option, CallFunc_AddTextBinding_ReturnValue) == 0x000004, "Member 'BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option, CallFunc_AddTextBinding_ReturnValue_1) == 0x000005, "Member 'BP_SkillTootip_Option_C_ExecuteUbergraph_BP_SkillTootip_Option::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");

}

