#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Subtitle_Frame_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Subtitle_Frame_Lobby.BP_Subtitle_Frame_Lobby_C
// 0x0050 (0x14F0 - 0x14A0)
class UBP_Subtitle_Frame_Lobby_C final : public UTLUserWidgetSubtitle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SHOW_ANIM;                                         // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               ScriptBackGlow;                                    // 0x14B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TextSpeaker;                                       // 0x14B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TitleBackGlow;                                     // 0x14C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TitleLine;                                         // 0x14C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TitleLine_Glow;                                    // 0x14D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_1;                                       // 0x14D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Subtitle;                                      // 0x14E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Subtitle_Frame_Lobby(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Subtitle_Frame_Lobby_C">();
	}
	static class UBP_Subtitle_Frame_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Subtitle_Frame_Lobby_C>();
	}
};
static_assert(alignof(UBP_Subtitle_Frame_Lobby_C) == 0x000010, "Wrong alignment on UBP_Subtitle_Frame_Lobby_C");
static_assert(sizeof(UBP_Subtitle_Frame_Lobby_C) == 0x0014F0, "Wrong size on UBP_Subtitle_Frame_Lobby_C");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, UberGraphFrame) == 0x0014A0, "Member 'UBP_Subtitle_Frame_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, SHOW_ANIM) == 0x0014A8, "Member 'UBP_Subtitle_Frame_Lobby_C::SHOW_ANIM' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, ScriptBackGlow) == 0x0014B0, "Member 'UBP_Subtitle_Frame_Lobby_C::ScriptBackGlow' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, TextSpeaker) == 0x0014B8, "Member 'UBP_Subtitle_Frame_Lobby_C::TextSpeaker' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, TitleBackGlow) == 0x0014C0, "Member 'UBP_Subtitle_Frame_Lobby_C::TitleBackGlow' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, TitleLine) == 0x0014C8, "Member 'UBP_Subtitle_Frame_Lobby_C::TitleLine' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, TitleLine_Glow) == 0x0014D0, "Member 'UBP_Subtitle_Frame_Lobby_C::TitleLine_Glow' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, TLSizeBox_1) == 0x0014D8, "Member 'UBP_Subtitle_Frame_Lobby_C::TLSizeBox_1' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_Frame_Lobby_C, TXT_Subtitle) == 0x0014E0, "Member 'UBP_Subtitle_Frame_Lobby_C::TXT_Subtitle' has a wrong offset!");

}

