#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillUp_Tooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SkillUp_Tooltip.BP_SkillUp_Tooltip_C
// 0x0088 (0x0C10 - 0x0B88)
class UBP_SkillUp_Tooltip_C final : public UTLUserWidgetSkillSetLevelUpTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLTextBlock*                           AcquirablePoint_TXT;                               // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Skill_LevelupSetting_Slot_C*        BP_Skill_LevelupSetting_Slot_1;                    // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Skill_LevelupSetting_Slot_C*        BP_Skill_LevelupSetting_Slot_2;                    // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SkillUp_Tooltip_MiscList_C*         BP_SkillSetting_Upgrade_MiscList_1;                // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SkillUp_Tooltip_MiscList_C*         BP_SkillSetting_Upgrade_MiscList_2;                // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SkillUp_Tooltip_MiscList_C*         BP_SkillSetting_Upgrade_MiscList_3;                // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SkillUp_Tooltip_MiscList_C*         BP_SkillSetting_Upgrade_MiscList_4;                // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_TooltipPanel_Bg_C*                  BP_TooltipPanel_Bg;                                // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_Progress_C*                      BP_UI_SkillBookPointProgress;                      // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CurrentPoint_TXT;                                  // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RequiredPoint_TXT;                                 // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_PointName;                                     // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_Status;                                        // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        GoodTextBlockStyle;                                // 0x0BF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkillUp_Tooltip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnUpdateAcquirablePointText();
	void OnUpdateRequiredPointText();
	void OnUpdateCurrentPointText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillUp_Tooltip_C">();
	}
	static class UBP_SkillUp_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkillUp_Tooltip_C>();
	}
};
static_assert(alignof(UBP_SkillUp_Tooltip_C) == 0x000008, "Wrong alignment on UBP_SkillUp_Tooltip_C");
static_assert(sizeof(UBP_SkillUp_Tooltip_C) == 0x000C10, "Wrong size on UBP_SkillUp_Tooltip_C");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, UberGraphFrame) == 0x000B88, "Member 'UBP_SkillUp_Tooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, AcquirablePoint_TXT) == 0x000B90, "Member 'UBP_SkillUp_Tooltip_C::AcquirablePoint_TXT' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_Skill_LevelupSetting_Slot_1) == 0x000B98, "Member 'UBP_SkillUp_Tooltip_C::BP_Skill_LevelupSetting_Slot_1' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_Skill_LevelupSetting_Slot_2) == 0x000BA0, "Member 'UBP_SkillUp_Tooltip_C::BP_Skill_LevelupSetting_Slot_2' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_SkillSetting_Upgrade_MiscList_1) == 0x000BA8, "Member 'UBP_SkillUp_Tooltip_C::BP_SkillSetting_Upgrade_MiscList_1' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_SkillSetting_Upgrade_MiscList_2) == 0x000BB0, "Member 'UBP_SkillUp_Tooltip_C::BP_SkillSetting_Upgrade_MiscList_2' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_SkillSetting_Upgrade_MiscList_3) == 0x000BB8, "Member 'UBP_SkillUp_Tooltip_C::BP_SkillSetting_Upgrade_MiscList_3' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_SkillSetting_Upgrade_MiscList_4) == 0x000BC0, "Member 'UBP_SkillUp_Tooltip_C::BP_SkillSetting_Upgrade_MiscList_4' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_TooltipPanel_Bg) == 0x000BC8, "Member 'UBP_SkillUp_Tooltip_C::BP_TooltipPanel_Bg' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, BP_UI_SkillBookPointProgress) == 0x000BD0, "Member 'UBP_SkillUp_Tooltip_C::BP_UI_SkillBookPointProgress' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, CurrentPoint_TXT) == 0x000BD8, "Member 'UBP_SkillUp_Tooltip_C::CurrentPoint_TXT' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, RequiredPoint_TXT) == 0x000BE0, "Member 'UBP_SkillUp_Tooltip_C::RequiredPoint_TXT' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, TXT_PointName) == 0x000BE8, "Member 'UBP_SkillUp_Tooltip_C::TXT_PointName' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, TXT_Status) == 0x000BF0, "Member 'UBP_SkillUp_Tooltip_C::TXT_Status' has a wrong offset!");
static_assert(offsetof(UBP_SkillUp_Tooltip_C, GoodTextBlockStyle) == 0x000BF8, "Member 'UBP_SkillUp_Tooltip_C::GoodTextBlockStyle' has a wrong offset!");

}

