#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeTable_Icon_Tooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_TimeTable_Icon_Tooltip.BP_TimeTable_Icon_Tooltip_C
// 0x0030 (0x14D0 - 0x14A0)
class UBP_TimeTable_Icon_Tooltip_C final : public UTLUserWidgetTimeTableCommunalToolTip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_TooltipPanel_Bg_C*                  BP_TooltipPanel_Bg;                                // 0x14A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_1;                                 // 0x14B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_EventDescription;                              // 0x14B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_EventTitle;                                    // 0x14C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_GuildName;                                     // 0x14C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TimeTable_Icon_Tooltip(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TimeTable_Icon_Tooltip_C">();
	}
	static class UBP_TimeTable_Icon_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TimeTable_Icon_Tooltip_C>();
	}
};
static_assert(alignof(UBP_TimeTable_Icon_Tooltip_C) == 0x000010, "Wrong alignment on UBP_TimeTable_Icon_Tooltip_C");
static_assert(sizeof(UBP_TimeTable_Icon_Tooltip_C) == 0x0014D0, "Wrong size on UBP_TimeTable_Icon_Tooltip_C");
static_assert(offsetof(UBP_TimeTable_Icon_Tooltip_C, UberGraphFrame) == 0x0014A0, "Member 'UBP_TimeTable_Icon_Tooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TimeTable_Icon_Tooltip_C, BP_TooltipPanel_Bg) == 0x0014A8, "Member 'UBP_TimeTable_Icon_Tooltip_C::BP_TooltipPanel_Bg' has a wrong offset!");
static_assert(offsetof(UBP_TimeTable_Icon_Tooltip_C, TLHorizontalBox_1) == 0x0014B0, "Member 'UBP_TimeTable_Icon_Tooltip_C::TLHorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UBP_TimeTable_Icon_Tooltip_C, TXT_EventDescription) == 0x0014B8, "Member 'UBP_TimeTable_Icon_Tooltip_C::TXT_EventDescription' has a wrong offset!");
static_assert(offsetof(UBP_TimeTable_Icon_Tooltip_C, TXT_EventTitle) == 0x0014C0, "Member 'UBP_TimeTable_Icon_Tooltip_C::TXT_EventTitle' has a wrong offset!");
static_assert(offsetof(UBP_TimeTable_Icon_Tooltip_C, TXT_GuildName) == 0x0014C8, "Member 'UBP_TimeTable_Icon_Tooltip_C::TXT_GuildName' has a wrong offset!");

}

