#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Target_NameCard_ContextMenu_BTN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Target_NameCard_ContextMenu_BTN.BP_Target_NameCard_ContextMenu_BTN_C
// 0x0058 (0x1120 - 0x10C8)
class UBP_Target_NameCard_ContextMenu_BTN_C final : public UTLUserWidgetContextMenuBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Press;                                             // 0x10D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x10D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLOverlay*                             IconGorup;                                         // 0x10E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLProgressBar*                         LongPressBar;                                      // 0x10E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Reddot;                                            // 0x10F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x10F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_BTN_BACK_HOVER;                                // 0x1100(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_BTN_BACK_NOMAL;                                // 0x1108(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IconOn;                                            // 0x1110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1111[0x3];                                     // 0x1111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Width_Size;                                        // 0x1114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height_Size;                                       // 0x1118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Target_NameCard_ContextMenu_BTN(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Target_NameCard_ContextMenu_BTN_C">();
	}
	static class UBP_Target_NameCard_ContextMenu_BTN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Target_NameCard_ContextMenu_BTN_C>();
	}
};
static_assert(alignof(UBP_Target_NameCard_ContextMenu_BTN_C) == 0x000008, "Wrong alignment on UBP_Target_NameCard_ContextMenu_BTN_C");
static_assert(sizeof(UBP_Target_NameCard_ContextMenu_BTN_C) == 0x001120, "Wrong size on UBP_Target_NameCard_ContextMenu_BTN_C");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, UberGraphFrame) == 0x0010C8, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, Press) == 0x0010D0, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, Hover) == 0x0010D8, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, IconGorup) == 0x0010E0, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::IconGorup' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, LongPressBar) == 0x0010E8, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::LongPressBar' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, Reddot) == 0x0010F0, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::Reddot' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, SizeBox_0) == 0x0010F8, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, TEX_BTN_BACK_HOVER) == 0x001100, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::TEX_BTN_BACK_HOVER' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, TEX_BTN_BACK_NOMAL) == 0x001108, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::TEX_BTN_BACK_NOMAL' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, IconOn) == 0x001110, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::IconOn' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, Width_Size) == 0x001114, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::Width_Size' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ContextMenu_BTN_C, Height_Size) == 0x001118, "Member 'UBP_Target_NameCard_ContextMenu_BTN_C::Height_Size' has a wrong offset!");

}

