#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Target_NameCard_ConsoleProfile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Target_NameCard_ConsoleProfile.BP_Target_NameCard_ConsoleProfile_C
// 0x0040 (0x0F40 - 0x0F00)
class UBP_Target_NameCard_ConsoleProfile_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               BP_SIZE;                                           // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_RedDot_C*                        BP_UI_RedDot;                                      // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         BTNSIZE;                                           // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_COMMON_ICONBTN_HOVERLINE_L;                    // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Target_NameCard_ConsoleProfile(int32 EntryPoint);
	void OnUpdateNotification(bool InIsOn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Target_NameCard_ConsoleProfile_C">();
	}
	static class UBP_Target_NameCard_ConsoleProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Target_NameCard_ConsoleProfile_C>();
	}
};
static_assert(alignof(UBP_Target_NameCard_ConsoleProfile_C) == 0x000008, "Wrong alignment on UBP_Target_NameCard_ConsoleProfile_C");
static_assert(sizeof(UBP_Target_NameCard_ConsoleProfile_C) == 0x000F40, "Wrong size on UBP_Target_NameCard_ConsoleProfile_C");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, UberGraphFrame) == 0x000F00, "Member 'UBP_Target_NameCard_ConsoleProfile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, ShowAnim) == 0x000F08, "Member 'UBP_Target_NameCard_ConsoleProfile_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, Press) == 0x000F10, "Member 'UBP_Target_NameCard_ConsoleProfile_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, Hover) == 0x000F18, "Member 'UBP_Target_NameCard_ConsoleProfile_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, BP_SIZE) == 0x000F20, "Member 'UBP_Target_NameCard_ConsoleProfile_C::BP_SIZE' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, BP_UI_RedDot) == 0x000F28, "Member 'UBP_Target_NameCard_ConsoleProfile_C::BP_UI_RedDot' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, BTNSIZE) == 0x000F30, "Member 'UBP_Target_NameCard_ConsoleProfile_C::BTNSIZE' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_ConsoleProfile_C, TEX_COMMON_ICONBTN_HOVERLINE_L) == 0x000F38, "Member 'UBP_Target_NameCard_ConsoleProfile_C::TEX_COMMON_ICONBTN_HOVERLINE_L' has a wrong offset!");

}

