#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Target_NameCard_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Target_NameCard_Widget.BP_Target_NameCard_Widget_C.ExecuteUbergraph_BP_Target_NameCard_Widget
// 0x0070 (0x0070 - 0x0000)
struct BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddImageBrushBinding_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_2;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_3;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_4;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_5;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_6;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_7;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddVisibleBinding_ReturnValue_8;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_2;             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_3;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bActive;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInInteractable;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_4;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_5;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_6;             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget) == 0x000008, "Wrong alignment on BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget");
static_assert(sizeof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget) == 0x000070, "Wrong size on BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, EntryPoint) == 0x000000, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddImageBrushBinding_ReturnValue) == 0x000004, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddImageBrushBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue) == 0x000005, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_1) == 0x000006, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_2) == 0x000007, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_3) == 0x000008, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_4) == 0x000009, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_5) == 0x00000A, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddTextBinding_ReturnValue) == 0x00000B, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_6) == 0x00000C, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_SetVisible_self_CastInput) == 0x000010, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_7) == 0x000020, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddVisibleBinding_ReturnValue_8) == 0x000021, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddVisibleBinding_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddTextBinding_ReturnValue_1) == 0x000022, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddTextBinding_ReturnValue_2) == 0x000023, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddTextBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddTextBinding_ReturnValue_3) == 0x000024, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddTextBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_SetVisible_self_CastInput_1) == 0x000028, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, K2Node_Event_bActive) == 0x000038, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::K2Node_Event_bActive' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_SetVisible_self_CastInput_2) == 0x000040, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, K2Node_Event_bInInteractable) == 0x000050, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::K2Node_Event_bInInteractable' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_SetVisible_self_CastInput_3) == 0x000058, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddTextBinding_ReturnValue_4) == 0x000068, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddTextBinding_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddTextBinding_ReturnValue_5) == 0x000069, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddTextBinding_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget, CallFunc_AddTextBinding_ReturnValue_6) == 0x00006A, "Member 'BP_Target_NameCard_Widget_C_ExecuteUbergraph_BP_Target_NameCard_Widget::CallFunc_AddTextBinding_ReturnValue_6' has a wrong offset!");

// Function BP_Target_NameCard_Widget.BP_Target_NameCard_Widget_C.OnUpdateInteractable
// 0x0001 (0x0001 - 0x0000)
struct BP_Target_NameCard_Widget_C_OnUpdateInteractable final
{
public:
	bool                                          bInInteractable;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Target_NameCard_Widget_C_OnUpdateInteractable) == 0x000001, "Wrong alignment on BP_Target_NameCard_Widget_C_OnUpdateInteractable");
static_assert(sizeof(BP_Target_NameCard_Widget_C_OnUpdateInteractable) == 0x000001, "Wrong size on BP_Target_NameCard_Widget_C_OnUpdateInteractable");
static_assert(offsetof(BP_Target_NameCard_Widget_C_OnUpdateInteractable, bInInteractable) == 0x000000, "Member 'BP_Target_NameCard_Widget_C_OnUpdateInteractable::bInInteractable' has a wrong offset!");

// Function BP_Target_NameCard_Widget.BP_Target_NameCard_Widget_C.SetActiveServerInfo
// 0x0001 (0x0001 - 0x0000)
struct BP_Target_NameCard_Widget_C_SetActiveServerInfo final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Target_NameCard_Widget_C_SetActiveServerInfo) == 0x000001, "Wrong alignment on BP_Target_NameCard_Widget_C_SetActiveServerInfo");
static_assert(sizeof(BP_Target_NameCard_Widget_C_SetActiveServerInfo) == 0x000001, "Wrong size on BP_Target_NameCard_Widget_C_SetActiveServerInfo");
static_assert(offsetof(BP_Target_NameCard_Widget_C_SetActiveServerInfo, bActive) == 0x000000, "Member 'BP_Target_NameCard_Widget_C_SetActiveServerInfo::bActive' has a wrong offset!");

}

