#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tem_KeyIcon_BTN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Tem_KeyIcon_BTN.BP_Tem_KeyIcon_BTN_C
// 0x0068 (0x0F68 - 0x0F00)
class UBP_Tem_KeyIcon_BTN_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Release;                                           // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unhover;                                           // 0x0F20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               HUD_Console_TargetAimSelect_Concole_Key_Focus;     // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_96;                                       // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         BTN_Width;                                         // 0x0F40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BTN_Height;                                        // 0x0F44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        TextBlockStyle;                                    // 0x0F48(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Key_Focus_Texture;                                 // 0x0F60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Tem_KeyIcon_BTN(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Tem_KeyIcon_BTN_C">();
	}
	static class UBP_Tem_KeyIcon_BTN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Tem_KeyIcon_BTN_C>();
	}
};
static_assert(alignof(UBP_Tem_KeyIcon_BTN_C) == 0x000008, "Wrong alignment on UBP_Tem_KeyIcon_BTN_C");
static_assert(sizeof(UBP_Tem_KeyIcon_BTN_C) == 0x000F68, "Wrong size on UBP_Tem_KeyIcon_BTN_C");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, UberGraphFrame) == 0x000F00, "Member 'UBP_Tem_KeyIcon_BTN_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, Release) == 0x000F08, "Member 'UBP_Tem_KeyIcon_BTN_C::Release' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, ShowAnim) == 0x000F10, "Member 'UBP_Tem_KeyIcon_BTN_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, Press) == 0x000F18, "Member 'UBP_Tem_KeyIcon_BTN_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, Unhover) == 0x000F20, "Member 'UBP_Tem_KeyIcon_BTN_C::Unhover' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, Hover) == 0x000F28, "Member 'UBP_Tem_KeyIcon_BTN_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, HUD_Console_TargetAimSelect_Concole_Key_Focus) == 0x000F30, "Member 'UBP_Tem_KeyIcon_BTN_C::HUD_Console_TargetAimSelect_Concole_Key_Focus' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, TLSpacer_96) == 0x000F38, "Member 'UBP_Tem_KeyIcon_BTN_C::TLSpacer_96' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, BTN_Width) == 0x000F40, "Member 'UBP_Tem_KeyIcon_BTN_C::BTN_Width' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, BTN_Height) == 0x000F44, "Member 'UBP_Tem_KeyIcon_BTN_C::BTN_Height' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, TextBlockStyle) == 0x000F48, "Member 'UBP_Tem_KeyIcon_BTN_C::TextBlockStyle' has a wrong offset!");
static_assert(offsetof(UBP_Tem_KeyIcon_BTN_C, Key_Focus_Texture) == 0x000F60, "Member 'UBP_Tem_KeyIcon_BTN_C::Key_Focus_Texture' has a wrong offset!");

}

