#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tooltip_Codex_ACH_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Tooltip_Codex_ACH_Widget.BP_Tooltip_Codex_ACH_Widget_C
// 0x0018 (0x0AB0 - 0x0A98)
class UBP_Tooltip_Codex_ACH_Widget_C final : public UTLUserWidgetExploreCodeHintTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_TooltipPanel_Bg_C*                  BP_TooltipPanel_Bg;                                // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLDynamicEntryBox*                     TLDynamicEntryBox_113;                             // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Tooltip_Codex_ACH_Widget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Tooltip_Codex_ACH_Widget_C">();
	}
	static class UBP_Tooltip_Codex_ACH_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Tooltip_Codex_ACH_Widget_C>();
	}
};
static_assert(alignof(UBP_Tooltip_Codex_ACH_Widget_C) == 0x000008, "Wrong alignment on UBP_Tooltip_Codex_ACH_Widget_C");
static_assert(sizeof(UBP_Tooltip_Codex_ACH_Widget_C) == 0x000AB0, "Wrong size on UBP_Tooltip_Codex_ACH_Widget_C");
static_assert(offsetof(UBP_Tooltip_Codex_ACH_Widget_C, UberGraphFrame) == 0x000A98, "Member 'UBP_Tooltip_Codex_ACH_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Tooltip_Codex_ACH_Widget_C, BP_TooltipPanel_Bg) == 0x000AA0, "Member 'UBP_Tooltip_Codex_ACH_Widget_C::BP_TooltipPanel_Bg' has a wrong offset!");
static_assert(offsetof(UBP_Tooltip_Codex_ACH_Widget_C, TLDynamicEntryBox_113) == 0x000AA8, "Member 'UBP_Tooltip_Codex_ACH_Widget_C::TLDynamicEntryBox_113' has a wrong offset!");

}

