#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tem_KeyGuide_BTN

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Tem_KeyGuide_BTN.BP_Tem_KeyGuide_BTN_C.ExecuteUbergraph_BP_Tem_KeyGuide_BTN
// 0x0040 (0x0040 - 0x0000)
struct BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN) == 0x000008, "Wrong alignment on BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN");
static_assert(sizeof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN) == 0x000040, "Wrong size on BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN");
static_assert(offsetof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN, EntryPoint) == 0x000000, "Member 'BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN, K2Node_MakeStruct_Margin) == 0x000014, "Member 'BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN, K2Node_MakeStruct_Margin_1) == 0x000024, "Member 'BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000038, "Member 'BP_Tem_KeyGuide_BTN_C_ExecuteUbergraph_BP_Tem_KeyGuide_BTN::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");

// Function BP_Tem_KeyGuide_BTN.BP_Tem_KeyGuide_BTN_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Tem_KeyGuide_BTN_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tem_KeyGuide_BTN_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Tem_KeyGuide_BTN_C_PreConstruct");
static_assert(sizeof(BP_Tem_KeyGuide_BTN_C_PreConstruct) == 0x000001, "Wrong size on BP_Tem_KeyGuide_BTN_C_PreConstruct");
static_assert(offsetof(BP_Tem_KeyGuide_BTN_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Tem_KeyGuide_BTN_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

