#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Target_NameCard_RankingBTN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Target_NameCard_RankingBTN.BP_Target_NameCard_RankingBTN_C
// 0x0B30 (0x1A30 - 0x0F00)
class UBP_Target_NameCard_RankingBTN_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SHOW_ANIM;                                         // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLNamedSlot*                           B;                                                 // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             ButtonTextHolder;                                  // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           L;                                                 // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Reddot;                                            // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_BTN_BACK_HOVER;                                // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_BTN_BACK_NOMAL;                                // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_BTN_GOLDLINE_Hover;                            // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_BTN_GOLDLINE_NOMAL;                            // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_BTN_GOLDLINE_NOMAL_GLOW;                       // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBox_CenterDeco;                        // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBox_SideDeco;                          // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBoxLine_Hover;                         // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TLHorizontalBox_Keypadding;                        // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLImage_79;                                        // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_BTN_Size;                                 // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLUniformGridPanel*                    TLUniformGrid_Reddot;                              // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_RedDot_Count;                                  // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          VisibleKeyIcon;                                    // 0x0FA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA9[0x3];                                      // 0x0FA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Button___Purple1_Gold2;                            // 0x0FAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BTNWidth;                                          // 0x0FB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BTNHeight;                                         // 0x0FB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible_RedDot_Count;                              // 0x0FB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB9[0x7];                                      // 0x0FB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           In_Style_Blue_01;                                  // 0x0FC0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Purple_02;                                // 0x1238(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Red_03;                                   // 0x14B0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style;                                          // 0x1728(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPaperSprite*                           Sprite;                                            // 0x19A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            In_Brush;                                          // 0x19A8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Target_NameCard_RankingBTN(int32 EntryPoint);
	void OnUpdateNotification(bool InIsOn);
	void PreConstruct(bool IsDesignTime);
	void Gold();
	void Purple();
	void Set_Button_Color_Type(int32 ButtonColorType);
	void Red();
	void Hexagon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Target_NameCard_RankingBTN_C">();
	}
	static class UBP_Target_NameCard_RankingBTN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Target_NameCard_RankingBTN_C>();
	}
};
static_assert(alignof(UBP_Target_NameCard_RankingBTN_C) == 0x000008, "Wrong alignment on UBP_Target_NameCard_RankingBTN_C");
static_assert(sizeof(UBP_Target_NameCard_RankingBTN_C) == 0x001A30, "Wrong size on UBP_Target_NameCard_RankingBTN_C");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, UberGraphFrame) == 0x000F00, "Member 'UBP_Target_NameCard_RankingBTN_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, SHOW_ANIM) == 0x000F08, "Member 'UBP_Target_NameCard_RankingBTN_C::SHOW_ANIM' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Hover) == 0x000F10, "Member 'UBP_Target_NameCard_RankingBTN_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Press) == 0x000F18, "Member 'UBP_Target_NameCard_RankingBTN_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, B) == 0x000F20, "Member 'UBP_Target_NameCard_RankingBTN_C::B' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, ButtonTextHolder) == 0x000F28, "Member 'UBP_Target_NameCard_RankingBTN_C::ButtonTextHolder' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, L) == 0x000F30, "Member 'UBP_Target_NameCard_RankingBTN_C::L' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Reddot) == 0x000F38, "Member 'UBP_Target_NameCard_RankingBTN_C::Reddot' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TEX_BTN_BACK_HOVER) == 0x000F40, "Member 'UBP_Target_NameCard_RankingBTN_C::TEX_BTN_BACK_HOVER' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TEX_BTN_BACK_NOMAL) == 0x000F48, "Member 'UBP_Target_NameCard_RankingBTN_C::TEX_BTN_BACK_NOMAL' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TEX_BTN_GOLDLINE_Hover) == 0x000F50, "Member 'UBP_Target_NameCard_RankingBTN_C::TEX_BTN_GOLDLINE_Hover' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TEX_BTN_GOLDLINE_NOMAL) == 0x000F58, "Member 'UBP_Target_NameCard_RankingBTN_C::TEX_BTN_GOLDLINE_NOMAL' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TEX_BTN_GOLDLINE_NOMAL_GLOW) == 0x000F60, "Member 'UBP_Target_NameCard_RankingBTN_C::TEX_BTN_GOLDLINE_NOMAL_GLOW' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Tex_BTN_TextBox_CenterDeco) == 0x000F68, "Member 'UBP_Target_NameCard_RankingBTN_C::Tex_BTN_TextBox_CenterDeco' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Tex_BTN_TextBox_SideDeco) == 0x000F70, "Member 'UBP_Target_NameCard_RankingBTN_C::Tex_BTN_TextBox_SideDeco' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Tex_BTN_TextBoxLine_Hover) == 0x000F78, "Member 'UBP_Target_NameCard_RankingBTN_C::Tex_BTN_TextBoxLine_Hover' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TLHorizontalBox_Keypadding) == 0x000F80, "Member 'UBP_Target_NameCard_RankingBTN_C::TLHorizontalBox_Keypadding' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TLImage_79) == 0x000F88, "Member 'UBP_Target_NameCard_RankingBTN_C::TLImage_79' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TLSpacer_BTN_Size) == 0x000F90, "Member 'UBP_Target_NameCard_RankingBTN_C::TLSpacer_BTN_Size' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TLUniformGrid_Reddot) == 0x000F98, "Member 'UBP_Target_NameCard_RankingBTN_C::TLUniformGrid_Reddot' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, TXT_RedDot_Count) == 0x000FA0, "Member 'UBP_Target_NameCard_RankingBTN_C::TXT_RedDot_Count' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, VisibleKeyIcon) == 0x000FA8, "Member 'UBP_Target_NameCard_RankingBTN_C::VisibleKeyIcon' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Button___Purple1_Gold2) == 0x000FAC, "Member 'UBP_Target_NameCard_RankingBTN_C::Button___Purple1_Gold2' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, BTNWidth) == 0x000FB0, "Member 'UBP_Target_NameCard_RankingBTN_C::BTNWidth' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, BTNHeight) == 0x000FB4, "Member 'UBP_Target_NameCard_RankingBTN_C::BTNHeight' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Visible_RedDot_Count) == 0x000FB8, "Member 'UBP_Target_NameCard_RankingBTN_C::Visible_RedDot_Count' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, In_Style_Blue_01) == 0x000FC0, "Member 'UBP_Target_NameCard_RankingBTN_C::In_Style_Blue_01' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, In_Style_Purple_02) == 0x001238, "Member 'UBP_Target_NameCard_RankingBTN_C::In_Style_Purple_02' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, In_Style_Red_03) == 0x0014B0, "Member 'UBP_Target_NameCard_RankingBTN_C::In_Style_Red_03' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, In_Style) == 0x001728, "Member 'UBP_Target_NameCard_RankingBTN_C::In_Style' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, Sprite) == 0x0019A0, "Member 'UBP_Target_NameCard_RankingBTN_C::Sprite' has a wrong offset!");
static_assert(offsetof(UBP_Target_NameCard_RankingBTN_C, In_Brush) == 0x0019A8, "Member 'UBP_Target_NameCard_RankingBTN_C::In_Brush' has a wrong offset!");

}

