#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tooltip_Codex_ACH_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Tooltip_Codex_ACH_List.BP_Tooltip_Codex_ACH_List_C
// 0x0020 (0x0AC0 - 0x0AA0)
class UBP_Tooltip_Codex_ACH_List_C final : public UTLUserWidgetExploreObjectiveHint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLSpacer*                              TLSpacer_Division;                                 // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_1;                                     // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TLTextBlock_31;                                    // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Tooltip_Codex_ACH_List(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Tooltip_Codex_ACH_List_C">();
	}
	static class UBP_Tooltip_Codex_ACH_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Tooltip_Codex_ACH_List_C>();
	}
};
static_assert(alignof(UBP_Tooltip_Codex_ACH_List_C) == 0x000008, "Wrong alignment on UBP_Tooltip_Codex_ACH_List_C");
static_assert(sizeof(UBP_Tooltip_Codex_ACH_List_C) == 0x000AC0, "Wrong size on UBP_Tooltip_Codex_ACH_List_C");
static_assert(offsetof(UBP_Tooltip_Codex_ACH_List_C, UberGraphFrame) == 0x000AA0, "Member 'UBP_Tooltip_Codex_ACH_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Tooltip_Codex_ACH_List_C, TLSpacer_Division) == 0x000AA8, "Member 'UBP_Tooltip_Codex_ACH_List_C::TLSpacer_Division' has a wrong offset!");
static_assert(offsetof(UBP_Tooltip_Codex_ACH_List_C, TLTextBlock_1) == 0x000AB0, "Member 'UBP_Tooltip_Codex_ACH_List_C::TLTextBlock_1' has a wrong offset!");
static_assert(offsetof(UBP_Tooltip_Codex_ACH_List_C, TLTextBlock_31) == 0x000AB8, "Member 'UBP_Tooltip_Codex_ACH_List_C::TLTextBlock_31' has a wrong offset!");

}

