#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Target_NameCard_RankingBTN

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Target_NameCard_RankingBTN.BP_Target_NameCard_RankingBTN_C.ExecuteUbergraph_BP_Target_NameCard_RankingBTN
// 0x0058 (0x0058 - 0x0000)
struct BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InIsOn;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN) == 0x000008, "Wrong alignment on BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN");
static_assert(sizeof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN) == 0x000058, "Wrong size on BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, EntryPoint) == 0x000000, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, K2Node_Event_InIsOn) == 0x000019, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::K2Node_Event_InIsOn' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, CallFunc_ShowWithValue_self_CastInput) == 0x000030, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, CallFunc_SetVisible_self_CastInput_1) == 0x000040, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000050, "Member 'BP_Target_NameCard_RankingBTN_C_ExecuteUbergraph_BP_Target_NameCard_RankingBTN::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function BP_Target_NameCard_RankingBTN.BP_Target_NameCard_RankingBTN_C.OnUpdateNotification
// 0x0001 (0x0001 - 0x0000)
struct BP_Target_NameCard_RankingBTN_C_OnUpdateNotification final
{
public:
	bool                                          InIsOn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Target_NameCard_RankingBTN_C_OnUpdateNotification) == 0x000001, "Wrong alignment on BP_Target_NameCard_RankingBTN_C_OnUpdateNotification");
static_assert(sizeof(BP_Target_NameCard_RankingBTN_C_OnUpdateNotification) == 0x000001, "Wrong size on BP_Target_NameCard_RankingBTN_C_OnUpdateNotification");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_OnUpdateNotification, InIsOn) == 0x000000, "Member 'BP_Target_NameCard_RankingBTN_C_OnUpdateNotification::InIsOn' has a wrong offset!");

// Function BP_Target_NameCard_RankingBTN.BP_Target_NameCard_RankingBTN_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Target_NameCard_RankingBTN_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Target_NameCard_RankingBTN_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Target_NameCard_RankingBTN_C_PreConstruct");
static_assert(sizeof(BP_Target_NameCard_RankingBTN_C_PreConstruct) == 0x000001, "Wrong size on BP_Target_NameCard_RankingBTN_C_PreConstruct");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Target_NameCard_RankingBTN_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Target_NameCard_RankingBTN.BP_Target_NameCard_RankingBTN_C.Set Button Color Type
// 0x0008 (0x0008 - 0x0000)
struct BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type final
{
public:
	int32                                         ButtonColorType;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type) == 0x000004, "Wrong alignment on BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type");
static_assert(sizeof(BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type) == 0x000008, "Wrong size on BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type, ButtonColorType) == 0x000000, "Member 'BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type::ButtonColorType' has a wrong offset!");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BP_Target_NameCard_RankingBTN_C_Set_Button_Color_Type::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_Target_NameCard_RankingBTN.BP_Target_NameCard_RankingBTN_C.Hexagon
// 0x0010 (0x0010 - 0x0000)
struct BP_Target_NameCard_RankingBTN_C_Hexagon final
{
public:
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Target_NameCard_RankingBTN_C_Hexagon) == 0x000008, "Wrong alignment on BP_Target_NameCard_RankingBTN_C_Hexagon");
static_assert(sizeof(BP_Target_NameCard_RankingBTN_C_Hexagon) == 0x000010, "Wrong size on BP_Target_NameCard_RankingBTN_C_Hexagon");
static_assert(offsetof(BP_Target_NameCard_RankingBTN_C_Hexagon, CallFunc_SetVisible_self_CastInput) == 0x000000, "Member 'BP_Target_NameCard_RankingBTN_C_Hexagon::CallFunc_SetVisible_self_CastInput' has a wrong offset!");

}

