#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TargetAim_Mark

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TargetAim_Mark.BP_TargetAim_Mark_C.ExecuteUbergraph_BP_TargetAim_Mark
// 0x0028 (0x0028 - 0x0000)
struct BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationReverseInUserWidget_ReturnValue; // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOnUpdateDefault_ReturnValue_1;         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationForwardInUserWidget_ReturnValue; // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark) == 0x000004, "Wrong alignment on BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark");
static_assert(sizeof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark) == 0x000028, "Wrong size on BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark");
static_assert(offsetof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark, EntryPoint) == 0x000000, "Member 'BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark, CallFunc_SetOnUpdateDefault_ReturnValue) == 0x000024, "Member 'BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark::CallFunc_SetOnUpdateDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark, CallFunc_PlayAnimationReverseInUserWidget_ReturnValue) == 0x000025, "Member 'BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark::CallFunc_PlayAnimationReverseInUserWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark, CallFunc_SetOnUpdateDefault_ReturnValue_1) == 0x000026, "Member 'BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark::CallFunc_SetOnUpdateDefault_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark, CallFunc_PlayAnimationForwardInUserWidget_ReturnValue) == 0x000027, "Member 'BP_TargetAim_Mark_C_ExecuteUbergraph_BP_TargetAim_Mark::CallFunc_PlayAnimationForwardInUserWidget_ReturnValue' has a wrong offset!");

}

