#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeTable_Icon_Tooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TimeTable_Icon_Tooltip.BP_TimeTable_Icon_Tooltip_C.ExecuteUbergraph_BP_TimeTable_Icon_Tooltip
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTextBinding_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddTextBinding_ReturnValue_1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip) == 0x000004, "Wrong alignment on BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip");
static_assert(sizeof(BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip) == 0x000008, "Wrong size on BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip");
static_assert(offsetof(BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip, EntryPoint) == 0x000000, "Member 'BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip, CallFunc_AddTextBinding_ReturnValue) == 0x000004, "Member 'BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip::CallFunc_AddTextBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip, CallFunc_AddTextBinding_ReturnValue_1) == 0x000005, "Member 'BP_TimeTable_Icon_Tooltip_C_ExecuteUbergraph_BP_TimeTable_Icon_Tooltip::CallFunc_AddTextBinding_ReturnValue_1' has a wrong offset!");

}

