#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_GuildName_WithEmblem_Widget

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_GuildName_WithEmblem_Widget.BP_UI_GuildName_WithEmblem_Widget_C.ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget
// 0x0070 (0x0070 - 0x0000)
struct BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 CallFunc_GetUIPlatform_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0030(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget) == 0x000008, "Wrong alignment on BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget");
static_assert(sizeof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget) == 0x000070, "Wrong size on BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, EntryPoint) == 0x000000, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_GetUIPlatform_ReturnValue) == 0x000004, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_GetUIPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_GetText_ReturnValue_1) == 0x000030, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_Len_ReturnValue) == 0x000048, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000050, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_Len_ReturnValue_1) == 0x000064, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget, K2Node_Event_IsDesignTime) == 0x000069, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_ExecuteUbergraph_BP_UI_GuildName_WithEmblem_Widget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BP_UI_GuildName_WithEmblem_Widget.BP_UI_GuildName_WithEmblem_Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_GuildName_WithEmblem_Widget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_GuildName_WithEmblem_Widget_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UI_GuildName_WithEmblem_Widget_C_PreConstruct");
static_assert(sizeof(BP_UI_GuildName_WithEmblem_Widget_C_PreConstruct) == 0x000001, "Wrong size on BP_UI_GuildName_WithEmblem_Widget_C_PreConstruct");
static_assert(offsetof(BP_UI_GuildName_WithEmblem_Widget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UI_GuildName_WithEmblem_Widget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

