#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_ItemSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_ItemSlot.BP_UI_ItemSlot_C
// 0x00C0 (0x14F0 - 0x1430)
class UBP_UI_ItemSlot_C final : public UTLUserWidgetFrame
{
public:
	uint8                                         Pad_1428[0x8];                                     // 0x1428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLBorder*                              Bind_Visible;                                      // 0x1438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Collection;                                        // 0x1440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Condition_Collection;                              // 0x1448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           Count;                                             // 0x1450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       EquipItem_Set;                                     // 0x1458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ICO_Cooking;                                       // 0x1460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ICO_DungeonPointItem;                              // 0x1468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ICO_EquipItem;                                     // 0x1470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ICO_OtherPreset;                                   // 0x1478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ICO_SkilItem;                                      // 0x1480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Icon_Bind;                                         // 0x1488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IMG_Dimmed;                                        // 0x1490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemGrade;                                         // 0x1498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               ItemIcon;                                          // 0x14A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              ItemLearnedSkill;                                  // 0x14A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             LevelPoint;                                        // 0x14B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               SlotLock;                                          // 0x14B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              TLGradeBorder;                                     // 0x14C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TLGradeLine;                                       // 0x14C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXTUpgrade;                                        // 0x14D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              Visible_border;                                    // 0x14D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               WhiteLine;                                         // 0x14E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_ItemSlot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_ItemSlot_C">();
	}
	static class UBP_UI_ItemSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_ItemSlot_C>();
	}
};
static_assert(alignof(UBP_UI_ItemSlot_C) == 0x000010, "Wrong alignment on UBP_UI_ItemSlot_C");
static_assert(sizeof(UBP_UI_ItemSlot_C) == 0x0014F0, "Wrong size on UBP_UI_ItemSlot_C");
static_assert(offsetof(UBP_UI_ItemSlot_C, UberGraphFrame) == 0x001430, "Member 'UBP_UI_ItemSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, Bind_Visible) == 0x001438, "Member 'UBP_UI_ItemSlot_C::Bind_Visible' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, Collection) == 0x001440, "Member 'UBP_UI_ItemSlot_C::Collection' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, Condition_Collection) == 0x001448, "Member 'UBP_UI_ItemSlot_C::Condition_Collection' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, Count) == 0x001450, "Member 'UBP_UI_ItemSlot_C::Count' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, EquipItem_Set) == 0x001458, "Member 'UBP_UI_ItemSlot_C::EquipItem_Set' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ICO_Cooking) == 0x001460, "Member 'UBP_UI_ItemSlot_C::ICO_Cooking' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ICO_DungeonPointItem) == 0x001468, "Member 'UBP_UI_ItemSlot_C::ICO_DungeonPointItem' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ICO_EquipItem) == 0x001470, "Member 'UBP_UI_ItemSlot_C::ICO_EquipItem' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ICO_OtherPreset) == 0x001478, "Member 'UBP_UI_ItemSlot_C::ICO_OtherPreset' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ICO_SkilItem) == 0x001480, "Member 'UBP_UI_ItemSlot_C::ICO_SkilItem' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, Icon_Bind) == 0x001488, "Member 'UBP_UI_ItemSlot_C::Icon_Bind' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, IMG_Dimmed) == 0x001490, "Member 'UBP_UI_ItemSlot_C::IMG_Dimmed' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ItemGrade) == 0x001498, "Member 'UBP_UI_ItemSlot_C::ItemGrade' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ItemIcon) == 0x0014A0, "Member 'UBP_UI_ItemSlot_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, ItemLearnedSkill) == 0x0014A8, "Member 'UBP_UI_ItemSlot_C::ItemLearnedSkill' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, LevelPoint) == 0x0014B0, "Member 'UBP_UI_ItemSlot_C::LevelPoint' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, SlotLock) == 0x0014B8, "Member 'UBP_UI_ItemSlot_C::SlotLock' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, TLGradeBorder) == 0x0014C0, "Member 'UBP_UI_ItemSlot_C::TLGradeBorder' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, TLGradeLine) == 0x0014C8, "Member 'UBP_UI_ItemSlot_C::TLGradeLine' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, TXTUpgrade) == 0x0014D0, "Member 'UBP_UI_ItemSlot_C::TXTUpgrade' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, Visible_border) == 0x0014D8, "Member 'UBP_UI_ItemSlot_C::Visible_border' has a wrong offset!");
static_assert(offsetof(UBP_UI_ItemSlot_C, WhiteLine) == 0x0014E0, "Member 'UBP_UI_ItemSlot_C::WhiteLine' has a wrong offset!");

}

