#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_Toggle_IconBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_BTN_Toggle_IconBox.BP_UI_BTN_Toggle_IconBox_C
// 0x0D08 (0x1D00 - 0x0FF8)
class UBP_UI_BTN_Toggle_IconBox_C final : public UTLUserWidgetCheckButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focus;                                             // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnCheck;                                           // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Check;                                             // 0x1010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               BP_SIZE;                                           // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         BTNSIZE;                                           // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               RedDot_Inventory;                                  // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           RedDot_Num;                                        // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_COMMON_ICONBTN_FOCUS;                          // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               TEX_COMMON_ICONBTN_HOVERLINE_L;                    // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLUniformGridPanel*                    TLUniformGridPanel_Red;                            // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         IconSize;                                          // 0x1060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconBoxSize;                                       // 0x1064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ICON_OFFSET;                                       // 0x1068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Hoverline_Offset;                                  // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BP_PANEL_SIZE;                                     // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_PANELSIZE_ONOFF;                                // 0x1080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          BackIMG_TYPE_SET;                                  // 0x1081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1082[0x2];                                     // 0x1082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Two_Gold;                                          // 0x1084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           In_Style_NoneFrame;                                // 0x1088(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Blue;                                     // 0x1300(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Purple;                                   // 0x1578(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Red;                                      // 0x17F0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_NoneLineFace;                             // 0x1A68(0x0278)(Edit, BlueprintVisible)
	bool                                          HoverOff;                                          // 0x1CE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Texton;                                            // 0x1CE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE2[0x6];                                     // 0x1CE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        Path_HoverTexture;                                 // 0x1CE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_BTN_Toggle_IconBox(int32 EntryPoint);
	void OnUpdateNotification(bool InIsOn);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_BTN_Toggle_IconBox_C">();
	}
	static class UBP_UI_BTN_Toggle_IconBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_BTN_Toggle_IconBox_C>();
	}
};
static_assert(alignof(UBP_UI_BTN_Toggle_IconBox_C) == 0x000008, "Wrong alignment on UBP_UI_BTN_Toggle_IconBox_C");
static_assert(sizeof(UBP_UI_BTN_Toggle_IconBox_C) == 0x001D00, "Wrong size on UBP_UI_BTN_Toggle_IconBox_C");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, UberGraphFrame) == 0x000FF8, "Member 'UBP_UI_BTN_Toggle_IconBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Focus) == 0x001000, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Focus' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, UnCheck) == 0x001008, "Member 'UBP_UI_BTN_Toggle_IconBox_C::UnCheck' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Check) == 0x001010, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Check' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Press) == 0x001018, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Hover) == 0x001020, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, BP_SIZE) == 0x001028, "Member 'UBP_UI_BTN_Toggle_IconBox_C::BP_SIZE' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, BTNSIZE) == 0x001030, "Member 'UBP_UI_BTN_Toggle_IconBox_C::BTNSIZE' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, RedDot_Inventory) == 0x001038, "Member 'UBP_UI_BTN_Toggle_IconBox_C::RedDot_Inventory' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, RedDot_Num) == 0x001040, "Member 'UBP_UI_BTN_Toggle_IconBox_C::RedDot_Num' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, TEX_COMMON_ICONBTN_FOCUS) == 0x001048, "Member 'UBP_UI_BTN_Toggle_IconBox_C::TEX_COMMON_ICONBTN_FOCUS' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, TEX_COMMON_ICONBTN_HOVERLINE_L) == 0x001050, "Member 'UBP_UI_BTN_Toggle_IconBox_C::TEX_COMMON_ICONBTN_HOVERLINE_L' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, TLUniformGridPanel_Red) == 0x001058, "Member 'UBP_UI_BTN_Toggle_IconBox_C::TLUniformGridPanel_Red' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, IconSize) == 0x001060, "Member 'UBP_UI_BTN_Toggle_IconBox_C::IconSize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, IconBoxSize) == 0x001064, "Member 'UBP_UI_BTN_Toggle_IconBox_C::IconBoxSize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, ICON_OFFSET) == 0x001068, "Member 'UBP_UI_BTN_Toggle_IconBox_C::ICON_OFFSET' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Hoverline_Offset) == 0x001070, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Hoverline_Offset' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, BP_PANEL_SIZE) == 0x001078, "Member 'UBP_UI_BTN_Toggle_IconBox_C::BP_PANEL_SIZE' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, BP_PANELSIZE_ONOFF) == 0x001080, "Member 'UBP_UI_BTN_Toggle_IconBox_C::BP_PANELSIZE_ONOFF' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, BackIMG_TYPE_SET) == 0x001081, "Member 'UBP_UI_BTN_Toggle_IconBox_C::BackIMG_TYPE_SET' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Two_Gold) == 0x001084, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Two_Gold' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, In_Style_NoneFrame) == 0x001088, "Member 'UBP_UI_BTN_Toggle_IconBox_C::In_Style_NoneFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, In_Style_Blue) == 0x001300, "Member 'UBP_UI_BTN_Toggle_IconBox_C::In_Style_Blue' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, In_Style_Purple) == 0x001578, "Member 'UBP_UI_BTN_Toggle_IconBox_C::In_Style_Purple' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, In_Style_Red) == 0x0017F0, "Member 'UBP_UI_BTN_Toggle_IconBox_C::In_Style_Red' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, In_Style_NoneLineFace) == 0x001A68, "Member 'UBP_UI_BTN_Toggle_IconBox_C::In_Style_NoneLineFace' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, HoverOff) == 0x001CE0, "Member 'UBP_UI_BTN_Toggle_IconBox_C::HoverOff' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Texton) == 0x001CE1, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Texton' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_Toggle_IconBox_C, Path_HoverTexture) == 0x001CE8, "Member 'UBP_UI_BTN_Toggle_IconBox_C::Path_HoverTexture' has a wrong offset!");

}

