#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_IconBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_BTN_IconBox.BP_UI_BTN_IconBox_C.ExecuteUbergraph_BP_UI_BTN_IconBox
// 0x00D0 (0x00D0 - 0x0000)
struct BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsOn;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox) == 0x000008, "Wrong alignment on BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox");
static_assert(sizeof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox) == 0x0000D0, "Wrong size on BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, EntryPoint) == 0x000000, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_MakeStruct_Margin) == 0x000004, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_BreakVector2D_X) == 0x000014, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_MakeStruct_Margin_1) == 0x00001C, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_BreakVector2D_X_1) == 0x00002C, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_BreakVector2D_Y_1) == 0x000030, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_MakeStruct_Margin_2) == 0x000034, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000048, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000050, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_Event_InIsOn) == 0x000058, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_Event_InIsOn' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_SetVisible_self_CastInput) == 0x000060, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_MakeStruct_Margin_3) == 0x000070, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_Event_IsDesignTime) == 0x000080, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000088, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000090, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000098, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_BreakVector2D_X_2) == 0x0000A0, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_BreakVector2D_Y_2) == 0x0000A4, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_MakeStruct_Margin_4) == 0x0000A8, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, K2Node_SwitchInteger_CmpSuccess) == 0x0000B8, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_Not_PreBool_ReturnValue) == 0x0000B9, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox, CallFunc_SetVisible_self_CastInput_1) == 0x0000C0, "Member 'BP_UI_BTN_IconBox_C_ExecuteUbergraph_BP_UI_BTN_IconBox::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");

// Function BP_UI_BTN_IconBox.BP_UI_BTN_IconBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_BTN_IconBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_IconBox_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UI_BTN_IconBox_C_PreConstruct");
static_assert(sizeof(BP_UI_BTN_IconBox_C_PreConstruct) == 0x000001, "Wrong size on BP_UI_BTN_IconBox_C_PreConstruct");
static_assert(offsetof(BP_UI_BTN_IconBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UI_BTN_IconBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_UI_BTN_IconBox.BP_UI_BTN_IconBox_C.OnUpdateNotification
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_BTN_IconBox_C_OnUpdateNotification final
{
public:
	bool                                          InIsOn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_IconBox_C_OnUpdateNotification) == 0x000001, "Wrong alignment on BP_UI_BTN_IconBox_C_OnUpdateNotification");
static_assert(sizeof(BP_UI_BTN_IconBox_C_OnUpdateNotification) == 0x000001, "Wrong size on BP_UI_BTN_IconBox_C_OnUpdateNotification");
static_assert(offsetof(BP_UI_BTN_IconBox_C_OnUpdateNotification, InIsOn) == 0x000000, "Member 'BP_UI_BTN_IconBox_C_OnUpdateNotification::InIsOn' has a wrong offset!");

}

