#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_PacketReplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_BTN_PacketReplay.BP_UI_BTN_PacketReplay_C
// 0x07E0 (0x16E0 - 0x0F00)
class UBP_UI_BTN_PacketReplay_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAinm;                                          // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unhover;                                           // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               Reddot;                                            // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBox_CenterDeco;                        // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBoxLine_Hover;                         // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_BTN_Size;                                 // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLUniformGridPanel*                    TLUniformGrid_Reddot;                              // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_RedDot_Count;                                  // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         BTN_Width;                                         // 0x0F58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BTN_Height;                                        // 0x0F5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisibleKeyIcon;                                    // 0x0F60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F61[0x3];                                      // 0x0F61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Button___Purple1_Gray2_Red3;                       // 0x0F64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeOn_SmallOFF;                                  // 0x0F68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Visible_RedDot_Count;                              // 0x0F69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6A[0x6];                                      // 0x0F6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           In_Style_Blue_01;                                  // 0x0F70(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Red_03;                                   // 0x11E8(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Purple_02;                                // 0x1460(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Charinfo_Visible;                                  // 0x16D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_UI_BTN_PacketReplay(int32 EntryPoint);
	void OnUpdateNotification(bool InIsOn);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Large();
	void Small();
	void Gold();
	void Purple();
	void Red();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_BTN_PacketReplay_C">();
	}
	static class UBP_UI_BTN_PacketReplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_BTN_PacketReplay_C>();
	}
};
static_assert(alignof(UBP_UI_BTN_PacketReplay_C) == 0x000008, "Wrong alignment on UBP_UI_BTN_PacketReplay_C");
static_assert(sizeof(UBP_UI_BTN_PacketReplay_C) == 0x0016E0, "Wrong size on UBP_UI_BTN_PacketReplay_C");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, UberGraphFrame) == 0x000F00, "Member 'UBP_UI_BTN_PacketReplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, ShowAinm) == 0x000F08, "Member 'UBP_UI_BTN_PacketReplay_C::ShowAinm' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Unhover) == 0x000F10, "Member 'UBP_UI_BTN_PacketReplay_C::Unhover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Press) == 0x000F18, "Member 'UBP_UI_BTN_PacketReplay_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Hover) == 0x000F20, "Member 'UBP_UI_BTN_PacketReplay_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Reddot) == 0x000F28, "Member 'UBP_UI_BTN_PacketReplay_C::Reddot' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Tex_BTN_TextBox_CenterDeco) == 0x000F30, "Member 'UBP_UI_BTN_PacketReplay_C::Tex_BTN_TextBox_CenterDeco' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Tex_BTN_TextBoxLine_Hover) == 0x000F38, "Member 'UBP_UI_BTN_PacketReplay_C::Tex_BTN_TextBoxLine_Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, TLSpacer_BTN_Size) == 0x000F40, "Member 'UBP_UI_BTN_PacketReplay_C::TLSpacer_BTN_Size' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, TLUniformGrid_Reddot) == 0x000F48, "Member 'UBP_UI_BTN_PacketReplay_C::TLUniformGrid_Reddot' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, TXT_RedDot_Count) == 0x000F50, "Member 'UBP_UI_BTN_PacketReplay_C::TXT_RedDot_Count' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, BTN_Width) == 0x000F58, "Member 'UBP_UI_BTN_PacketReplay_C::BTN_Width' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, BTN_Height) == 0x000F5C, "Member 'UBP_UI_BTN_PacketReplay_C::BTN_Height' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, VisibleKeyIcon) == 0x000F60, "Member 'UBP_UI_BTN_PacketReplay_C::VisibleKeyIcon' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Button___Purple1_Gray2_Red3) == 0x000F64, "Member 'UBP_UI_BTN_PacketReplay_C::Button___Purple1_Gray2_Red3' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, LargeOn_SmallOFF) == 0x000F68, "Member 'UBP_UI_BTN_PacketReplay_C::LargeOn_SmallOFF' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Visible_RedDot_Count) == 0x000F69, "Member 'UBP_UI_BTN_PacketReplay_C::Visible_RedDot_Count' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, In_Style_Blue_01) == 0x000F70, "Member 'UBP_UI_BTN_PacketReplay_C::In_Style_Blue_01' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, In_Style_Red_03) == 0x0011E8, "Member 'UBP_UI_BTN_PacketReplay_C::In_Style_Red_03' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, In_Style_Purple_02) == 0x001460, "Member 'UBP_UI_BTN_PacketReplay_C::In_Style_Purple_02' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PacketReplay_C, Charinfo_Visible) == 0x0016D8, "Member 'UBP_UI_BTN_PacketReplay_C::Charinfo_Visible' has a wrong offset!");

}

