#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_IconTextBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_BTN_IconTextBox.BP_UI_BTN_IconTextBox_C
// 0x0D00 (0x1C00 - 0x0F00)
class UBP_UI_BTN_IconTextBox_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Press;                                             // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               BP_Min_SIZE;                                       // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_RedDot_C*                        BP_UI_RedDot;                                      // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         IconOffset;                                        // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               IconSize;                                          // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBox_CenterDeco;                        // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBox_SideDeco;                          // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TextSize;                                          // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_L;                                        // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_R;                                        // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              BP_PANEL_SIZE;                                     // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ICON_SIZE;                                         // 0x0F68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ICON_OFFSET;                                       // 0x0F6C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TextShow;                                          // 0x0F74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IconShow;                                          // 0x0F75(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F76[0x2];                                      // 0x0F76(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Right_3;                                           // 0x0F78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BackIMG_TYPE_SET;                                  // 0x0F7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F7D[0x3];                                      // 0x0F7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Two_Gold;                                          // 0x0F80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F84[0x4];                                      // 0x0F84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           In_Style_NoneFrame;                                // 0x0F88(0x0278)(Edit, BlueprintVisible)
	struct FButtonStyle                           In_Style_Blue;                                     // 0x1200(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Purple;                                   // 0x1478(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Red;                                      // 0x16F0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_NoneLineFace;                             // 0x1968(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         In_Column;                                         // 0x1BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BP_PANEL_SIZE_0;                                   // 0x1BE4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TextMargin_Size;                                   // 0x1BEC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Text_Margin_Size;                                  // 0x1BF4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_BTN_IconTextBox(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnUpdateNotification(bool InIsOn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_BTN_IconTextBox_C">();
	}
	static class UBP_UI_BTN_IconTextBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_BTN_IconTextBox_C>();
	}
};
static_assert(alignof(UBP_UI_BTN_IconTextBox_C) == 0x000008, "Wrong alignment on UBP_UI_BTN_IconTextBox_C");
static_assert(sizeof(UBP_UI_BTN_IconTextBox_C) == 0x001C00, "Wrong size on UBP_UI_BTN_IconTextBox_C");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, UberGraphFrame) == 0x000F00, "Member 'UBP_UI_BTN_IconTextBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, Press) == 0x000F08, "Member 'UBP_UI_BTN_IconTextBox_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, Hover) == 0x000F10, "Member 'UBP_UI_BTN_IconTextBox_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, BP_Min_SIZE) == 0x000F18, "Member 'UBP_UI_BTN_IconTextBox_C::BP_Min_SIZE' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, BP_UI_RedDot) == 0x000F20, "Member 'UBP_UI_BTN_IconTextBox_C::BP_UI_RedDot' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, IconOffset) == 0x000F28, "Member 'UBP_UI_BTN_IconTextBox_C::IconOffset' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, IconSize) == 0x000F30, "Member 'UBP_UI_BTN_IconTextBox_C::IconSize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, Tex_BTN_TextBox_CenterDeco) == 0x000F38, "Member 'UBP_UI_BTN_IconTextBox_C::Tex_BTN_TextBox_CenterDeco' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, Tex_BTN_TextBox_SideDeco) == 0x000F40, "Member 'UBP_UI_BTN_IconTextBox_C::Tex_BTN_TextBox_SideDeco' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, TextSize) == 0x000F48, "Member 'UBP_UI_BTN_IconTextBox_C::TextSize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, TLSpacer_L) == 0x000F50, "Member 'UBP_UI_BTN_IconTextBox_C::TLSpacer_L' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, TLSpacer_R) == 0x000F58, "Member 'UBP_UI_BTN_IconTextBox_C::TLSpacer_R' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, BP_PANEL_SIZE) == 0x000F60, "Member 'UBP_UI_BTN_IconTextBox_C::BP_PANEL_SIZE' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, ICON_SIZE) == 0x000F68, "Member 'UBP_UI_BTN_IconTextBox_C::ICON_SIZE' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, ICON_OFFSET) == 0x000F6C, "Member 'UBP_UI_BTN_IconTextBox_C::ICON_OFFSET' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, TextShow) == 0x000F74, "Member 'UBP_UI_BTN_IconTextBox_C::TextShow' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, IconShow) == 0x000F75, "Member 'UBP_UI_BTN_IconTextBox_C::IconShow' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, Right_3) == 0x000F78, "Member 'UBP_UI_BTN_IconTextBox_C::Right_3' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, BackIMG_TYPE_SET) == 0x000F7C, "Member 'UBP_UI_BTN_IconTextBox_C::BackIMG_TYPE_SET' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, Two_Gold) == 0x000F80, "Member 'UBP_UI_BTN_IconTextBox_C::Two_Gold' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, In_Style_NoneFrame) == 0x000F88, "Member 'UBP_UI_BTN_IconTextBox_C::In_Style_NoneFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, In_Style_Blue) == 0x001200, "Member 'UBP_UI_BTN_IconTextBox_C::In_Style_Blue' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, In_Style_Purple) == 0x001478, "Member 'UBP_UI_BTN_IconTextBox_C::In_Style_Purple' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, In_Style_Red) == 0x0016F0, "Member 'UBP_UI_BTN_IconTextBox_C::In_Style_Red' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, In_Style_NoneLineFace) == 0x001968, "Member 'UBP_UI_BTN_IconTextBox_C::In_Style_NoneLineFace' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, In_Column) == 0x001BE0, "Member 'UBP_UI_BTN_IconTextBox_C::In_Column' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, BP_PANEL_SIZE_0) == 0x001BE4, "Member 'UBP_UI_BTN_IconTextBox_C::BP_PANEL_SIZE_0' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, TextMargin_Size) == 0x001BEC, "Member 'UBP_UI_BTN_IconTextBox_C::TextMargin_Size' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_IconTextBox_C, Text_Margin_Size) == 0x001BF4, "Member 'UBP_UI_BTN_IconTextBox_C::Text_Margin_Size' has a wrong offset!");

}

