#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_TextBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_BTN_TextBox.BP_UI_BTN_TextBox_C.ExecuteUbergraph_BP_UI_BTN_TextBox
// 0x0070 (0x0070 - 0x0000)
struct BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsOn;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox) == 0x000008, "Wrong alignment on BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox");
static_assert(sizeof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox) == 0x000070, "Wrong size on BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, EntryPoint) == 0x000000, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, K2Node_Event_InIsOn) == 0x000004, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::K2Node_Event_InIsOn' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, K2Node_Event_IsDesignTime) == 0x000018, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, CallFunc_SetVisible_self_CastInput_1) == 0x000030, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, CallFunc_SetVisible_self_CastInput_2) == 0x000040, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000050, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, CallFunc_SetVisible_self_CastInput_3) == 0x000058, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_UI_BTN_TextBox_C_ExecuteUbergraph_BP_UI_BTN_TextBox::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_UI_BTN_TextBox.BP_UI_BTN_TextBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_BTN_TextBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_TextBox_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UI_BTN_TextBox_C_PreConstruct");
static_assert(sizeof(BP_UI_BTN_TextBox_C_PreConstruct) == 0x000001, "Wrong size on BP_UI_BTN_TextBox_C_PreConstruct");
static_assert(offsetof(BP_UI_BTN_TextBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UI_BTN_TextBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_UI_BTN_TextBox.BP_UI_BTN_TextBox_C.OnUpdateNotification
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_BTN_TextBox_C_OnUpdateNotification final
{
public:
	bool                                          InIsOn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_TextBox_C_OnUpdateNotification) == 0x000001, "Wrong alignment on BP_UI_BTN_TextBox_C_OnUpdateNotification");
static_assert(sizeof(BP_UI_BTN_TextBox_C_OnUpdateNotification) == 0x000001, "Wrong size on BP_UI_BTN_TextBox_C_OnUpdateNotification");
static_assert(offsetof(BP_UI_BTN_TextBox_C_OnUpdateNotification, InIsOn) == 0x000000, "Member 'BP_UI_BTN_TextBox_C_OnUpdateNotification::InIsOn' has a wrong offset!");

// Function BP_UI_BTN_TextBox.BP_UI_BTN_TextBox_C.Large
// 0x0018 (0x0018 - 0x0000)
struct BP_UI_BTN_TextBox_C_Large final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_TextBox_C_Large) == 0x000008, "Wrong alignment on BP_UI_BTN_TextBox_C_Large");
static_assert(sizeof(BP_UI_BTN_TextBox_C_Large) == 0x000018, "Wrong size on BP_UI_BTN_TextBox_C_Large");
static_assert(offsetof(BP_UI_BTN_TextBox_C_Large, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'BP_UI_BTN_TextBox_C_Large::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_Large, K2Node_MakeStruct_Margin) == 0x000008, "Member 'BP_UI_BTN_TextBox_C_Large::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function BP_UI_BTN_TextBox.BP_UI_BTN_TextBox_C.Small
// 0x0018 (0x0018 - 0x0000)
struct BP_UI_BTN_TextBox_C_Small final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_TextBox_C_Small) == 0x000008, "Wrong alignment on BP_UI_BTN_TextBox_C_Small");
static_assert(sizeof(BP_UI_BTN_TextBox_C_Small) == 0x000018, "Wrong size on BP_UI_BTN_TextBox_C_Small");
static_assert(offsetof(BP_UI_BTN_TextBox_C_Small, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'BP_UI_BTN_TextBox_C_Small::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_Small, K2Node_MakeStruct_Margin) == 0x000008, "Member 'BP_UI_BTN_TextBox_C_Small::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function BP_UI_BTN_TextBox.BP_UI_BTN_TextBox_C.ApplyButtonColor
// 0x0008 (0x0008 - 0x0000)
struct BP_UI_BTN_TextBox_C_ApplyButtonColor final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_TextBox_C_ApplyButtonColor) == 0x000004, "Wrong alignment on BP_UI_BTN_TextBox_C_ApplyButtonColor");
static_assert(sizeof(BP_UI_BTN_TextBox_C_ApplyButtonColor) == 0x000008, "Wrong size on BP_UI_BTN_TextBox_C_ApplyButtonColor");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ApplyButtonColor, Index_0) == 0x000000, "Member 'BP_UI_BTN_TextBox_C_ApplyButtonColor::Index_0' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_TextBox_C_ApplyButtonColor, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BP_UI_BTN_TextBox_C_ApplyButtonColor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

