#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_TextBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_BTN_TextBox.BP_UI_BTN_TextBox_C
// 0x0A98 (0x1998 - 0x0F00)
class UBP_UI_BTN_TextBox_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAinm;                                          // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unhover;                                           // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLNamedSlot*                           B;                                                 // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CharacterCount;                                    // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           CharacterCount_1;                                  // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       CountPanel;                                        // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           L;                                                 // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           R;                                                 // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Reddot;                                            // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBox_CenterDeco;                        // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Tex_BTN_TextBoxLine_Hover;                         // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       Text_Padding;                                      // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSizeBox*                             TLSizeBox_Maxsize;                                 // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLSpacer*                              TLSpacer_BTN_Size;                                 // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLUniformGridPanel*                    TLUniformGrid_Reddot;                              // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLTextBlock*                           TXT_RedDot_Count;                                  // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         BTN_Width;                                         // 0x0F98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BTN_Height;                                        // 0x0F9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisibleKeyIcon;                                    // 0x0FA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA1[0x3];                                      // 0x0FA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Button___Purple1_Gray2_Red3_RedDeco4;              // 0x0FA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeOn_SmallOFF;                                  // 0x0FA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Visible_RedDot_Count;                              // 0x0FA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FAA[0x6];                                      // 0x0FAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           In_Style_Blue_01;                                  // 0x0FB0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Red_03;                                   // 0x1228(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           In_Style_Purple_02;                                // 0x14A0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Charinfo_Visible;                                  // 0x1718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1719[0x3];                                     // 0x1719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         In_Max_Desired_Width;                              // 0x171C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           In_Style_Red_deco_type_04;                         // 0x1720(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_UI_BTN_TextBox(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnUpdateNotification(bool InIsOn);
	void Construct();
	void Large();
	void Small();
	void Gold();
	void Purple();
	void Red();
	void ApplyButtonColor(int32 Index_0);
	void Red_deco_type();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_BTN_TextBox_C">();
	}
	static class UBP_UI_BTN_TextBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_BTN_TextBox_C>();
	}
};
static_assert(alignof(UBP_UI_BTN_TextBox_C) == 0x000008, "Wrong alignment on UBP_UI_BTN_TextBox_C");
static_assert(sizeof(UBP_UI_BTN_TextBox_C) == 0x001998, "Wrong size on UBP_UI_BTN_TextBox_C");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, UberGraphFrame) == 0x000F00, "Member 'UBP_UI_BTN_TextBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, ShowAinm) == 0x000F08, "Member 'UBP_UI_BTN_TextBox_C::ShowAinm' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Unhover) == 0x000F10, "Member 'UBP_UI_BTN_TextBox_C::Unhover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Press) == 0x000F18, "Member 'UBP_UI_BTN_TextBox_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Hover) == 0x000F20, "Member 'UBP_UI_BTN_TextBox_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, B) == 0x000F28, "Member 'UBP_UI_BTN_TextBox_C::B' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, CharacterCount) == 0x000F30, "Member 'UBP_UI_BTN_TextBox_C::CharacterCount' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, CharacterCount_1) == 0x000F38, "Member 'UBP_UI_BTN_TextBox_C::CharacterCount_1' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, CountPanel) == 0x000F40, "Member 'UBP_UI_BTN_TextBox_C::CountPanel' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, L) == 0x000F48, "Member 'UBP_UI_BTN_TextBox_C::L' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, R) == 0x000F50, "Member 'UBP_UI_BTN_TextBox_C::R' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Reddot) == 0x000F58, "Member 'UBP_UI_BTN_TextBox_C::Reddot' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Tex_BTN_TextBox_CenterDeco) == 0x000F60, "Member 'UBP_UI_BTN_TextBox_C::Tex_BTN_TextBox_CenterDeco' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Tex_BTN_TextBoxLine_Hover) == 0x000F68, "Member 'UBP_UI_BTN_TextBox_C::Tex_BTN_TextBoxLine_Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Text_Padding) == 0x000F70, "Member 'UBP_UI_BTN_TextBox_C::Text_Padding' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, TLSizeBox_Maxsize) == 0x000F78, "Member 'UBP_UI_BTN_TextBox_C::TLSizeBox_Maxsize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, TLSpacer_BTN_Size) == 0x000F80, "Member 'UBP_UI_BTN_TextBox_C::TLSpacer_BTN_Size' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, TLUniformGrid_Reddot) == 0x000F88, "Member 'UBP_UI_BTN_TextBox_C::TLUniformGrid_Reddot' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, TXT_RedDot_Count) == 0x000F90, "Member 'UBP_UI_BTN_TextBox_C::TXT_RedDot_Count' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, BTN_Width) == 0x000F98, "Member 'UBP_UI_BTN_TextBox_C::BTN_Width' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, BTN_Height) == 0x000F9C, "Member 'UBP_UI_BTN_TextBox_C::BTN_Height' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, VisibleKeyIcon) == 0x000FA0, "Member 'UBP_UI_BTN_TextBox_C::VisibleKeyIcon' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Button___Purple1_Gray2_Red3_RedDeco4) == 0x000FA4, "Member 'UBP_UI_BTN_TextBox_C::Button___Purple1_Gray2_Red3_RedDeco4' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, LargeOn_SmallOFF) == 0x000FA8, "Member 'UBP_UI_BTN_TextBox_C::LargeOn_SmallOFF' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Visible_RedDot_Count) == 0x000FA9, "Member 'UBP_UI_BTN_TextBox_C::Visible_RedDot_Count' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, In_Style_Blue_01) == 0x000FB0, "Member 'UBP_UI_BTN_TextBox_C::In_Style_Blue_01' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, In_Style_Red_03) == 0x001228, "Member 'UBP_UI_BTN_TextBox_C::In_Style_Red_03' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, In_Style_Purple_02) == 0x0014A0, "Member 'UBP_UI_BTN_TextBox_C::In_Style_Purple_02' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, Charinfo_Visible) == 0x001718, "Member 'UBP_UI_BTN_TextBox_C::Charinfo_Visible' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, In_Max_Desired_Width) == 0x00171C, "Member 'UBP_UI_BTN_TextBox_C::In_Max_Desired_Width' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_TextBox_C, In_Style_Red_deco_type_04) == 0x001720, "Member 'UBP_UI_BTN_TextBox_C::In_Style_Red_deco_type_04' has a wrong offset!");

}

