#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_Toggle_OnlyIcon_NoColor

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_BTN_Toggle_OnlyIcon_NoColor.BP_UI_BTN_Toggle_OnlyIcon_NoColor_C.ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor
// 0x0030 (0x0030 - 0x0000)
struct BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor) == 0x000008, "Wrong alignment on BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor");
static_assert(sizeof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor) == 0x000030, "Wrong size on BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor");
static_assert(offsetof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor, EntryPoint) == 0x000000, "Member 'BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000008, "Member 'BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor, CallFunc_BreakVector2D_X) == 0x000014, "Member 'BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_ExecuteUbergraph_BP_UI_BTN_Toggle_OnlyIcon_NoColor::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function BP_UI_BTN_Toggle_OnlyIcon_NoColor.BP_UI_BTN_Toggle_OnlyIcon_NoColor_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_PreConstruct");
static_assert(sizeof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_PreConstruct) == 0x000001, "Wrong size on BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_PreConstruct");
static_assert(offsetof(BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UI_BTN_Toggle_OnlyIcon_NoColor_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

