#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_Popup_Msg_BackGround

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_Popup_Msg_BackGround.BP_UI_Popup_Msg_BackGround_C
// 0x0040 (0x1470 - 0x1430)
class UBP_UI_Popup_Msg_BackGround_C final : public UTLUserWidgetBGFrame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTLImage*                               BackColor;                                         // 0x1438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLBorder*                              Frame_Alpha;                                       // 0x1440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShadowOnOff;                                       // 0x1448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1449[0x3];                                     // 0x1449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           In_Content_Color_and_Opacity;                      // 0x144C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Content_Color_And_Opacity;                         // 0x145C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_Popup_Msg_BackGround(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_Popup_Msg_BackGround_C">();
	}
	static class UBP_UI_Popup_Msg_BackGround_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_Popup_Msg_BackGround_C>();
	}
};
static_assert(alignof(UBP_UI_Popup_Msg_BackGround_C) == 0x000010, "Wrong alignment on UBP_UI_Popup_Msg_BackGround_C");
static_assert(sizeof(UBP_UI_Popup_Msg_BackGround_C) == 0x001470, "Wrong size on UBP_UI_Popup_Msg_BackGround_C");
static_assert(offsetof(UBP_UI_Popup_Msg_BackGround_C, UberGraphFrame) == 0x001430, "Member 'UBP_UI_Popup_Msg_BackGround_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_Popup_Msg_BackGround_C, BackColor) == 0x001438, "Member 'UBP_UI_Popup_Msg_BackGround_C::BackColor' has a wrong offset!");
static_assert(offsetof(UBP_UI_Popup_Msg_BackGround_C, Frame_Alpha) == 0x001440, "Member 'UBP_UI_Popup_Msg_BackGround_C::Frame_Alpha' has a wrong offset!");
static_assert(offsetof(UBP_UI_Popup_Msg_BackGround_C, ShadowOnOff) == 0x001448, "Member 'UBP_UI_Popup_Msg_BackGround_C::ShadowOnOff' has a wrong offset!");
static_assert(offsetof(UBP_UI_Popup_Msg_BackGround_C, In_Content_Color_and_Opacity) == 0x00144C, "Member 'UBP_UI_Popup_Msg_BackGround_C::In_Content_Color_and_Opacity' has a wrong offset!");
static_assert(offsetof(UBP_UI_Popup_Msg_BackGround_C, Content_Color_And_Opacity) == 0x00145C, "Member 'UBP_UI_Popup_Msg_BackGround_C::Content_Color_And_Opacity' has a wrong offset!");

}

