#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_CheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_BTN_CheckBox.BP_UI_BTN_CheckBox_C
// 0x0298 (0x1290 - 0x0FF8)
class UBP_UI_BTN_CheckBox_C final : public UTLUserWidgetCheckButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Press;                                             // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnCheck;                                           // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Check;                                             // 0x1010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Indeterminate;                                     // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLImage*                               BP_PANEL_SIZE;                                     // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Check_Hover_Image;                                 // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Check_Image;                                       // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Check_Middle_Hover_Image;                          // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               Check_Middle_Normal_Image;                         // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLCanvasPanel*                         CheckBox_Size;                                     // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLUniformGridPanel*                    IconImages;                                        // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           Item01;                                            // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLNamedSlot*                           Item02;                                            // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLHorizontalBox*                       TextGroup;                                         // 0x1070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               UnCheck_Hover_Image;                               // 0x1078(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTLImage*                               UnCheck_Image;                                     // 0x1080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Text_OnOff;                                        // 0x1088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1089[0x3];                                     // 0x1089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Text_WrapSize;                                     // 0x108C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Icon_OnOff;                                        // 0x1090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1091[0x3];                                     // 0x1091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IconSize;                                          // 0x1094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoxMaxSize_OnOff;                                  // 0x1098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1099[0x3];                                     // 0x1099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoxMaxSize;                                        // 0x109C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Item01_ONOFF;                                      // 0x10A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Item02_ONOFF;                                      // 0x10A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A2[0x6];                                     // 0x10A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        Path_CheckImage;                                   // 0x10A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_CheckHoverImage;                              // 0x10C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Uncheck_Image;                                // 0x10D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_UncheckHover_Image;                           // 0x10F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Middle_Image;                                 // 0x1108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_MiddleHover_Image;                            // 0x1120(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Normal;                           // 0x1138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Hovered;                          // 0x1150(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Checked;                          // 0x1168(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Check_Hovered;                    // 0x1180(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_CheckImage_S;                                 // 0x1198(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_CheckHoverImage_S;                            // 0x11B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Uncheck_Image_S;                              // 0x11C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_UncheckHover_Image_S;                         // 0x11E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_Middle_Image_S;                               // 0x11F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Path_MiddleHover_Image_S;                          // 0x1210(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Normal_S;                         // 0x1228(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Hovered_S;                        // 0x1240(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Checked_S;                        // 0x1258(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Text_Block_Style_Check_Hovered_S;                  // 0x1270(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Small_On;                                          // 0x1288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_UI_BTN_CheckBox(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Large_Check();
	void SmallCheck();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_BTN_CheckBox_C">();
	}
	static class UBP_UI_BTN_CheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_BTN_CheckBox_C>();
	}
};
static_assert(alignof(UBP_UI_BTN_CheckBox_C) == 0x000008, "Wrong alignment on UBP_UI_BTN_CheckBox_C");
static_assert(sizeof(UBP_UI_BTN_CheckBox_C) == 0x001290, "Wrong size on UBP_UI_BTN_CheckBox_C");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, UberGraphFrame) == 0x000FF8, "Member 'UBP_UI_BTN_CheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Press) == 0x001000, "Member 'UBP_UI_BTN_CheckBox_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, UnCheck) == 0x001008, "Member 'UBP_UI_BTN_CheckBox_C::UnCheck' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Check) == 0x001010, "Member 'UBP_UI_BTN_CheckBox_C::Check' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Indeterminate) == 0x001018, "Member 'UBP_UI_BTN_CheckBox_C::Indeterminate' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Hover) == 0x001020, "Member 'UBP_UI_BTN_CheckBox_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, BP_PANEL_SIZE) == 0x001028, "Member 'UBP_UI_BTN_CheckBox_C::BP_PANEL_SIZE' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Check_Hover_Image) == 0x001030, "Member 'UBP_UI_BTN_CheckBox_C::Check_Hover_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Check_Image) == 0x001038, "Member 'UBP_UI_BTN_CheckBox_C::Check_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Check_Middle_Hover_Image) == 0x001040, "Member 'UBP_UI_BTN_CheckBox_C::Check_Middle_Hover_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Check_Middle_Normal_Image) == 0x001048, "Member 'UBP_UI_BTN_CheckBox_C::Check_Middle_Normal_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, CheckBox_Size) == 0x001050, "Member 'UBP_UI_BTN_CheckBox_C::CheckBox_Size' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, IconImages) == 0x001058, "Member 'UBP_UI_BTN_CheckBox_C::IconImages' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Item01) == 0x001060, "Member 'UBP_UI_BTN_CheckBox_C::Item01' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Item02) == 0x001068, "Member 'UBP_UI_BTN_CheckBox_C::Item02' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, TextGroup) == 0x001070, "Member 'UBP_UI_BTN_CheckBox_C::TextGroup' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, UnCheck_Hover_Image) == 0x001078, "Member 'UBP_UI_BTN_CheckBox_C::UnCheck_Hover_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, UnCheck_Image) == 0x001080, "Member 'UBP_UI_BTN_CheckBox_C::UnCheck_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_OnOff) == 0x001088, "Member 'UBP_UI_BTN_CheckBox_C::Text_OnOff' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_WrapSize) == 0x00108C, "Member 'UBP_UI_BTN_CheckBox_C::Text_WrapSize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Icon_OnOff) == 0x001090, "Member 'UBP_UI_BTN_CheckBox_C::Icon_OnOff' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, IconSize) == 0x001094, "Member 'UBP_UI_BTN_CheckBox_C::IconSize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, BoxMaxSize_OnOff) == 0x001098, "Member 'UBP_UI_BTN_CheckBox_C::BoxMaxSize_OnOff' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, BoxMaxSize) == 0x00109C, "Member 'UBP_UI_BTN_CheckBox_C::BoxMaxSize' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Item01_ONOFF) == 0x0010A0, "Member 'UBP_UI_BTN_CheckBox_C::Item01_ONOFF' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Item02_ONOFF) == 0x0010A1, "Member 'UBP_UI_BTN_CheckBox_C::Item02_ONOFF' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_CheckImage) == 0x0010A8, "Member 'UBP_UI_BTN_CheckBox_C::Path_CheckImage' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_CheckHoverImage) == 0x0010C0, "Member 'UBP_UI_BTN_CheckBox_C::Path_CheckHoverImage' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_Uncheck_Image) == 0x0010D8, "Member 'UBP_UI_BTN_CheckBox_C::Path_Uncheck_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_UncheckHover_Image) == 0x0010F0, "Member 'UBP_UI_BTN_CheckBox_C::Path_UncheckHover_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_Middle_Image) == 0x001108, "Member 'UBP_UI_BTN_CheckBox_C::Path_Middle_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_MiddleHover_Image) == 0x001120, "Member 'UBP_UI_BTN_CheckBox_C::Path_MiddleHover_Image' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Normal) == 0x001138, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Normal' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Hovered) == 0x001150, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Hovered' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Checked) == 0x001168, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Checked' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Check_Hovered) == 0x001180, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Check_Hovered' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_CheckImage_S) == 0x001198, "Member 'UBP_UI_BTN_CheckBox_C::Path_CheckImage_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_CheckHoverImage_S) == 0x0011B0, "Member 'UBP_UI_BTN_CheckBox_C::Path_CheckHoverImage_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_Uncheck_Image_S) == 0x0011C8, "Member 'UBP_UI_BTN_CheckBox_C::Path_Uncheck_Image_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_UncheckHover_Image_S) == 0x0011E0, "Member 'UBP_UI_BTN_CheckBox_C::Path_UncheckHover_Image_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_Middle_Image_S) == 0x0011F8, "Member 'UBP_UI_BTN_CheckBox_C::Path_Middle_Image_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Path_MiddleHover_Image_S) == 0x001210, "Member 'UBP_UI_BTN_CheckBox_C::Path_MiddleHover_Image_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Normal_S) == 0x001228, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Normal_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Hovered_S) == 0x001240, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Hovered_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Checked_S) == 0x001258, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Checked_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Text_Block_Style_Check_Hovered_S) == 0x001270, "Member 'UBP_UI_BTN_CheckBox_C::Text_Block_Style_Check_Hovered_S' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_CheckBox_C, Small_On) == 0x001288, "Member 'UBP_UI_BTN_CheckBox_C::Small_On' has a wrong offset!");

}

