#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_Progress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_Progress.BP_UI_Progress_C.ExecuteUbergraph_BP_UI_Progress
// 0x0008 (0x0008 - 0x0000)
struct BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress) == 0x000004, "Wrong alignment on BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress");
static_assert(sizeof(BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress) == 0x000008, "Wrong size on BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress");
static_assert(offsetof(BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress, EntryPoint) == 0x000000, "Member 'BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress, K2Node_SwitchInteger_CmpSuccess_1) == 0x000006, "Member 'BP_UI_Progress_C_ExecuteUbergraph_BP_UI_Progress::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");

// Function BP_UI_Progress.BP_UI_Progress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_Progress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_Progress_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UI_Progress_C_PreConstruct");
static_assert(sizeof(BP_UI_Progress_C_PreConstruct) == 0x000001, "Wrong size on BP_UI_Progress_C_PreConstruct");
static_assert(offsetof(BP_UI_Progress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UI_Progress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_UI_Progress.BP_UI_Progress_C.Large
// 0x0018 (0x0018 - 0x0000)
struct BP_UI_Progress_C_Large final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_Progress_C_Large) == 0x000008, "Wrong alignment on BP_UI_Progress_C_Large");
static_assert(sizeof(BP_UI_Progress_C_Large) == 0x000018, "Wrong size on BP_UI_Progress_C_Large");
static_assert(offsetof(BP_UI_Progress_C_Large, K2Node_MakeStruct_Margin) == 0x000000, "Member 'BP_UI_Progress_C_Large::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_UI_Progress_C_Large, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'BP_UI_Progress_C_Large::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function BP_UI_Progress.BP_UI_Progress_C.Small
// 0x0018 (0x0018 - 0x0000)
struct BP_UI_Progress_C_Small final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_Progress_C_Small) == 0x000008, "Wrong alignment on BP_UI_Progress_C_Small");
static_assert(sizeof(BP_UI_Progress_C_Small) == 0x000018, "Wrong size on BP_UI_Progress_C_Small");
static_assert(offsetof(BP_UI_Progress_C_Small, K2Node_MakeStruct_Margin) == 0x000000, "Member 'BP_UI_Progress_C_Small::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_UI_Progress_C_Small, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'BP_UI_Progress_C_Small::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

}

