#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_IconTextBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_BTN_IconTextBox.BP_UI_BTN_IconTextBox_C.ExecuteUbergraph_BP_UI_BTN_IconTextBox
// 0x0138 (0x0138 - 0x0000)
struct BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InIsOn;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_4;              // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_7;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_7;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox) == 0x000008, "Wrong alignment on BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox");
static_assert(sizeof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox) == 0x000138, "Wrong size on BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, EntryPoint) == 0x000000, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X) == 0x000004, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X_1) == 0x00000C, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y_1) == 0x000010, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, K2Node_MakeStruct_Margin) == 0x000014, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SetVisible_self_CastInput) == 0x000030, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, K2Node_MakeStruct_Margin_1) == 0x000040, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000050, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000058, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X_2) == 0x000060, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y_2) == 0x000064, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, K2Node_MakeStruct_Margin_2) == 0x000068, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000078, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, K2Node_SwitchInteger_CmpSuccess) == 0x000080, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SetVisible_self_CastInput_1) == 0x000088, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, K2Node_Event_InIsOn) == 0x000098, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::K2Node_Event_InIsOn' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SetVisible_self_CastInput_2) == 0x0000A0, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SetVisible_self_CastInput_3) == 0x0000B0, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_ShowWithValue_self_CastInput) == 0x0000C0, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_SetVisible_self_CastInput_4) == 0x0000D0, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_SetVisible_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, K2Node_Event_IsDesignTime) == 0x0000E0, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X_3) == 0x0000E4, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y_3) == 0x0000E8, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000EC, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X_4) == 0x0000F0, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y_4) == 0x0000F4, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, K2Node_MakeStruct_Margin_3) == 0x0000FC, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X_5) == 0x00010C, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y_5) == 0x000110, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000114, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000118, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X_6) == 0x00011C, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y_6) == 0x000120, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_X_7) == 0x000124, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_X_7' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_BreakVector2D_Y_7) == 0x000128, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_BreakVector2D_Y_7' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00012C, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000130, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000134, "Member 'BP_UI_BTN_IconTextBox_C_ExecuteUbergraph_BP_UI_BTN_IconTextBox::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function BP_UI_BTN_IconTextBox.BP_UI_BTN_IconTextBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_BTN_IconTextBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_IconTextBox_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UI_BTN_IconTextBox_C_PreConstruct");
static_assert(sizeof(BP_UI_BTN_IconTextBox_C_PreConstruct) == 0x000001, "Wrong size on BP_UI_BTN_IconTextBox_C_PreConstruct");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UI_BTN_IconTextBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_UI_BTN_IconTextBox.BP_UI_BTN_IconTextBox_C.OnUpdateNotification
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_BTN_IconTextBox_C_OnUpdateNotification final
{
public:
	bool                                          InIsOn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_BTN_IconTextBox_C_OnUpdateNotification) == 0x000001, "Wrong alignment on BP_UI_BTN_IconTextBox_C_OnUpdateNotification");
static_assert(sizeof(BP_UI_BTN_IconTextBox_C_OnUpdateNotification) == 0x000001, "Wrong size on BP_UI_BTN_IconTextBox_C_OnUpdateNotification");
static_assert(offsetof(BP_UI_BTN_IconTextBox_C_OnUpdateNotification, InIsOn) == 0x000000, "Member 'BP_UI_BTN_IconTextBox_C_OnUpdateNotification::InIsOn' has a wrong offset!");

}

