#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_BTN_PopUp_Close

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_BTN_PopUp_Close.BP_UI_BTN_PopUp_Close_C
// 0x02C8 (0x11C8 - 0x0F00)
class UBP_UI_BTN_PopUp_Close_C final : public UTLUserWidgetActionGuideButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Release;                                           // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTLSizeBox*                             BTN_SizeBOx;                                       // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          T_Close_F_Back;                                    // 0x0F30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F31[0x3];                                      // 0x0F31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WidthBTN_Size;                                     // 0x0F34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Five4;                                             // 0x0F38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                In_Offset;                                         // 0x0F3C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4C[0x4];                                      // 0x0F4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           In_Style_Button;                                   // 0x0F50(0x0278)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_UI_BTN_PopUp_Close(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_BTN_PopUp_Close_C">();
	}
	static class UBP_UI_BTN_PopUp_Close_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_BTN_PopUp_Close_C>();
	}
};
static_assert(alignof(UBP_UI_BTN_PopUp_Close_C) == 0x000008, "Wrong alignment on UBP_UI_BTN_PopUp_Close_C");
static_assert(sizeof(UBP_UI_BTN_PopUp_Close_C) == 0x0011C8, "Wrong size on UBP_UI_BTN_PopUp_Close_C");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, UberGraphFrame) == 0x000F00, "Member 'UBP_UI_BTN_PopUp_Close_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, Release) == 0x000F08, "Member 'UBP_UI_BTN_PopUp_Close_C::Release' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, ShowAnim) == 0x000F10, "Member 'UBP_UI_BTN_PopUp_Close_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, Press) == 0x000F18, "Member 'UBP_UI_BTN_PopUp_Close_C::Press' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, Hover) == 0x000F20, "Member 'UBP_UI_BTN_PopUp_Close_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, BTN_SizeBOx) == 0x000F28, "Member 'UBP_UI_BTN_PopUp_Close_C::BTN_SizeBOx' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, T_Close_F_Back) == 0x000F30, "Member 'UBP_UI_BTN_PopUp_Close_C::T_Close_F_Back' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, WidthBTN_Size) == 0x000F34, "Member 'UBP_UI_BTN_PopUp_Close_C::WidthBTN_Size' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, Five4) == 0x000F38, "Member 'UBP_UI_BTN_PopUp_Close_C::Five4' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, In_Offset) == 0x000F3C, "Member 'UBP_UI_BTN_PopUp_Close_C::In_Offset' has a wrong offset!");
static_assert(offsetof(UBP_UI_BTN_PopUp_Close_C, In_Style_Button) == 0x000F50, "Member 'UBP_UI_BTN_PopUp_Close_C::In_Style_Button' has a wrong offset!");

}

