#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_ItemSlot_Frame

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.ExecuteUbergraph_BP_UI_ItemSlot_Frame
// 0x0260 (0x0260 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOtherPresetItem_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InEmpty;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_1;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput;             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_2;              // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_3;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_4;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_5;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsDungeonItem;                     // 0x0088(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_6;              // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_7;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_ShowWithValue_self_CastInput_1;           // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemGrade                                    K2Node_Event_InGrade;                              // 0x00C0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_8;              // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_9;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InbMaxLevel;                          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_10;             // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_11;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOtherPresetItem_ReturnValue_1;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InRequireLevel;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InPcLevel;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0120(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_12;             // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_13;             // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_14;             // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLockable_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_15;             // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_16;             // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_17;             // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InIsExtractItem;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_18;             // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_19;             // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_20;             // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_21;             // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_22;             // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLWidgetVisibilityInterface> CallFunc_SetVisible_self_CastInput_23;             // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame) == 0x000008, "Wrong alignment on BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame) == 0x000260, "Wrong size on BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, EntryPoint) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_IsOtherPresetItem_ReturnValue) == 0x000004, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_IsOtherPresetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput) == 0x000008, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_InEmpty) == 0x000018, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_InEmpty' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_1) == 0x000020, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_ShowWithValue_self_CastInput) == 0x000030, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_ShowWithValue_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_2) == 0x000048, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_3) == 0x000058, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_4) == 0x000068, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_5) == 0x000078, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_bInIsDungeonItem) == 0x000088, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_bInIsDungeonItem' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_6) == 0x000090, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_7) == 0x0000A0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_7' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_ShowWithValue_self_CastInput_1) == 0x0000B0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_ShowWithValue_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_InGrade) == 0x0000C0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_InGrade' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_SwitchEnum_CmpSuccess) == 0x0000C1, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_8) == 0x0000C8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_8' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_9) == 0x0000D8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_9' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_InbMaxLevel) == 0x0000E8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_InbMaxLevel' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_10) == 0x0000F0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_10' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_11) == 0x000100, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_11' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_IsOtherPresetItem_ReturnValue_1) == 0x000110, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_IsOtherPresetItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_BooleanOR_ReturnValue) == 0x000111, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_InRequireLevel) == 0x000114, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_InRequireLevel' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_InPcLevel) == 0x000118, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_InPcLevel' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_Less_IntInt_ReturnValue) == 0x00011C, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_Conv_IntToText_ReturnValue) == 0x000120, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000138, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_12) == 0x000140, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_12' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_13) == 0x000150, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_13' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_14) == 0x000160, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_14' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_IsLockable_ReturnValue) == 0x000170, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_IsLockable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_BooleanAND_ReturnValue) == 0x000171, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_15) == 0x000178, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_15' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_16) == 0x000188, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_16' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_BooleanAND_ReturnValue_1) == 0x000198, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_17) == 0x0001A0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_17' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_InIsExtractItem) == 0x0001B0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_InIsExtractItem' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_18) == 0x0001B8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_18' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0001C8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0001D0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, K2Node_Event_IsDesignTime) == 0x0001D8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x0001E0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x0001E8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_Not_PreBool_ReturnValue) == 0x0001F0, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_BooleanAND_ReturnValue_2) == 0x0001F1, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_19) == 0x0001F8, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_19' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_Not_PreBool_ReturnValue_1) == 0x000208, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_20) == 0x000210, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_20' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_21) == 0x000220, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_21' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_22) == 0x000230, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_22' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000240, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x000248, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame, CallFunc_SetVisible_self_CastInput_23) == 0x000250, "Member 'BP_UI_ItemSlot_Frame_C_ExecuteUbergraph_BP_UI_ItemSlot_Frame::CallFunc_SetVisible_self_CastInput_23' has a wrong offset!");

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UI_ItemSlot_Frame_C_PreConstruct");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_PreConstruct) == 0x000001, "Wrong size on BP_UI_ItemSlot_Frame_C_PreConstruct");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.OnItemTraitExtract
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_OnItemTraitExtract final
{
public:
	bool                                          InIsExtractItem;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_OnItemTraitExtract) == 0x000001, "Wrong alignment on BP_UI_ItemSlot_Frame_C_OnItemTraitExtract");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_OnItemTraitExtract) == 0x000001, "Wrong size on BP_UI_ItemSlot_Frame_C_OnItemTraitExtract");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_OnItemTraitExtract, InIsExtractItem) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_OnItemTraitExtract::InIsExtractItem' has a wrong offset!");

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.OnUpdateRequireLevel
// 0x0008 (0x0008 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel final
{
public:
	int32                                         InRequireLevel;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InPcLevel;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel) == 0x000004, "Wrong alignment on BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel) == 0x000008, "Wrong size on BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel, InRequireLevel) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel::InRequireLevel' has a wrong offset!");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel, InPcLevel) == 0x000004, "Member 'BP_UI_ItemSlot_Frame_C_OnUpdateRequireLevel::InPcLevel' has a wrong offset!");

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.OnUpdateMaxEnchant
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_OnUpdateMaxEnchant final
{
public:
	bool                                          InbMaxLevel;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_OnUpdateMaxEnchant) == 0x000001, "Wrong alignment on BP_UI_ItemSlot_Frame_C_OnUpdateMaxEnchant");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_OnUpdateMaxEnchant) == 0x000001, "Wrong size on BP_UI_ItemSlot_Frame_C_OnUpdateMaxEnchant");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_OnUpdateMaxEnchant, InbMaxLevel) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_OnUpdateMaxEnchant::InbMaxLevel' has a wrong offset!");

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.OnItemGradeUpdate
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_OnItemGradeUpdate final
{
public:
	EItemGrade                                    InGrade;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_OnItemGradeUpdate) == 0x000001, "Wrong alignment on BP_UI_ItemSlot_Frame_C_OnItemGradeUpdate");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_OnItemGradeUpdate) == 0x000001, "Wrong size on BP_UI_ItemSlot_Frame_C_OnItemGradeUpdate");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_OnItemGradeUpdate, InGrade) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_OnItemGradeUpdate::InGrade' has a wrong offset!");

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.OnItemDungeonUpdate
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_OnItemDungeonUpdate final
{
public:
	bool                                          bInIsDungeonItem;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_OnItemDungeonUpdate) == 0x000001, "Wrong alignment on BP_UI_ItemSlot_Frame_C_OnItemDungeonUpdate");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_OnItemDungeonUpdate) == 0x000001, "Wrong size on BP_UI_ItemSlot_Frame_C_OnItemDungeonUpdate");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_OnItemDungeonUpdate, bInIsDungeonItem) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_OnItemDungeonUpdate::bInIsDungeonItem' has a wrong offset!");

// Function BP_UI_ItemSlot_Frame.BP_UI_ItemSlot_Frame_C.OnEmpty
// 0x0001 (0x0001 - 0x0000)
struct BP_UI_ItemSlot_Frame_C_OnEmpty final
{
public:
	bool                                          InEmpty;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_ItemSlot_Frame_C_OnEmpty) == 0x000001, "Wrong alignment on BP_UI_ItemSlot_Frame_C_OnEmpty");
static_assert(sizeof(BP_UI_ItemSlot_Frame_C_OnEmpty) == 0x000001, "Wrong size on BP_UI_ItemSlot_Frame_C_OnEmpty");
static_assert(offsetof(BP_UI_ItemSlot_Frame_C_OnEmpty, InEmpty) == 0x000000, "Member 'BP_UI_ItemSlot_Frame_C_OnEmpty::InEmpty' has a wrong offset!");

}

