#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionContextMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_structs.hpp"
#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function CollectionContextMenu.CollectionContextMenu_C.ExecuteUbergraph_CollectionContextMenu
// 0x0018 (0x0018 - 0x0000)
struct CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInvenModeType                                K2Node_Event_InInvenModeType;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLUserWidgetItemSlot*                  K2Node_Event_InItemWidget;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCurrentPresetNum;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 K2Node_Event_UIPlatform;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu) == 0x000008, "Wrong alignment on CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu");
static_assert(sizeof(CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu) == 0x000018, "Wrong size on CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu");
static_assert(offsetof(CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu, EntryPoint) == 0x000000, "Member 'CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu, K2Node_Event_InInvenModeType) == 0x000004, "Member 'CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu::K2Node_Event_InInvenModeType' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu, K2Node_Event_InItemWidget) == 0x000008, "Member 'CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu::K2Node_Event_InItemWidget' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu, K2Node_Event_InCurrentPresetNum) == 0x000010, "Member 'CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu::K2Node_Event_InCurrentPresetNum' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu, K2Node_Event_UIPlatform) == 0x000014, "Member 'CollectionContextMenu_C_ExecuteUbergraph_CollectionContextMenu::K2Node_Event_UIPlatform' has a wrong offset!");

// Function CollectionContextMenu.CollectionContextMenu_C.OnContextMenuShow
// 0x0018 (0x0018 - 0x0000)
struct CollectionContextMenu_C_OnContextMenuShow final
{
public:
	EInvenModeType                                InInvenModeType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLUserWidgetItemSlot*                  InItemWidget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCurrentPresetNum;                                // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 UIPlatform;                                        // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionContextMenu_C_OnContextMenuShow) == 0x000008, "Wrong alignment on CollectionContextMenu_C_OnContextMenuShow");
static_assert(sizeof(CollectionContextMenu_C_OnContextMenuShow) == 0x000018, "Wrong size on CollectionContextMenu_C_OnContextMenuShow");
static_assert(offsetof(CollectionContextMenu_C_OnContextMenuShow, InInvenModeType) == 0x000000, "Member 'CollectionContextMenu_C_OnContextMenuShow::InInvenModeType' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_OnContextMenuShow, InItemWidget) == 0x000008, "Member 'CollectionContextMenu_C_OnContextMenuShow::InItemWidget' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_OnContextMenuShow, InCurrentPresetNum) == 0x000010, "Member 'CollectionContextMenu_C_OnContextMenuShow::InCurrentPresetNum' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_OnContextMenuShow, UIPlatform) == 0x000014, "Member 'CollectionContextMenu_C_OnContextMenuShow::UIPlatform' has a wrong offset!");

// Function CollectionContextMenu.CollectionContextMenu_C.Add Enchant Menu
// 0x0058 (0x0058 - 0x0000)
struct CollectionContextMenu_C_Add_Enchant_Menu final
{
public:
	class UTLUserWidgetItemSlot*                  InItemWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLItemViewInterface>  CallFunc_IsLocked_self_CastInput;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocked_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITLItemViewInterface>  CallFunc_IsEnchantable_self_CastInput;             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnchantable_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_UInt64UInt64_ReturnValue;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLUserWidgetItemCollectionGroupItemSlot* K2Node_DynamicCast_AsTLUser_Widget_Item_Collection_Group_Item_Slot; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        CallFunc_GetMatchedItemUid_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_UInt64UInt64_ReturnValue_1;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CollectionContextMenu_C_Add_Enchant_Menu) == 0x000008, "Wrong alignment on CollectionContextMenu_C_Add_Enchant_Menu");
static_assert(sizeof(CollectionContextMenu_C_Add_Enchant_Menu) == 0x000058, "Wrong size on CollectionContextMenu_C_Add_Enchant_Menu");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, InItemWidget) == 0x000000, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::InItemWidget' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_IsLocked_self_CastInput) == 0x000008, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_IsLocked_self_CastInput' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_IsLocked_ReturnValue) == 0x000018, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_IsLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_IsEnchantable_self_CastInput) == 0x000020, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_IsEnchantable_self_CastInput' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_IsEnchantable_ReturnValue) == 0x000030, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_IsEnchantable_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_NotEqual_UInt64UInt64_ReturnValue) == 0x000033, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_NotEqual_UInt64UInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_BooleanAND_ReturnValue_1) == 0x000034, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, K2Node_DynamicCast_AsTLUser_Widget_Item_Collection_Group_Item_Slot) == 0x000038, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::K2Node_DynamicCast_AsTLUser_Widget_Item_Collection_Group_Item_Slot' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_GetMatchedItemUid_ReturnValue) == 0x000048, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_GetMatchedItemUid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_Add_Enchant_Menu, CallFunc_NotEqual_UInt64UInt64_ReturnValue_1) == 0x000050, "Member 'CollectionContextMenu_C_Add_Enchant_Menu::CallFunc_NotEqual_UInt64UInt64_ReturnValue_1' has a wrong offset!");

// Function CollectionContextMenu.CollectionContextMenu_C.AddTradeMenu
// 0x0020 (0x0020 - 0x0000)
struct CollectionContextMenu_C_AddTradeMenu final
{
public:
	class UTLUserWidgetItemSlot*                  InItemWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLItemViewInterface>  CallFunc_IsTradable_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTradable_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CollectionContextMenu_C_AddTradeMenu) == 0x000008, "Wrong alignment on CollectionContextMenu_C_AddTradeMenu");
static_assert(sizeof(CollectionContextMenu_C_AddTradeMenu) == 0x000020, "Wrong size on CollectionContextMenu_C_AddTradeMenu");
static_assert(offsetof(CollectionContextMenu_C_AddTradeMenu, InItemWidget) == 0x000000, "Member 'CollectionContextMenu_C_AddTradeMenu::InItemWidget' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddTradeMenu, CallFunc_IsTradable_self_CastInput) == 0x000008, "Member 'CollectionContextMenu_C_AddTradeMenu::CallFunc_IsTradable_self_CastInput' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddTradeMenu, CallFunc_IsTradable_ReturnValue) == 0x000018, "Member 'CollectionContextMenu_C_AddTradeMenu::CallFunc_IsTradable_ReturnValue' has a wrong offset!");

// Function CollectionContextMenu.CollectionContextMenu_C.AddAcquisitionMenu
// 0x0020 (0x0020 - 0x0000)
struct CollectionContextMenu_C_AddAcquisitionMenu final
{
public:
	class UTLUserWidgetItemSlot*                  InItemWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLItemViewInterface>  CallFunc_IsAcquisitionExist_self_CastInput;        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAcquisitionExist_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CollectionContextMenu_C_AddAcquisitionMenu) == 0x000008, "Wrong alignment on CollectionContextMenu_C_AddAcquisitionMenu");
static_assert(sizeof(CollectionContextMenu_C_AddAcquisitionMenu) == 0x000020, "Wrong size on CollectionContextMenu_C_AddAcquisitionMenu");
static_assert(offsetof(CollectionContextMenu_C_AddAcquisitionMenu, InItemWidget) == 0x000000, "Member 'CollectionContextMenu_C_AddAcquisitionMenu::InItemWidget' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddAcquisitionMenu, CallFunc_IsAcquisitionExist_self_CastInput) == 0x000008, "Member 'CollectionContextMenu_C_AddAcquisitionMenu::CallFunc_IsAcquisitionExist_self_CastInput' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddAcquisitionMenu, CallFunc_IsAcquisitionExist_ReturnValue) == 0x000018, "Member 'CollectionContextMenu_C_AddAcquisitionMenu::CallFunc_IsAcquisitionExist_ReturnValue' has a wrong offset!");

// Function CollectionContextMenu.CollectionContextMenu_C.AddCollectionMenu
// 0x00A8 (0x00A8 - 0x0000)
struct CollectionContextMenu_C_AddCollectionMenu final
{
public:
	class UTLUserWidgetItemSlot*                  InItemWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLItemViewInterface>  CallFunc_GetLeftItemCollectionCount_self_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetLeftItemCollectionCount_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	TScriptInterface<class ITLItemViewInterface>  CallFunc_IsItemCollectable_self_CastInput;         // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemCollectable_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(CollectionContextMenu_C_AddCollectionMenu) == 0x000008, "Wrong alignment on CollectionContextMenu_C_AddCollectionMenu");
static_assert(sizeof(CollectionContextMenu_C_AddCollectionMenu) == 0x0000A8, "Wrong size on CollectionContextMenu_C_AddCollectionMenu");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, InItemWidget) == 0x000000, "Member 'CollectionContextMenu_C_AddCollectionMenu::InItemWidget' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, CallFunc_GetLeftItemCollectionCount_self_CastInput) == 0x000008, "Member 'CollectionContextMenu_C_AddCollectionMenu::CallFunc_GetLeftItemCollectionCount_self_CastInput' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, CallFunc_GetLeftItemCollectionCount_ReturnValue) == 0x000018, "Member 'CollectionContextMenu_C_AddCollectionMenu::CallFunc_GetLeftItemCollectionCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'CollectionContextMenu_C_AddCollectionMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'CollectionContextMenu_C_AddCollectionMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, K2Node_MakeArray_Array) == 0x000068, "Member 'CollectionContextMenu_C_AddCollectionMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, CallFunc_IsItemCollectable_self_CastInput) == 0x000078, "Member 'CollectionContextMenu_C_AddCollectionMenu::CallFunc_IsItemCollectable_self_CastInput' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, CallFunc_IsItemCollectable_ReturnValue) == 0x000088, "Member 'CollectionContextMenu_C_AddCollectionMenu::CallFunc_IsItemCollectable_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionContextMenu_C_AddCollectionMenu, CallFunc_Format_ReturnValue) == 0x000090, "Member 'CollectionContextMenu_C_AddCollectionMenu::CallFunc_Format_ReturnValue' has a wrong offset!");

}

