#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionContextMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CollectionContextMenu.CollectionContextMenu_C
// 0x0028 (0x00E0 - 0x00B8)
class UCollectionContextMenu_C final : public UTLItemSlotContextMenuObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   ItemCollectionMenuText;                            // 0x00C0(0x0018)(Edit, BlueprintVisible)
	bool                                          ValidItemUid;                                      // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CollectionContextMenu(int32 EntryPoint);
	void OnContextMenuShow(EInvenModeType InInvenModeType, class UTLUserWidgetItemSlot* InItemWidget, int32 InCurrentPresetNum, ETLUIPlatform UIPlatform);
	void Add_Enchant_Menu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddTradeMenu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddAcquisitionMenu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddCollectionMenu(class UTLUserWidgetItemSlot* InItemWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionContextMenu_C">();
	}
	static class UCollectionContextMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionContextMenu_C>();
	}
};
static_assert(alignof(UCollectionContextMenu_C) == 0x000008, "Wrong alignment on UCollectionContextMenu_C");
static_assert(sizeof(UCollectionContextMenu_C) == 0x0000E0, "Wrong size on UCollectionContextMenu_C");
static_assert(offsetof(UCollectionContextMenu_C, UberGraphFrame) == 0x0000B8, "Member 'UCollectionContextMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCollectionContextMenu_C, ItemCollectionMenuText) == 0x0000C0, "Member 'UCollectionContextMenu_C::ItemCollectionMenuText' has a wrong offset!");
static_assert(offsetof(UCollectionContextMenu_C, ValidItemUid) == 0x0000D8, "Member 'UCollectionContextMenu_C::ValidItemUid' has a wrong offset!");

}

