#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultContextMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLScheme_structs.hpp"
#include "TLClient_structs.hpp"
#include "TLClient_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DefaultContextMenu.DefaultContextMenu_C
// 0x0028 (0x00E0 - 0x00B8)
class UDefaultContextMenu_C final : public UTLItemSlotContextMenuObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   ItemCollectionMenuText;                            // 0x00C0(0x0018)(Edit, BlueprintVisible)
	bool                                          ValidItemUid;                                      // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ETLUIPlatform                                 UIPlatform;                                        // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DefaultContextMenu(int32 EntryPoint);
	void OnContextMenuShow(EInvenModeType InInvenModeType, class UTLUserWidgetItemSlot* InItemWidget, int32 InCurrentPresetNum, ETLUIPlatform UIPlatform_0);
	void AddTradeMenu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddAcquisitionMenu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddCollectionMenu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddUsageMenu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddChatShareMenu(class UTLUserWidget* InItemWidget);
	void AddItemLotteryMenu(class UTLUserWidget* InItemWidget);
	void Add_Compare_Other_Slot_Menu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddTraitListMenu(class UTLUserWidgetItemSlot* InItemWidget);
	void AddRuneStat(class UTLUserWidgetItemSlot* InItemWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultContextMenu_C">();
	}
	static class UDefaultContextMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultContextMenu_C>();
	}
};
static_assert(alignof(UDefaultContextMenu_C) == 0x000008, "Wrong alignment on UDefaultContextMenu_C");
static_assert(sizeof(UDefaultContextMenu_C) == 0x0000E0, "Wrong size on UDefaultContextMenu_C");
static_assert(offsetof(UDefaultContextMenu_C, UberGraphFrame) == 0x0000B8, "Member 'UDefaultContextMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDefaultContextMenu_C, ItemCollectionMenuText) == 0x0000C0, "Member 'UDefaultContextMenu_C::ItemCollectionMenuText' has a wrong offset!");
static_assert(offsetof(UDefaultContextMenu_C, ValidItemUid) == 0x0000D8, "Member 'UDefaultContextMenu_C::ValidItemUid' has a wrong offset!");
static_assert(offsetof(UDefaultContextMenu_C, UIPlatform) == 0x0000D9, "Member 'UDefaultContextMenu_C::UIPlatform' has a wrong offset!");

}

