#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipSlotContextMenu

#include "Basic.hpp"

#include "TLClient_structs.hpp"
#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function EquipSlotContextMenu.EquipSlotContextMenu_C.ExecuteUbergraph_EquipSlotContextMenu
// 0x0018 (0x0018 - 0x0000)
struct EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInvenModeType                                K2Node_Event_InInvenModeType;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLUserWidgetItemSlot*                  K2Node_Event_InItemWidget;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCurrentPresetNum;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 K2Node_Event_UIPlatform;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu) == 0x000008, "Wrong alignment on EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu");
static_assert(sizeof(EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu) == 0x000018, "Wrong size on EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu");
static_assert(offsetof(EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu, EntryPoint) == 0x000000, "Member 'EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu, K2Node_Event_InInvenModeType) == 0x000004, "Member 'EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu::K2Node_Event_InInvenModeType' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu, K2Node_Event_InItemWidget) == 0x000008, "Member 'EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu::K2Node_Event_InItemWidget' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu, K2Node_Event_InCurrentPresetNum) == 0x000010, "Member 'EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu::K2Node_Event_InCurrentPresetNum' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu, K2Node_Event_UIPlatform) == 0x000014, "Member 'EquipSlotContextMenu_C_ExecuteUbergraph_EquipSlotContextMenu::K2Node_Event_UIPlatform' has a wrong offset!");

// Function EquipSlotContextMenu.EquipSlotContextMenu_C.OnContextMenuShow
// 0x0018 (0x0018 - 0x0000)
struct EquipSlotContextMenu_C_OnContextMenuShow final
{
public:
	EInvenModeType                                InInvenModeType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLUserWidgetItemSlot*                  InItemWidget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCurrentPresetNum;                                // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 UIPlatform;                                        // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipSlotContextMenu_C_OnContextMenuShow) == 0x000008, "Wrong alignment on EquipSlotContextMenu_C_OnContextMenuShow");
static_assert(sizeof(EquipSlotContextMenu_C_OnContextMenuShow) == 0x000018, "Wrong size on EquipSlotContextMenu_C_OnContextMenuShow");
static_assert(offsetof(EquipSlotContextMenu_C_OnContextMenuShow, InInvenModeType) == 0x000000, "Member 'EquipSlotContextMenu_C_OnContextMenuShow::InInvenModeType' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_OnContextMenuShow, InItemWidget) == 0x000008, "Member 'EquipSlotContextMenu_C_OnContextMenuShow::InItemWidget' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_OnContextMenuShow, InCurrentPresetNum) == 0x000010, "Member 'EquipSlotContextMenu_C_OnContextMenuShow::InCurrentPresetNum' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_OnContextMenuShow, UIPlatform) == 0x000014, "Member 'EquipSlotContextMenu_C_OnContextMenuShow::UIPlatform' has a wrong offset!");

// Function EquipSlotContextMenu.EquipSlotContextMenu_C.AddUnequipMenu
// 0x0010 (0x0010 - 0x0000)
struct EquipSlotContextMenu_C_AddUnequipMenu final
{
public:
	class UTLUserWidgetItemSlot*                  EquipSlotWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipSlotContextMenu_C_AddUnequipMenu) == 0x000008, "Wrong alignment on EquipSlotContextMenu_C_AddUnequipMenu");
static_assert(sizeof(EquipSlotContextMenu_C_AddUnequipMenu) == 0x000010, "Wrong size on EquipSlotContextMenu_C_AddUnequipMenu");
static_assert(offsetof(EquipSlotContextMenu_C_AddUnequipMenu, EquipSlotWidget) == 0x000000, "Member 'EquipSlotContextMenu_C_AddUnequipMenu::EquipSlotWidget' has a wrong offset!");
static_assert(offsetof(EquipSlotContextMenu_C_AddUnequipMenu, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'EquipSlotContextMenu_C_AddUnequipMenu::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

