#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryContextMenuCondition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass InventoryContextMenuCondition.InventoryContextMenuCondition_C
// 0x0030 (0x00E8 - 0x00B8)
class UInventoryContextMenuCondition_C final : public UTLInventoryContextMenuObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EInvenModeType                                CurrentInvenMode;                                  // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLUserWidgetInvenSlot*                 CurrentInvenSlotWidget;                            // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITLItemViewInterface>  CurrentItemView;                                   // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ETLUIPlatform                                 UIPlatform;                                        // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPresetNum;                                  // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InventoryContextMenuCondition(int32 EntryPoint);
	void OnContextMenuShow(EInvenModeType InInvenModeType, class UTLUserWidgetItemSlot* InItemWidget, int32 InCurrentPresetNum, ETLUIPlatform UIPlatform_0);
	void ShowInventoryContextMenu();
	void AddEquipContextMenu();
	void AddCommonContextMenu();
	void ShowShopContextMenu();
	void AddUseContextMenu();
	void AddEnchantMenu();
	void ShowStorageContextMenu();
	void ShowCraftingContextMenu();
	void Show_Equip_Context_Menu();
	void Show_Enchant_Context_Menu();
	void Add_Compare_Other_Slot_Menu();
	void AddRegisterScrollMenu();
	void AddDecompositionMenu();
	void Add_Destruction_Menu();
	void AddCompositionMenu();
	void Add_Item_Collection_Menu();
	void AddAcquisitionMenu();
	void ShowDecompositionContextMenu();
	void Show_Collection_Context_Menu();
	void Add_Lock_Menu();
	void Add_PolymorphElixine_Menu();
	void AddTradeSellMenu();
	void AddTradeSearchMenu();
	void ShowTradeContextMenu();
	void AddSlotRegisterMenu();
	void ShowDestructionContextMenu();
	void Add_UsageMenu();
	void AddAutoUseMenu();
	void AddChatShare();
	void AddItemTraitExtract();
	void AddTraitListMenu();
	void AddItemLotteryMenu();
	void AddItemRune();
	void AddRuneSocket();
	void ShowItemRubbingContextMenu();
	void AddItemRubbingMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InventoryContextMenuCondition_C">();
	}
	static class UInventoryContextMenuCondition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryContextMenuCondition_C>();
	}
};
static_assert(alignof(UInventoryContextMenuCondition_C) == 0x000008, "Wrong alignment on UInventoryContextMenuCondition_C");
static_assert(sizeof(UInventoryContextMenuCondition_C) == 0x0000E8, "Wrong size on UInventoryContextMenuCondition_C");
static_assert(offsetof(UInventoryContextMenuCondition_C, UberGraphFrame) == 0x0000B8, "Member 'UInventoryContextMenuCondition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInventoryContextMenuCondition_C, CurrentInvenMode) == 0x0000C0, "Member 'UInventoryContextMenuCondition_C::CurrentInvenMode' has a wrong offset!");
static_assert(offsetof(UInventoryContextMenuCondition_C, CurrentInvenSlotWidget) == 0x0000C8, "Member 'UInventoryContextMenuCondition_C::CurrentInvenSlotWidget' has a wrong offset!");
static_assert(offsetof(UInventoryContextMenuCondition_C, CurrentItemView) == 0x0000D0, "Member 'UInventoryContextMenuCondition_C::CurrentItemView' has a wrong offset!");
static_assert(offsetof(UInventoryContextMenuCondition_C, UIPlatform) == 0x0000E0, "Member 'UInventoryContextMenuCondition_C::UIPlatform' has a wrong offset!");
static_assert(offsetof(UInventoryContextMenuCondition_C, CurrentPresetNum) == 0x0000E4, "Member 'UInventoryContextMenuCondition_C::CurrentPresetNum' has a wrong offset!");

}

