#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NCETSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct NCETSettings.SequenceDynamicParamDefaultKeyNameSetting
// 0x0020 (0x0020 - 0x0000)
struct FSequenceDynamicParamDefaultKeyNameSetting final
{
public:
	class FString                                 DefaultParamPath;                                  // 0x0000(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultKeyName;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSequenceDynamicParamDefaultKeyNameSetting) == 0x000008, "Wrong alignment on FSequenceDynamicParamDefaultKeyNameSetting");
static_assert(sizeof(FSequenceDynamicParamDefaultKeyNameSetting) == 0x000020, "Wrong size on FSequenceDynamicParamDefaultKeyNameSetting");
static_assert(offsetof(FSequenceDynamicParamDefaultKeyNameSetting, DefaultParamPath) == 0x000000, "Member 'FSequenceDynamicParamDefaultKeyNameSetting::DefaultParamPath' has a wrong offset!");
static_assert(offsetof(FSequenceDynamicParamDefaultKeyNameSetting, DefaultKeyName) == 0x000010, "Member 'FSequenceDynamicParamDefaultKeyNameSetting::DefaultKeyName' has a wrong offset!");

// ScriptStruct NCETSettings.LangagueInfo
// 0x0020 (0x0020 - 0x0000)
struct FLangagueInfo final
{
public:
	class FString                                 LanguageName;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      ParseFilePaths;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLangagueInfo) == 0x000008, "Wrong alignment on FLangagueInfo");
static_assert(sizeof(FLangagueInfo) == 0x000020, "Wrong size on FLangagueInfo");
static_assert(offsetof(FLangagueInfo, LanguageName) == 0x000000, "Member 'FLangagueInfo::LanguageName' has a wrong offset!");
static_assert(offsetof(FLangagueInfo, ParseFilePaths) == 0x000010, "Member 'FLangagueInfo::ParseFilePaths' has a wrong offset!");

}

