#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NcPublishingSdk

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class NcPublishingSdk.NcAgsAuthAPI
// 0x0000 (0x0028 - 0x0028)
class UNcAgsAuthAPI final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NcAgsAuthAPI">();
	}
	static class UNcAgsAuthAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNcAgsAuthAPI>();
	}
};
static_assert(alignof(UNcAgsAuthAPI) == 0x000008, "Wrong alignment on UNcAgsAuthAPI");
static_assert(sizeof(UNcAgsAuthAPI) == 0x000028, "Wrong size on UNcAgsAuthAPI");

// Class NcPublishingSdk.NcAgsPaymentAPI
// 0x0000 (0x0028 - 0x0028)
class UNcAgsPaymentAPI final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NcAgsPaymentAPI">();
	}
	static class UNcAgsPaymentAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNcAgsPaymentAPI>();
	}
};
static_assert(alignof(UNcAgsPaymentAPI) == 0x000008, "Wrong alignment on UNcAgsPaymentAPI");
static_assert(sizeof(UNcAgsPaymentAPI) == 0x000028, "Wrong size on UNcAgsPaymentAPI");

// Class NcPublishingSdk.TLAgsUserAPI
// 0x0000 (0x0028 - 0x0028)
class UTLAgsUserAPI final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLAgsUserAPI">();
	}
	static class UTLAgsUserAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLAgsUserAPI>();
	}
};
static_assert(alignof(UTLAgsUserAPI) == 0x000008, "Wrong alignment on UTLAgsUserAPI");
static_assert(sizeof(UTLAgsUserAPI) == 0x000028, "Wrong size on UTLAgsUserAPI");

}

