#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NinjaLiveFunctions

#include "Basic.hpp"

#include "NinjaPreset_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SimPrecision_Enum_structs.hpp"
#include "RenderTargetListItem_structs.hpp"


namespace SDK::Params
{

// Function NinjaLiveFunctions.NinjaLiveFunctions_C.TraceMouse
// 0x03C0 (0x03C0 - 0x0000)
struct NinjaLiveFunctions_C_TraceMouse final
{
public:
	class UObject*                                HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TouchSensitive;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         FingerIndex;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               TraceChannel;                                      // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         FluidNinjaLIVEActors;                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HitUV;                                             // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SimHitByMouse;                                     // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MouseClickValid;                                   // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TouchValid;                                        // 0x003A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetHitResultUnderCursorByChannel_HitResult; // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GetHitResultUnderCursorByChannel_ReturnValue; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetHitResultUnderFingerByChannel_HitResult; // 0x00F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GetHitResultUnderFingerByChannel_ReturnValue; // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Select_Default;                             // 0x017C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0288(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_FindCollisionUV_UV;                       // 0x0394(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCollisionUV_ReturnValue;              // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x03AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLiveFunctions_C_TraceMouse) == 0x000008, "Wrong alignment on NinjaLiveFunctions_C_TraceMouse");
static_assert(sizeof(NinjaLiveFunctions_C_TraceMouse) == 0x0003C0, "Wrong size on NinjaLiveFunctions_C_TraceMouse");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, HitComponent) == 0x000000, "Member 'NinjaLiveFunctions_C_TraceMouse::HitComponent' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, TouchSensitive) == 0x000008, "Member 'NinjaLiveFunctions_C_TraceMouse::TouchSensitive' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, FingerIndex) == 0x000009, "Member 'NinjaLiveFunctions_C_TraceMouse::FingerIndex' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, TraceChannel) == 0x00000A, "Member 'NinjaLiveFunctions_C_TraceMouse::TraceChannel' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, FluidNinjaLIVEActors) == 0x000010, "Member 'NinjaLiveFunctions_C_TraceMouse::FluidNinjaLIVEActors' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, __WorldContext) == 0x000020, "Member 'NinjaLiveFunctions_C_TraceMouse::__WorldContext' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, HitUV) == 0x000028, "Member 'NinjaLiveFunctions_C_TraceMouse::HitUV' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, SimHitByMouse) == 0x000038, "Member 'NinjaLiveFunctions_C_TraceMouse::SimHitByMouse' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, MouseClickValid) == 0x000039, "Member 'NinjaLiveFunctions_C_TraceMouse::MouseClickValid' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, TouchValid) == 0x00003A, "Member 'NinjaLiveFunctions_C_TraceMouse::TouchValid' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, Temp_bool_Variable) == 0x00003B, "Member 'NinjaLiveFunctions_C_TraceMouse::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_GetHitResultUnderCursorByChannel_HitResult) == 0x000048, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_GetHitResultUnderCursorByChannel_HitResult' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_GetHitResultUnderCursorByChannel_ReturnValue) == 0x0000D0, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_GetHitResultUnderCursorByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000D8, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_GetValidValue_ReturnValue) == 0x0000E0, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E4, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_GetHitResultUnderFingerByChannel_HitResult) == 0x0000F0, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_GetHitResultUnderFingerByChannel_HitResult' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_GetHitResultUnderFingerByChannel_ReturnValue) == 0x000178, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_GetHitResultUnderFingerByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, K2Node_Select_Default) == 0x00017C, "Member 'NinjaLiveFunctions_C_TraceMouse::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_bBlockingHit) == 0x000204, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_bInitialOverlap) == 0x000205, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Time) == 0x000208, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Distance) == 0x00020C, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Location) == 0x000210, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_ImpactPoint) == 0x00021C, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Normal) == 0x000228, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_ImpactNormal) == 0x000234, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_PhysMat) == 0x000240, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitActor) == 0x000248, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitComponent) == 0x000250, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitBoneName) == 0x000258, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitItem) == 0x000260, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_ElementIndex) == 0x000264, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_FaceIndex) == 0x000268, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_TraceStart) == 0x00026C, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_TraceEnd) == 0x000278, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000284, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_LineTraceSingle_OutHit) == 0x000288, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_LineTraceSingle_ReturnValue) == 0x000310, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BooleanOR_ReturnValue) == 0x000311, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000312, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000313, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Time_1) == 0x000314, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Distance_1) == 0x000318, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Location_1) == 0x00031C, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000328, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_Normal_1) == 0x000334, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000340, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_PhysMat_1) == 0x000350, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitActor_1) == 0x000358, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitComponent_1) == 0x000360, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitBoneName_1) == 0x000368, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_HitItem_1) == 0x000370, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_ElementIndex_1) == 0x000374, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_FaceIndex_1) == 0x000378, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_TraceStart_1) == 0x00037C, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_BreakHitResult_TraceEnd_1) == 0x000388, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_FindCollisionUV_UV) == 0x000394, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_FindCollisionUV_UV' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_FindCollisionUV_ReturnValue) == 0x00039C, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_FindCollisionUV_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_IsValid_ReturnValue) == 0x00039D, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x0003A0, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceMouse, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0003AC, "Member 'NinjaLiveFunctions_C_TraceMouse::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function NinjaLiveFunctions.NinjaLiveFunctions_C.TraceOverlap
// 0x01B0 (0x01B0 - 0x0000)
struct NinjaLiveFunctions_C_TraceOverlap final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TracelineOvershoot;                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               TraceChannel;                                      // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         FluidNinjaLIVEActors;                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HitUV;                                             // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TracePosition;                                     // 0x0048(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0078(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_FindCollisionUV_UV;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCollisionUV_ReturnValue;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLiveFunctions_C_TraceOverlap) == 0x000008, "Wrong alignment on NinjaLiveFunctions_C_TraceOverlap");
static_assert(sizeof(NinjaLiveFunctions_C_TraceOverlap) == 0x0001B0, "Wrong size on NinjaLiveFunctions_C_TraceOverlap");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, Start) == 0x000000, "Member 'NinjaLiveFunctions_C_TraceOverlap::Start' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, End) == 0x00000C, "Member 'NinjaLiveFunctions_C_TraceOverlap::End' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, TracelineOvershoot) == 0x000018, "Member 'NinjaLiveFunctions_C_TraceOverlap::TracelineOvershoot' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, TraceChannel) == 0x00001C, "Member 'NinjaLiveFunctions_C_TraceOverlap::TraceChannel' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, FluidNinjaLIVEActors) == 0x000020, "Member 'NinjaLiveFunctions_C_TraceOverlap::FluidNinjaLIVEActors' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, __WorldContext) == 0x000030, "Member 'NinjaLiveFunctions_C_TraceOverlap::__WorldContext' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, HitUV) == 0x000038, "Member 'NinjaLiveFunctions_C_TraceOverlap::HitUV' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, TracePosition) == 0x000048, "Member 'NinjaLiveFunctions_C_TraceOverlap::TracePosition' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000054, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000060, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_Add_VectorVector_ReturnValue) == 0x00006C, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_LineTraceSingle_OutHit) == 0x000078, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_LineTraceSingle_ReturnValue) == 0x000100, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_bBlockingHit) == 0x000101, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_bInitialOverlap) == 0x000102, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_Time) == 0x000104, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_Distance) == 0x000108, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_Location) == 0x00010C, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_ImpactPoint) == 0x000118, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_Normal) == 0x000124, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_ImpactNormal) == 0x000130, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_PhysMat) == 0x000140, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_HitActor) == 0x000148, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_HitComponent) == 0x000150, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_HitBoneName) == 0x000158, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_HitItem) == 0x000160, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_ElementIndex) == 0x000164, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_FaceIndex) == 0x000168, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_TraceStart) == 0x00016C, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_BreakHitResult_TraceEnd) == 0x000178, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_IsValid_ReturnValue) == 0x000184, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_FindCollisionUV_UV) == 0x000188, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_FindCollisionUV_UV' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_FindCollisionUV_ReturnValue) == 0x000190, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_FindCollisionUV_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000194, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_TraceOverlap, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0001A0, "Member 'NinjaLiveFunctions_C_TraceOverlap::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function NinjaLiveFunctions.NinjaLiveFunctions_C.PresetLoader
// 0x0538 (0x0538 - 0x0000)
struct NinjaLiveFunctions_C_PresetLoader final
{
public:
	class FString                                 PresetName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           AssetPath;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   AssetTrimmedName;                                  // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForcePreferredPreset;                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             PreferredPreset;                                   // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             LoadedDataTable;                                   // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LoadedDataTablePath;                               // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, float>                    PresetMap;                                         // 0x0058(0x0050)(Parm, OutParm)
	TMap<class FString, float>                    PresetMapTemp;                                     // 0x00A8(0x0050)(Edit, BlueprintVisible)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FAssetData>                     K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             K2Node_MakeSet_Set;                                // 0x0170(0x0050)()
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x01C0(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x01D0(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARFilter                              K2Node_MakeStruct_ARFilter;                        // 0x01E8(0x00F0)()
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     CallFunc_GetAssets_OutAssetData;                   // 0x02F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetAssets_ReturnValue;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     K2Node_Select_Default;                             // 0x0310(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAssetData                             CallFunc_Array_Get_Item;                           // 0x0328(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table;                   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_Select_Default_1;                           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_CreateAssetData_ReturnValue;              // 0x03B0(0x0060)(HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0410(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FNinjaPreset                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0468(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_CreateAssetData_ReturnValue_1;            // 0x04A8(0x0060)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_1;         // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NinjaLiveFunctions_C_PresetLoader) == 0x000008, "Wrong alignment on NinjaLiveFunctions_C_PresetLoader");
static_assert(sizeof(NinjaLiveFunctions_C_PresetLoader) == 0x000538, "Wrong size on NinjaLiveFunctions_C_PresetLoader");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, PresetName) == 0x000000, "Member 'NinjaLiveFunctions_C_PresetLoader::PresetName' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, AssetPath) == 0x000010, "Member 'NinjaLiveFunctions_C_PresetLoader::AssetPath' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, AssetTrimmedName) == 0x000020, "Member 'NinjaLiveFunctions_C_PresetLoader::AssetTrimmedName' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, ForcePreferredPreset) == 0x000028, "Member 'NinjaLiveFunctions_C_PresetLoader::ForcePreferredPreset' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, PreferredPreset) == 0x000030, "Member 'NinjaLiveFunctions_C_PresetLoader::PreferredPreset' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, __WorldContext) == 0x000038, "Member 'NinjaLiveFunctions_C_PresetLoader::__WorldContext' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, LoadedDataTable) == 0x000040, "Member 'NinjaLiveFunctions_C_PresetLoader::LoadedDataTable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, LoadedDataTablePath) == 0x000048, "Member 'NinjaLiveFunctions_C_PresetLoader::LoadedDataTablePath' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, PresetMap) == 0x000058, "Member 'NinjaLiveFunctions_C_PresetLoader::PresetMap' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, PresetMapTemp) == 0x0000A8, "Member 'NinjaLiveFunctions_C_PresetLoader::PresetMapTemp' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Conv_NameToString_ReturnValue) == 0x0000F8, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Concat_StrStr_ReturnValue) == 0x000108, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000118, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000128, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, Temp_int_Array_Index_Variable) == 0x000138, "Member 'NinjaLiveFunctions_C_PresetLoader::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000140, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, K2Node_MakeArray_Array) == 0x000150, "Member 'NinjaLiveFunctions_C_PresetLoader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'NinjaLiveFunctions_C_PresetLoader::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, Temp_int_Array_Index_Variable_1) == 0x000164, "Member 'NinjaLiveFunctions_C_PresetLoader::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, Temp_bool_Variable) == 0x00016C, "Member 'NinjaLiveFunctions_C_PresetLoader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, K2Node_MakeSet_Set) == 0x000170, "Member 'NinjaLiveFunctions_C_PresetLoader::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, K2Node_MakeArray_Array_1) == 0x0001C0, "Member 'NinjaLiveFunctions_C_PresetLoader::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, K2Node_MakeArray_Array_2) == 0x0001D0, "Member 'NinjaLiveFunctions_C_PresetLoader::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, Temp_bool_Variable_1) == 0x0001E0, "Member 'NinjaLiveFunctions_C_PresetLoader::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, K2Node_MakeStruct_ARFilter) == 0x0001E8, "Member 'NinjaLiveFunctions_C_PresetLoader::K2Node_MakeStruct_ARFilter' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_GetAssetRegistry_ReturnValue) == 0x0002D8, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, Temp_int_Loop_Counter_Variable_1) == 0x0002E8, "Member 'NinjaLiveFunctions_C_PresetLoader::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_GetAssets_OutAssetData) == 0x0002F0, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_GetAssets_OutAssetData' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_GetAssets_ReturnValue) == 0x000300, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_GetAssets_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Array_Length_ReturnValue) == 0x000304, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLiveFunctions_C_PresetLoader, CallFunc_Add_IntInt_ReturnValue_1) == 0x000308, "Member 'NinjaLiveFunctions_C_PresetLoader::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
