#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NinjaLive_PresetManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "NinjaPreset_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.ExecuteUbergraph_NinjaLive_PresetManager
// 0x03E8 (0x03E8 - 0x0000)
struct NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANinjaLive_C*                           K2Node_DynamicCast_AsNinja_Live;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ANinjaLive_MemoryPoolManager_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0058(0x0010)(ReferenceParm)
	class ANinjaLive_MemoryPoolManager_C*         CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0078(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_Event_InputTable;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_InputData;                            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNinjaLiveGUI_C*                        CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x00D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool SavePaintBuffer)>         K2Node_CreateDelegate_OutputDelegate;              // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0110(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertToPowerOfTwo_Out;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_Map_Find_Value;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x0190(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_Map_Find_Value_1;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_2;          // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_3;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_4;          // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_SavePaintBuffer;                // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_Select_Default_1;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0220(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_2;                           // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_RenderTargetExportSingle_SavedAssetPath;  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_RenderTargetExportSingle_SavedAssetData;  // 0x0290(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x02F8(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNinjaLiveComponent_C*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANinjaLive_C*                           K2Node_DynamicCast_AsNinja_Live_1;                 // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0350(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_2;                            // 0x0368(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x0380(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x03A8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_SelectObject_ReturnValue;                 // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNinjaLiveGUI_C*                        K2Node_DynamicCast_AsNinja_Live_GUI;               // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNinjaLiveComponent_C*                  CallFunc_GetComponentByClass_ReturnValue_1;        // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager");
static_assert(sizeof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager) == 0x0003E8, "Wrong size on NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, EntryPoint) == 0x000000, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_InputKeyEvent_Key_4) == 0x000008, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_struct_Variable) == 0x000020, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_MakeLiteralBool_ReturnValue) == 0x000038, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_DynamicCast_AsNinja_Live) == 0x000048, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_DynamicCast_AsNinja_Live' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Array_Find_ReturnValue) == 0x000054, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000058, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Array_Get_Item) == 0x000068, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_IsValid_ReturnValue_1) == 0x000074, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000075, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_InputKeyEvent_Key_5) == 0x000078, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_BooleanOR_ReturnValue) == 0x000090, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_Event_InputTable) == 0x000098, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_Event_InputTable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_Event_InputData) == 0x0000A0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_Event_InputData' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000C0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_MakeLiteralString_ReturnValue) == 0x0000C8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_GetAllActorsWithInterface_OutActors) == 0x0000D8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_bool_Variable) == 0x0000F8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_CreateDelegate_OutputDelegate) == 0x0000FC, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_int_Variable) == 0x00010C, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_string_Variable) == 0x000110, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_IsValid_ReturnValue_2) == 0x000120, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000124, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Conv_IntToString_ReturnValue) == 0x000128, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Conv_StringToName_ReturnValue) == 0x000138, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_LeftChop_ReturnValue) == 0x000140, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Min_ReturnValue) == 0x000150, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Concat_StrStr_ReturnValue) == 0x000158, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_ConvertToPowerOfTwo_Out) == 0x000168, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_ConvertToPowerOfTwo_Out' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000170, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000178, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Map_Find_Value) == 0x000180, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Map_Find_ReturnValue) == 0x000188, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_string_Variable_1) == 0x000190, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0001A0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Map_Find_Value_1) == 0x0001A8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Map_Find_ReturnValue_1) == 0x0001B0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_MakeLiteralString_ReturnValue_1) == 0x0001B8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_MakeLiteralString_ReturnValue_2) == 0x0001C8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_MakeLiteralString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_MakeLiteralString_ReturnValue_3) == 0x0001D8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_MakeLiteralString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_MakeLiteralString_ReturnValue_4) == 0x0001E8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_MakeLiteralString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_bool_Variable_1) == 0x0001F8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_CustomEvent_SavePaintBuffer) == 0x0001F9, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_CustomEvent_SavePaintBuffer' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_Select_Default) == 0x000200, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_Select_Default_1) == 0x000208, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_SelectString_ReturnValue) == 0x000210, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_struct_Variable_1) == 0x000220, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_int_Variable_1) == 0x000238, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_IsInViewport_ReturnValue) == 0x00023C, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_Select_Default_2) == 0x000240, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000250, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000260, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000270, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000278, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_RenderTargetExportSingle_SavedAssetPath) == 0x000288, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_RenderTargetExportSingle_SavedAssetPath' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_RenderTargetExportSingle_SavedAssetData) == 0x000290, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_RenderTargetExportSingle_SavedAssetData' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002F0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Add_IntInt_ReturnValue) == 0x0002F4, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_InputKeyEvent_Key) == 0x0002F8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_int_Array_Index_Variable) == 0x000310, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Array_Get_Item_2) == 0x000318, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Array_Add_ReturnValue) == 0x000320, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_GetComponentByClass_ReturnValue) == 0x000328, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_IsValid_ReturnValue_3) == 0x000330, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_GetOwner_ReturnValue) == 0x000338, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_DynamicCast_AsNinja_Live_1) == 0x000340, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_DynamicCast_AsNinja_Live_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_DynamicCast_bSuccess_1) == 0x000348, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_InputKeyEvent_Key_1) == 0x000350, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_struct_Variable_2) == 0x000368, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_InputKeyEvent_Key_2) == 0x000380, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, Temp_int_Loop_Counter_Variable) == 0x000398, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Less_IntInt_ReturnValue) == 0x00039C, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003A0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_InputKeyEvent_Key_3) == 0x0003A8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_IsValid_ReturnValue_4) == 0x0003C0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_SelectObject_ReturnValue) == 0x0003C8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_SelectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_DynamicCast_AsNinja_Live_GUI) == 0x0003D0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_DynamicCast_AsNinja_Live_GUI' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, K2Node_DynamicCast_bSuccess_2) == 0x0003D8, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0003E0, "Member 'NinjaLive_PresetManager_C_ExecuteUbergraph_NinjaLive_PresetManager::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.OnDensityMapSave
// 0x0001 (0x0001 - 0x0000)
struct NinjaLive_PresetManager_C_OnDensityMapSave final
{
public:
	bool                                          SavePaintBuffer;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NinjaLive_PresetManager_C_OnDensityMapSave) == 0x000001, "Wrong alignment on NinjaLive_PresetManager_C_OnDensityMapSave");
static_assert(sizeof(NinjaLive_PresetManager_C_OnDensityMapSave) == 0x000001, "Wrong size on NinjaLive_PresetManager_C_OnDensityMapSave");
static_assert(offsetof(NinjaLive_PresetManager_C_OnDensityMapSave, SavePaintBuffer) == 0x000000, "Member 'NinjaLive_PresetManager_C_OnDensityMapSave::SavePaintBuffer' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.WriteDataTableFunction
// 0x0018 (0x0018 - 0x0000)
struct NinjaLive_PresetManager_C_WriteDataTableFunction final
{
public:
	class UDataTable*                             InputTable;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InputData;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_WriteDataTableFunction) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_WriteDataTableFunction");
static_assert(sizeof(NinjaLive_PresetManager_C_WriteDataTableFunction) == 0x000018, "Wrong size on NinjaLive_PresetManager_C_WriteDataTableFunction");
static_assert(offsetof(NinjaLive_PresetManager_C_WriteDataTableFunction, InputTable) == 0x000000, "Member 'NinjaLive_PresetManager_C_WriteDataTableFunction::InputTable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_WriteDataTableFunction, InputData) == 0x000008, "Member 'NinjaLive_PresetManager_C_WriteDataTableFunction::InputData' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NinjaLive_PresetManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_ReceiveTick) == 0x000004, "Wrong alignment on NinjaLive_PresetManager_C_ReceiveTick");
static_assert(sizeof(NinjaLive_PresetManager_C_ReceiveTick) == 0x000004, "Wrong size on NinjaLive_PresetManager_C_ReceiveTick");
static_assert(offsetof(NinjaLive_PresetManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'NinjaLive_PresetManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0");
static_assert(sizeof(NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0");
static_assert(offsetof(NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1");
static_assert(sizeof(NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1");
static_assert(offsetof(NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'NinjaLive_PresetManager_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2");
static_assert(sizeof(NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2");
static_assert(offsetof(NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3");
static_assert(sizeof(NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3");
static_assert(offsetof(NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'NinjaLive_PresetManager_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4");
static_assert(sizeof(NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4");
static_assert(offsetof(NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5");
static_assert(sizeof(NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5");
static_assert(offsetof(NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'NinjaLive_PresetManager_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.SetAssetNameAndPath
// 0x0128 (0x0128 - 0x0000)
struct NinjaLive_PresetManager_C_SetAssetNameAndPath final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AssetTrimmedName;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AssetPath;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftClassReferenceToString_ReturnValue; // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0080(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_FindSoftReferencesToObject_ReferencingObjects; // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_Select_Default;                             // 0x00B0(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_CreateAssetData_ReturnValue;              // 0x00C8(0x0060)(HasGetValueTypeHash)
};
static_assert(alignof(NinjaLive_PresetManager_C_SetAssetNameAndPath) == 0x000008, "Wrong alignment on NinjaLive_PresetManager_C_SetAssetNameAndPath");
static_assert(sizeof(NinjaLive_PresetManager_C_SetAssetNameAndPath) == 0x000128, "Wrong size on NinjaLive_PresetManager_C_SetAssetNameAndPath");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, Object) == 0x000000, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::Object' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, AssetTrimmedName) == 0x000008, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::AssetTrimmedName' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, AssetPath) == 0x000010, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::AssetPath' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, Temp_bool_Variable) == 0x000018, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, K2Node_MakeArray_Array) == 0x000028, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000038, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_Conv_SoftClassReferenceToString_ReturnValue) == 0x000060, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_Conv_SoftClassReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_LeftChop_ReturnValue) == 0x000070, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000080, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_FindSoftReferencesToObject_ReferencingObjects) == 0x000098, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_FindSoftReferencesToObject_ReferencingObjects' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, K2Node_Select_Default) == 0x0000B0, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NinjaLive_PresetManager_C_SetAssetNameAndPath, CallFunc_CreateAssetData_ReturnValue) == 0x0000C8, "Member 'NinjaLive_PresetManager_C_SetAssetNameAndPath::CallFunc_CreateAssetData_ReturnValue' has a wrong offset!");

// Function NinjaLive_PresetManager.NinjaLive_PresetManager_C.RenderTargetExportSingle
// 0x02E8 (0x02E8 - 0x0000)
struct NinjaLive_PresetManager_C_RenderTargetExportSingle final
{
public:
