#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Polymorph_Ground_Usurper_Common

#include "Basic.hpp"


namespace SDK::Params
{

// Function Polymorph_Ground_Usurper_Common.SequenceDirector_C.Call OnTransformedIn_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_Call_OnTransformedIn_0 final
{
public:
	class ATLScenarioActor*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SequenceDirector_C_Call_OnTransformedIn_0) == 0x000008, "Wrong alignment on SequenceDirector_C_Call_OnTransformedIn_0");
static_assert(sizeof(SequenceDirector_C_Call_OnTransformedIn_0) == 0x000008, "Wrong size on SequenceDirector_C_Call_OnTransformedIn_0");
static_assert(offsetof(SequenceDirector_C_Call_OnTransformedIn_0, Target) == 0x000000, "Member 'SequenceDirector_C_Call_OnTransformedIn_0::Target' has a wrong offset!");

// Function Polymorph_Ground_Usurper_Common.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0 final
{
public:
	class ATLScenarioActor*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0) == 0x000008, "Wrong alignment on SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0");
static_assert(sizeof(SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0) == 0x000008, "Wrong size on SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0");
static_assert(offsetof(SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0, Target) == 0x000000, "Member 'SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0::Target' has a wrong offset!");

}

