#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurpleCommunitySdk

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct PurpleCommunitySdk.AttachmentMetaData
// 0x0008 (0x0008 - 0x0000)
struct FAttachmentMetaData final
{
public:
	int32                                         PlayTime;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FileSize;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAttachmentMetaData) == 0x000004, "Wrong alignment on FAttachmentMetaData");
static_assert(sizeof(FAttachmentMetaData) == 0x000008, "Wrong size on FAttachmentMetaData");
static_assert(offsetof(FAttachmentMetaData, PlayTime) == 0x000000, "Member 'FAttachmentMetaData::PlayTime' has a wrong offset!");
static_assert(offsetof(FAttachmentMetaData, FileSize) == 0x000004, "Member 'FAttachmentMetaData::FileSize' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.AttachmentInfo
// 0x0028 (0x0028 - 0x0000)
struct FAttachmentInfo final
{
public:
	class FString                                 FileUrl;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttachmentMetaData                    MetadataInfo;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAttachmentInfo) == 0x000008, "Wrong alignment on FAttachmentInfo");
static_assert(sizeof(FAttachmentInfo) == 0x000028, "Wrong size on FAttachmentInfo");
static_assert(offsetof(FAttachmentInfo, FileUrl) == 0x000000, "Member 'FAttachmentInfo::FileUrl' has a wrong offset!");
static_assert(offsetof(FAttachmentInfo, Type) == 0x000010, "Member 'FAttachmentInfo::Type' has a wrong offset!");
static_assert(offsetof(FAttachmentInfo, MetadataInfo) == 0x000020, "Member 'FAttachmentInfo::MetadataInfo' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.GameRoomKeyInfo
// 0x0030 (0x0030 - 0x0000)
struct FGameRoomKeyInfo final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerKey;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomKey;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGameRoomKeyInfo) == 0x000008, "Wrong alignment on FGameRoomKeyInfo");
static_assert(sizeof(FGameRoomKeyInfo) == 0x000030, "Wrong size on FGameRoomKeyInfo");
static_assert(offsetof(FGameRoomKeyInfo, Type) == 0x000000, "Member 'FGameRoomKeyInfo::Type' has a wrong offset!");
static_assert(offsetof(FGameRoomKeyInfo, ServerKey) == 0x000010, "Member 'FGameRoomKeyInfo::ServerKey' has a wrong offset!");
static_assert(offsetof(FGameRoomKeyInfo, RoomKey) == 0x000020, "Member 'FGameRoomKeyInfo::RoomKey' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.Original
// 0x0010 (0x0010 - 0x0000)
struct FOriginal final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOriginal) == 0x000008, "Wrong alignment on FOriginal");
static_assert(sizeof(FOriginal) == 0x000010, "Wrong size on FOriginal");
static_assert(offsetof(FOriginal, Value) == 0x000000, "Member 'FOriginal::Value' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.Replaced
// 0x0010 (0x0010 - 0x0000)
struct FReplaced final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FReplaced) == 0x000008, "Wrong alignment on FReplaced");
static_assert(sizeof(FReplaced) == 0x000010, "Wrong size on FReplaced");
static_assert(offsetof(FReplaced, Value) == 0x000000, "Member 'FReplaced::Value' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.ReplacedMessageInfo
// 0x0030 (0x0030 - 0x0000)
struct FReplacedMessageInfo final
{
public:
	struct FOriginal                              Original;                                          // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FReplaced                              Replaced;                                          // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 AdditionalData;                                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FReplacedMessageInfo) == 0x000008, "Wrong alignment on FReplacedMessageInfo");
static_assert(sizeof(FReplacedMessageInfo) == 0x000030, "Wrong size on FReplacedMessageInfo");
static_assert(offsetof(FReplacedMessageInfo, Original) == 0x000000, "Member 'FReplacedMessageInfo::Original' has a wrong offset!");
static_assert(offsetof(FReplacedMessageInfo, Replaced) == 0x000010, "Member 'FReplacedMessageInfo::Replaced' has a wrong offset!");
static_assert(offsetof(FReplacedMessageInfo, AdditionalData) == 0x000020, "Member 'FReplacedMessageInfo::AdditionalData' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.ExternalAccount
// 0x0020 (0x0020 - 0x0000)
struct FExternalAccount final
{
public:
	class FString                                 AuthProviderCode;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExternalAccountKey;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExternalAccount) == 0x000008, "Wrong alignment on FExternalAccount");
static_assert(sizeof(FExternalAccount) == 0x000020, "Wrong size on FExternalAccount");
static_assert(offsetof(FExternalAccount, AuthProviderCode) == 0x000000, "Member 'FExternalAccount::AuthProviderCode' has a wrong offset!");
static_assert(offsetof(FExternalAccount, ExternalAccountKey) == 0x000010, "Member 'FExternalAccount::ExternalAccountKey' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.BaseNotification
// 0x0250 (0x0250 - 0x0000)
struct FBaseNotification
{
public:
	class FString                                 Guid;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seq;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RoomId;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameUserId;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayNcCharId;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReceiverCharacterId;                               // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReceiverUserName;                                  // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReceiverServerId;                                  // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Alias;                                             // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClassId;                                           // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClassName;                                         // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasCastle;                                         // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Ranking;                                           // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubType;                                           // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Attribute;                                         // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Optional;                                          // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameRoomKeyInfo                       GameRoomKeyInfo;                                   // 0x0130(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 Role;                                              // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFromGame;                                        // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SenderGameCode;                                    // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CastleNo;                                          // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GuildId;                                           // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReceiverGameCode;                                  // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasReplacedContent;                                // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FReplacedMessageInfo>           ReplacedMessageInfoList;                           // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 DateCreated;                                       // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x01D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttachmentInfo                        AttachmentInfo;                                    // 0x0208(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FExternalAccount>               ExternalAccounts;                                  // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InitialContent;                                    // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseNotification) == 0x000008, "Wrong alignment on FBaseNotification");
static_assert(sizeof(FBaseNotification) == 0x000250, "Wrong size on FBaseNotification");
static_assert(offsetof(FBaseNotification, Guid) == 0x000000, "Member 'FBaseNotification::Guid' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Seq) == 0x000010, "Member 'FBaseNotification::Seq' has a wrong offset!");
static_assert(offsetof(FBaseNotification, RoomId) == 0x000018, "Member 'FBaseNotification::RoomId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, GameUserId) == 0x000028, "Member 'FBaseNotification::GameUserId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, PlayNcCharId) == 0x000038, "Member 'FBaseNotification::PlayNcCharId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, UserName) == 0x000048, "Member 'FBaseNotification::UserName' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ServerId) == 0x000058, "Member 'FBaseNotification::ServerId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ReceiverCharacterId) == 0x000068, "Member 'FBaseNotification::ReceiverCharacterId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ReceiverUserName) == 0x000078, "Member 'FBaseNotification::ReceiverUserName' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ReceiverServerId) == 0x000088, "Member 'FBaseNotification::ReceiverServerId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Alias) == 0x000098, "Member 'FBaseNotification::Alias' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ClassId) == 0x0000A8, "Member 'FBaseNotification::ClassId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ClassName) == 0x0000B8, "Member 'FBaseNotification::ClassName' has a wrong offset!");
static_assert(offsetof(FBaseNotification, HasCastle) == 0x0000C8, "Member 'FBaseNotification::HasCastle' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Ranking) == 0x0000CC, "Member 'FBaseNotification::Ranking' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Gender) == 0x0000D0, "Member 'FBaseNotification::Gender' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Type) == 0x0000E0, "Member 'FBaseNotification::Type' has a wrong offset!");
static_assert(offsetof(FBaseNotification, SubType) == 0x0000F0, "Member 'FBaseNotification::SubType' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Content) == 0x000100, "Member 'FBaseNotification::Content' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Attribute) == 0x000110, "Member 'FBaseNotification::Attribute' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Optional) == 0x000120, "Member 'FBaseNotification::Optional' has a wrong offset!");
static_assert(offsetof(FBaseNotification, GameRoomKeyInfo) == 0x000130, "Member 'FBaseNotification::GameRoomKeyInfo' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Role) == 0x000160, "Member 'FBaseNotification::Role' has a wrong offset!");
static_assert(offsetof(FBaseNotification, IsFromGame) == 0x000170, "Member 'FBaseNotification::IsFromGame' has a wrong offset!");
static_assert(offsetof(FBaseNotification, SenderGameCode) == 0x000178, "Member 'FBaseNotification::SenderGameCode' has a wrong offset!");
static_assert(offsetof(FBaseNotification, CastleNo) == 0x000188, "Member 'FBaseNotification::CastleNo' has a wrong offset!");
static_assert(offsetof(FBaseNotification, GuildId) == 0x000190, "Member 'FBaseNotification::GuildId' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ReceiverGameCode) == 0x0001A0, "Member 'FBaseNotification::ReceiverGameCode' has a wrong offset!");
static_assert(offsetof(FBaseNotification, HasReplacedContent) == 0x0001B0, "Member 'FBaseNotification::HasReplacedContent' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ReplacedMessageInfoList) == 0x0001B8, "Member 'FBaseNotification::ReplacedMessageInfoList' has a wrong offset!");
static_assert(offsetof(FBaseNotification, DateCreated) == 0x0001C8, "Member 'FBaseNotification::DateCreated' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Language) == 0x0001D8, "Member 'FBaseNotification::Language' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Country) == 0x0001E8, "Member 'FBaseNotification::Country' has a wrong offset!");
static_assert(offsetof(FBaseNotification, Locale) == 0x0001F8, "Member 'FBaseNotification::Locale' has a wrong offset!");
static_assert(offsetof(FBaseNotification, AttachmentInfo) == 0x000208, "Member 'FBaseNotification::AttachmentInfo' has a wrong offset!");
static_assert(offsetof(FBaseNotification, ExternalAccounts) == 0x000230, "Member 'FBaseNotification::ExternalAccounts' has a wrong offset!");
static_assert(offsetof(FBaseNotification, InitialContent) == 0x000240, "Member 'FBaseNotification::InitialContent' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.NotificationVoice
// 0x0000 (0x0250 - 0x0250)
struct FNotificationVoice final : public FBaseNotification
{
};
static_assert(alignof(FNotificationVoice) == 0x000008, "Wrong alignment on FNotificationVoice");
static_assert(sizeof(FNotificationVoice) == 0x000250, "Wrong size on FNotificationVoice");

// ScriptStruct PurpleCommunitySdk.NotificationUpdateUserRole
// 0x0000 (0x0250 - 0x0250)
struct FNotificationUpdateUserRole final : public FBaseNotification
{
};
static_assert(alignof(FNotificationUpdateUserRole) == 0x000008, "Wrong alignment on FNotificationUpdateUserRole");
static_assert(sizeof(FNotificationUpdateUserRole) == 0x000250, "Wrong size on FNotificationUpdateUserRole");

// ScriptStruct PurpleCommunitySdk.GameUserInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FGameUserInfo final
{
public:
	class FString                                 GameUserId;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NpGameAccountId;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameCode;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterId;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterName;                                     // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClassId;                                           // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RankName;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Intro;                                             // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGameUserInfo) == 0x000008, "Wrong alignment on FGameUserInfo");
static_assert(sizeof(FGameUserInfo) == 0x0000A0, "Wrong size on FGameUserInfo");
static_assert(offsetof(FGameUserInfo, GameUserId) == 0x000000, "Member 'FGameUserInfo::GameUserId' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, NpGameAccountId) == 0x000010, "Member 'FGameUserInfo::NpGameAccountId' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, GameCode) == 0x000020, "Member 'FGameUserInfo::GameCode' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, ServerId) == 0x000030, "Member 'FGameUserInfo::ServerId' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, ServerName) == 0x000040, "Member 'FGameUserInfo::ServerName' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, CharacterId) == 0x000050, "Member 'FGameUserInfo::CharacterId' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, CharacterName) == 0x000060, "Member 'FGameUserInfo::CharacterName' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, ClassId) == 0x000070, "Member 'FGameUserInfo::ClassId' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, RankName) == 0x000080, "Member 'FGameUserInfo::RankName' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, Intro) == 0x000090, "Member 'FGameUserInfo::Intro' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.MessageInfo
// 0x0218 (0x0218 - 0x0000)
struct FMessageInfo final
{
public:
	class FString                                 Guid;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameUserId;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayNcCharId;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubType;                                           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Attribute;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Optional;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttachmentInfo                        AttachmentInfo;                                    // 0x0090(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          Deleted;                                           // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DateCreated;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameUserInfo                          GameUserInfo;                                      // 0x00D0(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         Seq;                                               // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserServerKey;                                     // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasReplacedContent;                                // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FReplacedMessageInfo>           ReplacedMessageInfoList;                           // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReceiverCharacterId;                               // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReceiverUserName;                                  // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFromGame;                                        // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FExternalAccount>               ExternalAccounts;                                  // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReceiverServerId;                                  // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMessageInfo) == 0x000008, "Wrong alignment on FMessageInfo");
static_assert(sizeof(FMessageInfo) == 0x000218, "Wrong size on FMessageInfo");
static_assert(offsetof(FMessageInfo, Guid) == 0x000000, "Member 'FMessageInfo::Guid' has a wrong offset!");
static_assert(offsetof(FMessageInfo, GameUserId) == 0x000010, "Member 'FMessageInfo::GameUserId' has a wrong offset!");
static_assert(offsetof(FMessageInfo, PlayNcCharId) == 0x000020, "Member 'FMessageInfo::PlayNcCharId' has a wrong offset!");
static_assert(offsetof(FMessageInfo, UserName) == 0x000030, "Member 'FMessageInfo::UserName' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Type) == 0x000040, "Member 'FMessageInfo::Type' has a wrong offset!");
static_assert(offsetof(FMessageInfo, SubType) == 0x000050, "Member 'FMessageInfo::SubType' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Content) == 0x000060, "Member 'FMessageInfo::Content' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Attribute) == 0x000070, "Member 'FMessageInfo::Attribute' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Optional) == 0x000080, "Member 'FMessageInfo::Optional' has a wrong offset!");
static_assert(offsetof(FMessageInfo, AttachmentInfo) == 0x000090, "Member 'FMessageInfo::AttachmentInfo' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Deleted) == 0x0000B8, "Member 'FMessageInfo::Deleted' has a wrong offset!");
static_assert(offsetof(FMessageInfo, DateCreated) == 0x0000C0, "Member 'FMessageInfo::DateCreated' has a wrong offset!");
static_assert(offsetof(FMessageInfo, GameUserInfo) == 0x0000D0, "Member 'FMessageInfo::GameUserInfo' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Seq) == 0x000170, "Member 'FMessageInfo::Seq' has a wrong offset!");
static_assert(offsetof(FMessageInfo, UserServerKey) == 0x000178, "Member 'FMessageInfo::UserServerKey' has a wrong offset!");
static_assert(offsetof(FMessageInfo, HasReplacedContent) == 0x000188, "Member 'FMessageInfo::HasReplacedContent' has a wrong offset!");
static_assert(offsetof(FMessageInfo, ReplacedMessageInfoList) == 0x000190, "Member 'FMessageInfo::ReplacedMessageInfoList' has a wrong offset!");
static_assert(offsetof(FMessageInfo, ReceiverCharacterId) == 0x0001A0, "Member 'FMessageInfo::ReceiverCharacterId' has a wrong offset!");
static_assert(offsetof(FMessageInfo, ReceiverUserName) == 0x0001B0, "Member 'FMessageInfo::ReceiverUserName' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Language) == 0x0001C0, "Member 'FMessageInfo::Language' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Locale) == 0x0001D0, "Member 'FMessageInfo::Locale' has a wrong offset!");
static_assert(offsetof(FMessageInfo, Country) == 0x0001E0, "Member 'FMessageInfo::Country' has a wrong offset!");
static_assert(offsetof(FMessageInfo, IsFromGame) == 0x0001F0, "Member 'FMessageInfo::IsFromGame' has a wrong offset!");
static_assert(offsetof(FMessageInfo, ExternalAccounts) == 0x0001F8, "Member 'FMessageInfo::ExternalAccounts' has a wrong offset!");
static_assert(offsetof(FMessageInfo, ReceiverServerId) == 0x000208, "Member 'FMessageInfo::ReceiverServerId' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.BaseRequest
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FBaseRequest
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBaseRequest) == 0x000008, "Wrong alignment on FBaseRequest");
static_assert(sizeof(FBaseRequest) == 0x000028, "Wrong size on FBaseRequest");

// ScriptStruct PurpleCommunitySdk.RequestStartVoiceChat
// 0x0058 (0x0080 - 0x0028)
struct FRequestStartVoiceChat final : public FBaseRequest
{
public:
	struct FGameRoomKeyInfo                       GameRoomKeyInfo;                                   // 0x0028(0x0030)(NativeAccessSpecifierPublic)
	class FString                                 ChannelId;                                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MicOffed;                                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SpeakerOffed;                                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Protocol;                                          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRequestStartVoiceChat) == 0x000008, "Wrong alignment on FRequestStartVoiceChat");
static_assert(sizeof(FRequestStartVoiceChat) == 0x000080, "Wrong size on FRequestStartVoiceChat");
static_assert(offsetof(FRequestStartVoiceChat, GameRoomKeyInfo) == 0x000028, "Member 'FRequestStartVoiceChat::GameRoomKeyInfo' has a wrong offset!");
static_assert(offsetof(FRequestStartVoiceChat, ChannelId) == 0x000058, "Member 'FRequestStartVoiceChat::ChannelId' has a wrong offset!");
static_assert(offsetof(FRequestStartVoiceChat, MicOffed) == 0x000068, "Member 'FRequestStartVoiceChat::MicOffed' has a wrong offset!");
static_assert(offsetof(FRequestStartVoiceChat, SpeakerOffed) == 0x000069, "Member 'FRequestStartVoiceChat::SpeakerOffed' has a wrong offset!");
static_assert(offsetof(FRequestStartVoiceChat, Protocol) == 0x000070, "Member 'FRequestStartVoiceChat::Protocol' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.AudioDeviceChange
// 0x0010 (0x0010 - 0x0000)
struct FAudioDeviceChange final
{
public:
	int32                                         SelectedInputDevice;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectedOutputDevice;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLostMicrophone;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLostSpeaker;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangedMicrophoneDefault;                        // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangedMicrophoneCommunications;                 // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangedSpeakerDefault;                           // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangedSpeakerCommunications;                    // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAudioDeviceChange) == 0x000004, "Wrong alignment on FAudioDeviceChange");
static_assert(sizeof(FAudioDeviceChange) == 0x000010, "Wrong size on FAudioDeviceChange");
static_assert(offsetof(FAudioDeviceChange, SelectedInputDevice) == 0x000000, "Member 'FAudioDeviceChange::SelectedInputDevice' has a wrong offset!");
static_assert(offsetof(FAudioDeviceChange, SelectedOutputDevice) == 0x000004, "Member 'FAudioDeviceChange::SelectedOutputDevice' has a wrong offset!");
static_assert(offsetof(FAudioDeviceChange, IsLostMicrophone) == 0x000008, "Member 'FAudioDeviceChange::IsLostMicrophone' has a wrong offset!");
static_assert(offsetof(FAudioDeviceChange, IsLostSpeaker) == 0x000009, "Member 'FAudioDeviceChange::IsLostSpeaker' has a wrong offset!");
static_assert(offsetof(FAudioDeviceChange, IsChangedMicrophoneDefault) == 0x00000A, "Member 'FAudioDeviceChange::IsChangedMicrophoneDefault' has a wrong offset!");
static_assert(offsetof(FAudioDeviceChange, IsChangedMicrophoneCommunications) == 0x00000B, "Member 'FAudioDeviceChange::IsChangedMicrophoneCommunications' has a wrong offset!");
static_assert(offsetof(FAudioDeviceChange, IsChangedSpeakerDefault) == 0x00000C, "Member 'FAudioDeviceChange::IsChangedSpeakerDefault' has a wrong offset!");
static_assert(offsetof(FAudioDeviceChange, IsChangedSpeakerCommunications) == 0x00000D, "Member 'FAudioDeviceChange::IsChangedSpeakerCommunications' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.MediaStatus
// 0x0020 (0x0020 - 0x0000)
struct FMediaStatus final
{
public:
	class FString                                 Audio;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Video;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMediaStatus) == 0x000008, "Wrong alignment on FMediaStatus");
static_assert(sizeof(FMediaStatus) == 0x000020, "Wrong size on FMediaStatus");
static_assert(offsetof(FMediaStatus, Audio) == 0x000000, "Member 'FMediaStatus::Audio' has a wrong offset!");
static_assert(offsetof(FMediaStatus, Video) == 0x000010, "Member 'FMediaStatus::Video' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.AudioDeviceInfo
// 0x0028 (0x0028 - 0x0000)
struct FAudioDeviceInfo final
{
public:
	bool                                          IsInput;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefault;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCommunications;                                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAudioDeviceInfo) == 0x000008, "Wrong alignment on FAudioDeviceInfo");
static_assert(sizeof(FAudioDeviceInfo) == 0x000028, "Wrong size on FAudioDeviceInfo");
static_assert(offsetof(FAudioDeviceInfo, IsInput) == 0x000000, "Member 'FAudioDeviceInfo::IsInput' has a wrong offset!");
static_assert(offsetof(FAudioDeviceInfo, IsDefault) == 0x000001, "Member 'FAudioDeviceInfo::IsDefault' has a wrong offset!");
static_assert(offsetof(FAudioDeviceInfo, IsCommunications) == 0x000002, "Member 'FAudioDeviceInfo::IsCommunications' has a wrong offset!");
static_assert(offsetof(FAudioDeviceInfo, Name) == 0x000008, "Member 'FAudioDeviceInfo::Name' has a wrong offset!");
static_assert(offsetof(FAudioDeviceInfo, ID) == 0x000018, "Member 'FAudioDeviceInfo::ID' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.NotificationLeaveRoom
// 0x0000 (0x0250 - 0x0250)
struct FNotificationLeaveRoom final : public FBaseNotification
{
};
static_assert(alignof(FNotificationLeaveRoom) == 0x000008, "Wrong alignment on FNotificationLeaveRoom");
static_assert(sizeof(FNotificationLeaveRoom) == 0x000250, "Wrong size on FNotificationLeaveRoom");

// ScriptStruct PurpleCommunitySdk.BaseEvent
// 0x0030 (0x0030 - 0x0000)
struct FBaseEvent
{
public:
	class FString                                 Guid;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameCode;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventType;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseEvent) == 0x000008, "Wrong alignment on FBaseEvent");
static_assert(sizeof(FBaseEvent) == 0x000030, "Wrong size on FBaseEvent");
static_assert(offsetof(FBaseEvent, Guid) == 0x000000, "Member 'FBaseEvent::Guid' has a wrong offset!");
static_assert(offsetof(FBaseEvent, GameCode) == 0x000010, "Member 'FBaseEvent::GameCode' has a wrong offset!");
static_assert(offsetof(FBaseEvent, EventType) == 0x000020, "Member 'FBaseEvent::EventType' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.NotificationEnterRoom
// 0x0000 (0x0250 - 0x0250)
struct FNotificationEnterRoom final : public FBaseNotification
{
};
static_assert(alignof(FNotificationEnterRoom) == 0x000008, "Wrong alignment on FNotificationEnterRoom");
static_assert(sizeof(FNotificationEnterRoom) == 0x000250, "Wrong size on FNotificationEnterRoom");

// ScriptStruct PurpleCommunitySdk.BaseGoogleSTTResponse
// 0x0030 (0x0030 - 0x0000)
struct FBaseGoogleSTTResponse
{
public:
	int32                                         Error;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Module;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Line;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Defined;                                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseGoogleSTTResponse) == 0x000008, "Wrong alignment on FBaseGoogleSTTResponse");
static_assert(sizeof(FBaseGoogleSTTResponse) == 0x000030, "Wrong size on FBaseGoogleSTTResponse");
static_assert(offsetof(FBaseGoogleSTTResponse, Error) == 0x000000, "Member 'FBaseGoogleSTTResponse::Error' has a wrong offset!");
static_assert(offsetof(FBaseGoogleSTTResponse, Module) == 0x000004, "Member 'FBaseGoogleSTTResponse::Module' has a wrong offset!");
static_assert(offsetof(FBaseGoogleSTTResponse, Line) == 0x000008, "Member 'FBaseGoogleSTTResponse::Line' has a wrong offset!");
static_assert(offsetof(FBaseGoogleSTTResponse, Text) == 0x000010, "Member 'FBaseGoogleSTTResponse::Text' has a wrong offset!");
static_assert(offsetof(FBaseGoogleSTTResponse, Defined) == 0x000020, "Member 'FBaseGoogleSTTResponse::Defined' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.NotificationVoiceMute
// 0x0000 (0x0250 - 0x0250)
struct FNotificationVoiceMute final : public FBaseNotification
{
};
static_assert(alignof(FNotificationVoiceMute) == 0x000008, "Wrong alignment on FNotificationVoiceMute");
static_assert(sizeof(FNotificationVoiceMute) == 0x000250, "Wrong size on FNotificationVoiceMute");

// ScriptStruct PurpleCommunitySdk.NotificationVoiceMic
// 0x0000 (0x0250 - 0x0250)
struct FNotificationVoiceMic final : public FBaseNotification
{
};
static_assert(alignof(FNotificationVoiceMic) == 0x000008, "Wrong alignment on FNotificationVoiceMic");
static_assert(sizeof(FNotificationVoiceMic) == 0x000250, "Wrong size on FNotificationVoiceMic");

// ScriptStruct PurpleCommunitySdk.BaseResponse
// 0x0030 (0x0030 - 0x0000)
struct FBaseResponse
{
public:
	int32                                         Error;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Module;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Line;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Defined;                                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseResponse) == 0x000008, "Wrong alignment on FBaseResponse");
static_assert(sizeof(FBaseResponse) == 0x000030, "Wrong size on FBaseResponse");
static_assert(offsetof(FBaseResponse, Error) == 0x000000, "Member 'FBaseResponse::Error' has a wrong offset!");
static_assert(offsetof(FBaseResponse, Module) == 0x000004, "Member 'FBaseResponse::Module' has a wrong offset!");
static_assert(offsetof(FBaseResponse, Line) == 0x000008, "Member 'FBaseResponse::Line' has a wrong offset!");
static_assert(offsetof(FBaseResponse, Text) == 0x000010, "Member 'FBaseResponse::Text' has a wrong offset!");
static_assert(offsetof(FBaseResponse, Defined) == 0x000020, "Member 'FBaseResponse::Defined' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.SubscriptionInfo
// 0x0060 (0x0060 - 0x0000)
struct FSubscriptionInfo final
{
public:
	class FString                                 TopicName;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubscribeUrl;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Login;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Passcode;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WorldTopic;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerAppDest;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSubscriptionInfo) == 0x000008, "Wrong alignment on FSubscriptionInfo");
static_assert(sizeof(FSubscriptionInfo) == 0x000060, "Wrong size on FSubscriptionInfo");
static_assert(offsetof(FSubscriptionInfo, TopicName) == 0x000000, "Member 'FSubscriptionInfo::TopicName' has a wrong offset!");
static_assert(offsetof(FSubscriptionInfo, SubscribeUrl) == 0x000010, "Member 'FSubscriptionInfo::SubscribeUrl' has a wrong offset!");
static_assert(offsetof(FSubscriptionInfo, Login) == 0x000020, "Member 'FSubscriptionInfo::Login' has a wrong offset!");
static_assert(offsetof(FSubscriptionInfo, Passcode) == 0x000030, "Member 'FSubscriptionInfo::Passcode' has a wrong offset!");
static_assert(offsetof(FSubscriptionInfo, WorldTopic) == 0x000040, "Member 'FSubscriptionInfo::WorldTopic' has a wrong offset!");
static_assert(offsetof(FSubscriptionInfo, ServerAppDest) == 0x000050, "Member 'FSubscriptionInfo::ServerAppDest' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.GameRoomInfo
// 0x00A8 (0x00A8 - 0x0000)
struct FGameRoomInfo final
{
public:
	struct FGameRoomKeyInfo                       GameRoomKeyInfo;                                   // 0x0000(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 GameCode;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MemberCount;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VoiceMemberCount;                                  // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMemberCount;                                    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastMessageContent;                                // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DateLastMessagePublished;                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastMessageGuid;                                   // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DateCreated;                                       // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Deleted;                                           // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameRoomInfo) == 0x000008, "Wrong alignment on FGameRoomInfo");
static_assert(sizeof(FGameRoomInfo) == 0x0000A8, "Wrong size on FGameRoomInfo");
static_assert(offsetof(FGameRoomInfo, GameRoomKeyInfo) == 0x000000, "Member 'FGameRoomInfo::GameRoomKeyInfo' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, GameCode) == 0x000030, "Member 'FGameRoomInfo::GameCode' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, Name) == 0x000040, "Member 'FGameRoomInfo::Name' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, MemberCount) == 0x000050, "Member 'FGameRoomInfo::MemberCount' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, VoiceMemberCount) == 0x000054, "Member 'FGameRoomInfo::VoiceMemberCount' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, MaxMemberCount) == 0x000058, "Member 'FGameRoomInfo::MaxMemberCount' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, LastMessageContent) == 0x000060, "Member 'FGameRoomInfo::LastMessageContent' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, DateLastMessagePublished) == 0x000070, "Member 'FGameRoomInfo::DateLastMessagePublished' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, LastMessageGuid) == 0x000080, "Member 'FGameRoomInfo::LastMessageGuid' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, DateCreated) == 0x000090, "Member 'FGameRoomInfo::DateCreated' has a wrong offset!");
static_assert(offsetof(FGameRoomInfo, Deleted) == 0x0000A0, "Member 'FGameRoomInfo::Deleted' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.BaseResponseSubscriptionInfo
// 0x00A0 (0x00D0 - 0x0030)
struct FBaseResponseSubscriptionInfo : public FBaseResponse
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MtalkToken;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterId;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubscriptionInfo                      SubscriptionInfo;                                  // 0x0060(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FGameRoomInfo>                  GameRoomInfoList;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseResponseSubscriptionInfo) == 0x000008, "Wrong alignment on FBaseResponseSubscriptionInfo");
static_assert(sizeof(FBaseResponseSubscriptionInfo) == 0x0000D0, "Wrong size on FBaseResponseSubscriptionInfo");
static_assert(offsetof(FBaseResponseSubscriptionInfo, MtalkToken) == 0x000040, "Member 'FBaseResponseSubscriptionInfo::MtalkToken' has a wrong offset!");
static_assert(offsetof(FBaseResponseSubscriptionInfo, CharacterId) == 0x000050, "Member 'FBaseResponseSubscriptionInfo::CharacterId' has a wrong offset!");
static_assert(offsetof(FBaseResponseSubscriptionInfo, SubscriptionInfo) == 0x000060, "Member 'FBaseResponseSubscriptionInfo::SubscriptionInfo' has a wrong offset!");
static_assert(offsetof(FBaseResponseSubscriptionInfo, GameRoomInfoList) == 0x0000C0, "Member 'FBaseResponseSubscriptionInfo::GameRoomInfoList' has a wrong offset!");

// ScriptStruct PurpleCommunitySdk.BaseTranslateApiResponse
// 0x0020 (0x0020 - 0x0000)
struct FBaseTranslateApiResponse
{
public:
	class FString                                 Raw_data;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Tid;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseTranslateApiResponse) == 0x000008, "Wrong alignment on FBaseTranslateApiResponse");
static_assert(sizeof(FBaseTranslateApiResponse) == 0x000020, "Wrong size on FBaseTranslateApiResponse");
static_assert(offsetof(FBaseTranslateApiResponse, Raw_data) == 0x000000, "Member 'FBaseTranslateApiResponse::Raw_data' has a wrong offset!");
