#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_TrailData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_TrailData.ST_TrailData
// 0x0020 (0x0020 - 0x0000)
struct FST_TrailData final
{
public:
	struct FVector                                WorldLocation_3_5EFCE77B45A982FF917B5298E356863E;  // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntersectingRadiusWorld_11_17AE2A1D4A42987E0BB4D48182039FAA; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OriginalRadiusWorld_12_B8C71E0745727147A6314EBA9D51F67B; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Depth_15_97CC677C43212C6A3E89889D4285C4AA;         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SphereCenterToSurfaceDistance_24_E7D8799741A561418BEFE19F0EF66582; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebug_23_62EB11344DE67132B2394AA76C8DFD0E;        // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_TrailData) == 0x000004, "Wrong alignment on FST_TrailData");
static_assert(sizeof(FST_TrailData) == 0x000020, "Wrong size on FST_TrailData");
static_assert(offsetof(FST_TrailData, WorldLocation_3_5EFCE77B45A982FF917B5298E356863E) == 0x000000, "Member 'FST_TrailData::WorldLocation_3_5EFCE77B45A982FF917B5298E356863E' has a wrong offset!");
static_assert(offsetof(FST_TrailData, IntersectingRadiusWorld_11_17AE2A1D4A42987E0BB4D48182039FAA) == 0x00000C, "Member 'FST_TrailData::IntersectingRadiusWorld_11_17AE2A1D4A42987E0BB4D48182039FAA' has a wrong offset!");
static_assert(offsetof(FST_TrailData, OriginalRadiusWorld_12_B8C71E0745727147A6314EBA9D51F67B) == 0x000010, "Member 'FST_TrailData::OriginalRadiusWorld_12_B8C71E0745727147A6314EBA9D51F67B' has a wrong offset!");
static_assert(offsetof(FST_TrailData, Depth_15_97CC677C43212C6A3E89889D4285C4AA) == 0x000014, "Member 'FST_TrailData::Depth_15_97CC677C43212C6A3E89889D4285C4AA' has a wrong offset!");
static_assert(offsetof(FST_TrailData, SphereCenterToSurfaceDistance_24_E7D8799741A561418BEFE19F0EF66582) == 0x000018, "Member 'FST_TrailData::SphereCenterToSurfaceDistance_24_E7D8799741A561418BEFE19F0EF66582' has a wrong offset!");
static_assert(offsetof(FST_TrailData, bDebug_23_62EB11344DE67132B2394AA76C8DFD0E) == 0x00001C, "Member 'FST_TrailData::bDebug_23_62EB11344DE67132B2394AA76C8DFD0E' has a wrong offset!");

}

