#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TLClient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TLScene_structs.hpp"
#include "TLUI_structs.hpp"
#include "TLScheme_structs.hpp"
#include "TLClient_structs.hpp"
#include "UMG_structs.hpp"
#include "Auton_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "Azulejo_structs.hpp"
#include "InputCore_structs.hpp"
#include "TLTable_structs.hpp"


namespace SDK::Params
{

// Function TLClient.TLUserWidget.AutonAreaDidNavigation
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_AutonAreaDidNavigation final
{
public:
	class UWidget*                                AreaWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisit;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonNavigation                            ByNavigation;                                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWindowStackChanged;                               // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_AutonAreaDidNavigation) == 0x000008, "Wrong alignment on TLUserWidget_AutonAreaDidNavigation");
static_assert(sizeof(TLUserWidget_AutonAreaDidNavigation) == 0x000010, "Wrong size on TLUserWidget_AutonAreaDidNavigation");
static_assert(offsetof(TLUserWidget_AutonAreaDidNavigation, AreaWidget) == 0x000000, "Member 'TLUserWidget_AutonAreaDidNavigation::AreaWidget' has a wrong offset!");
static_assert(offsetof(TLUserWidget_AutonAreaDidNavigation, bVisit) == 0x000008, "Member 'TLUserWidget_AutonAreaDidNavigation::bVisit' has a wrong offset!");
static_assert(offsetof(TLUserWidget_AutonAreaDidNavigation, ByNavigation) == 0x000009, "Member 'TLUserWidget_AutonAreaDidNavigation::ByNavigation' has a wrong offset!");
static_assert(offsetof(TLUserWidget_AutonAreaDidNavigation, bWindowStackChanged) == 0x00000A, "Member 'TLUserWidget_AutonAreaDidNavigation::bWindowStackChanged' has a wrong offset!");

// Function TLClient.TLUserWidget.ChangeHideAnimation
// 0x000C (0x000C - 0x0000)
struct TLUserWidget_ChangeHideAnimation final
{
public:
	class FName                                   InAnimName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInClearWithNameNone;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_ChangeHideAnimation) == 0x000004, "Wrong alignment on TLUserWidget_ChangeHideAnimation");
static_assert(sizeof(TLUserWidget_ChangeHideAnimation) == 0x00000C, "Wrong size on TLUserWidget_ChangeHideAnimation");
static_assert(offsetof(TLUserWidget_ChangeHideAnimation, InAnimName) == 0x000000, "Member 'TLUserWidget_ChangeHideAnimation::InAnimName' has a wrong offset!");
static_assert(offsetof(TLUserWidget_ChangeHideAnimation, bInClearWithNameNone) == 0x000008, "Member 'TLUserWidget_ChangeHideAnimation::bInClearWithNameNone' has a wrong offset!");
static_assert(offsetof(TLUserWidget_ChangeHideAnimation, ReturnValue) == 0x000009, "Member 'TLUserWidget_ChangeHideAnimation::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.ChangeShowAnimation
// 0x000C (0x000C - 0x0000)
struct TLUserWidget_ChangeShowAnimation final
{
public:
	class FName                                   InAnimName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInClearWithNameNone;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_ChangeShowAnimation) == 0x000004, "Wrong alignment on TLUserWidget_ChangeShowAnimation");
static_assert(sizeof(TLUserWidget_ChangeShowAnimation) == 0x00000C, "Wrong size on TLUserWidget_ChangeShowAnimation");
static_assert(offsetof(TLUserWidget_ChangeShowAnimation, InAnimName) == 0x000000, "Member 'TLUserWidget_ChangeShowAnimation::InAnimName' has a wrong offset!");
static_assert(offsetof(TLUserWidget_ChangeShowAnimation, bInClearWithNameNone) == 0x000008, "Member 'TLUserWidget_ChangeShowAnimation::bInClearWithNameNone' has a wrong offset!");
static_assert(offsetof(TLUserWidget_ChangeShowAnimation, ReturnValue) == 0x000009, "Member 'TLUserWidget_ChangeShowAnimation::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.HandlePressed
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_HandlePressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_HandlePressed) == 0x000001, "Wrong alignment on TLUserWidget_HandlePressed");
static_assert(sizeof(TLUserWidget_HandlePressed) == 0x000001, "Wrong size on TLUserWidget_HandlePressed");
static_assert(offsetof(TLUserWidget_HandlePressed, ReturnValue) == 0x000000, "Member 'TLUserWidget_HandlePressed::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.HandleReleased
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_HandleReleased final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_HandleReleased) == 0x000001, "Wrong alignment on TLUserWidget_HandleReleased");
static_assert(sizeof(TLUserWidget_HandleReleased) == 0x000001, "Wrong size on TLUserWidget_HandleReleased");
static_assert(offsetof(TLUserWidget_HandleReleased, ReturnValue) == 0x000000, "Member 'TLUserWidget_HandleReleased::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.HideByHiddenState
// 0x0002 (0x0002 - 0x0000)
struct TLUserWidget_HideByHiddenState final
{
public:
	bool                                          bInPlayHideAnim;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPlayHideAnimManually;                           // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_HideByHiddenState) == 0x000001, "Wrong alignment on TLUserWidget_HideByHiddenState");
static_assert(sizeof(TLUserWidget_HideByHiddenState) == 0x000002, "Wrong size on TLUserWidget_HideByHiddenState");
static_assert(offsetof(TLUserWidget_HideByHiddenState, bInPlayHideAnim) == 0x000000, "Member 'TLUserWidget_HideByHiddenState::bInPlayHideAnim' has a wrong offset!");
static_assert(offsetof(TLUserWidget_HideByHiddenState, bInPlayHideAnimManually) == 0x000001, "Member 'TLUserWidget_HideByHiddenState::bInPlayHideAnimManually' has a wrong offset!");

// Function TLClient.TLUserWidget.InitVisibility
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_InitVisibility final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_InitVisibility) == 0x000001, "Wrong alignment on TLUserWidget_InitVisibility");
static_assert(sizeof(TLUserWidget_InitVisibility) == 0x000001, "Wrong size on TLUserWidget_InitVisibility");
static_assert(offsetof(TLUserWidget_InitVisibility, bInVisible) == 0x000000, "Member 'TLUserWidget_InitVisibility::bInVisible' has a wrong offset!");

// Function TLClient.TLUserWidget.IsShow
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_IsShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_IsShow) == 0x000001, "Wrong alignment on TLUserWidget_IsShow");
static_assert(sizeof(TLUserWidget_IsShow) == 0x000001, "Wrong size on TLUserWidget_IsShow");
static_assert(offsetof(TLUserWidget_IsShow, ReturnValue) == 0x000000, "Member 'TLUserWidget_IsShow::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.OnChangeVisibility
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_OnChangeVisibility final
{
public:
	bool                                          bInVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_OnChangeVisibility) == 0x000001, "Wrong alignment on TLUserWidget_OnChangeVisibility");
static_assert(sizeof(TLUserWidget_OnChangeVisibility) == 0x000001, "Wrong size on TLUserWidget_OnChangeVisibility");
static_assert(offsetof(TLUserWidget_OnChangeVisibility, bInVisibility) == 0x000000, "Member 'TLUserWidget_OnChangeVisibility::bInVisibility' has a wrong offset!");

// Function TLClient.TLUserWidget.OnHide
// 0x00B8 (0x00B8 - 0x0000)
struct TLUserWidget_OnHide final
{
public:
	struct FEventReply                            ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_OnHide) == 0x000008, "Wrong alignment on TLUserWidget_OnHide");
static_assert(sizeof(TLUserWidget_OnHide) == 0x0000B8, "Wrong size on TLUserWidget_OnHide");
static_assert(offsetof(TLUserWidget_OnHide, ReturnValue) == 0x000000, "Member 'TLUserWidget_OnHide::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.OnShow
// 0x00B8 (0x00B8 - 0x0000)
struct TLUserWidget_OnShow final
{
public:
	struct FEventReply                            ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_OnShow) == 0x000008, "Wrong alignment on TLUserWidget_OnShow");
static_assert(sizeof(TLUserWidget_OnShow) == 0x0000B8, "Wrong size on TLUserWidget_OnShow");
static_assert(offsetof(TLUserWidget_OnShow, ReturnValue) == 0x000000, "Member 'TLUserWidget_OnShow::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.OnUpdateNotification
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_OnUpdateNotification final
{
public:
	bool                                          InIsOn;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_OnUpdateNotification) == 0x000001, "Wrong alignment on TLUserWidget_OnUpdateNotification");
static_assert(sizeof(TLUserWidget_OnUpdateNotification) == 0x000001, "Wrong size on TLUserWidget_OnUpdateNotification");
static_assert(offsetof(TLUserWidget_OnUpdateNotification, InIsOn) == 0x000000, "Member 'TLUserWidget_OnUpdateNotification::InIsOn' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAndStopAnimationAtEnd
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidget_PlayAndStopAnimationAtEnd final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_PlayAndStopAnimationAtEnd) == 0x000008, "Wrong alignment on TLUserWidget_PlayAndStopAnimationAtEnd");
static_assert(sizeof(TLUserWidget_PlayAndStopAnimationAtEnd) == 0x000008, "Wrong size on TLUserWidget_PlayAndStopAnimationAtEnd");
static_assert(offsetof(TLUserWidget_PlayAndStopAnimationAtEnd, Animation) == 0x000000, "Member 'TLUserWidget_PlayAndStopAnimationAtEnd::Animation' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAnimationByName
// 0x000C (0x000C - 0x0000)
struct TLUserWidget_PlayAnimationByName final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_PlayAnimationByName) == 0x000004, "Wrong alignment on TLUserWidget_PlayAnimationByName");
static_assert(sizeof(TLUserWidget_PlayAnimationByName) == 0x00000C, "Wrong size on TLUserWidget_PlayAnimationByName");
static_assert(offsetof(TLUserWidget_PlayAnimationByName, AnimationName) == 0x000000, "Member 'TLUserWidget_PlayAnimationByName::AnimationName' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationByName, ReturnValue) == 0x000008, "Member 'TLUserWidget_PlayAnimationByName::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAnimationForwardInUserWidget
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_PlayAnimationForwardInUserWidget final
{
public:
	class UWidgetAnimation*                       InAnim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_PlayAnimationForwardInUserWidget) == 0x000008, "Wrong alignment on TLUserWidget_PlayAnimationForwardInUserWidget");
static_assert(sizeof(TLUserWidget_PlayAnimationForwardInUserWidget) == 0x000010, "Wrong size on TLUserWidget_PlayAnimationForwardInUserWidget");
static_assert(offsetof(TLUserWidget_PlayAnimationForwardInUserWidget, InAnim) == 0x000000, "Member 'TLUserWidget_PlayAnimationForwardInUserWidget::InAnim' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationForwardInUserWidget, ReturnValue) == 0x000008, "Member 'TLUserWidget_PlayAnimationForwardInUserWidget::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAnimationInUserWidget
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_PlayAnimationInUserWidget final
{
public:
	class UWidgetAnimation*                       InAnim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_PlayAnimationInUserWidget) == 0x000008, "Wrong alignment on TLUserWidget_PlayAnimationInUserWidget");
static_assert(sizeof(TLUserWidget_PlayAnimationInUserWidget) == 0x000010, "Wrong size on TLUserWidget_PlayAnimationInUserWidget");
static_assert(offsetof(TLUserWidget_PlayAnimationInUserWidget, InAnim) == 0x000000, "Member 'TLUserWidget_PlayAnimationInUserWidget::InAnim' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationInUserWidget, ReturnValue) == 0x000008, "Member 'TLUserWidget_PlayAnimationInUserWidget::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAnimationInUserWidget1
// 0x0018 (0x0018 - 0x0000)
struct TLUserWidget_PlayAnimationInUserWidget1 final
{
public:
	class UWidgetAnimation*                       InAnim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_PlayAnimationInUserWidget1) == 0x000008, "Wrong alignment on TLUserWidget_PlayAnimationInUserWidget1");
static_assert(sizeof(TLUserWidget_PlayAnimationInUserWidget1) == 0x000018, "Wrong size on TLUserWidget_PlayAnimationInUserWidget1");
static_assert(offsetof(TLUserWidget_PlayAnimationInUserWidget1, InAnim) == 0x000000, "Member 'TLUserWidget_PlayAnimationInUserWidget1::InAnim' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationInUserWidget1, StartAtTime) == 0x000008, "Member 'TLUserWidget_PlayAnimationInUserWidget1::StartAtTime' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationInUserWidget1, NumLoopsToPlay) == 0x00000C, "Member 'TLUserWidget_PlayAnimationInUserWidget1::NumLoopsToPlay' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationInUserWidget1, PlayMode) == 0x000010, "Member 'TLUserWidget_PlayAnimationInUserWidget1::PlayMode' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationInUserWidget1, ReturnValue) == 0x000011, "Member 'TLUserWidget_PlayAnimationInUserWidget1::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAnimationLoopInUserWidget
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_PlayAnimationLoopInUserWidget final
{
public:
	class UWidgetAnimation*                       InAnim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_PlayAnimationLoopInUserWidget) == 0x000008, "Wrong alignment on TLUserWidget_PlayAnimationLoopInUserWidget");
static_assert(sizeof(TLUserWidget_PlayAnimationLoopInUserWidget) == 0x000010, "Wrong size on TLUserWidget_PlayAnimationLoopInUserWidget");
static_assert(offsetof(TLUserWidget_PlayAnimationLoopInUserWidget, InAnim) == 0x000000, "Member 'TLUserWidget_PlayAnimationLoopInUserWidget::InAnim' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationLoopInUserWidget, ReturnValue) == 0x000008, "Member 'TLUserWidget_PlayAnimationLoopInUserWidget::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAnimationReverseInUserWidget
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_PlayAnimationReverseInUserWidget final
{
public:
	class UWidgetAnimation*                       InAnim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_PlayAnimationReverseInUserWidget) == 0x000008, "Wrong alignment on TLUserWidget_PlayAnimationReverseInUserWidget");
static_assert(sizeof(TLUserWidget_PlayAnimationReverseInUserWidget) == 0x000010, "Wrong size on TLUserWidget_PlayAnimationReverseInUserWidget");
static_assert(offsetof(TLUserWidget_PlayAnimationReverseInUserWidget, InAnim) == 0x000000, "Member 'TLUserWidget_PlayAnimationReverseInUserWidget::InAnim' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationReverseInUserWidget, ReturnValue) == 0x000008, "Member 'TLUserWidget_PlayAnimationReverseInUserWidget::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayAnimationWithOptions
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_PlayAnimationWithOptions final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseReverse;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_PlayAnimationWithOptions) == 0x000008, "Wrong alignment on TLUserWidget_PlayAnimationWithOptions");
static_assert(sizeof(TLUserWidget_PlayAnimationWithOptions) == 0x000010, "Wrong size on TLUserWidget_PlayAnimationWithOptions");
static_assert(offsetof(TLUserWidget_PlayAnimationWithOptions, Animation) == 0x000000, "Member 'TLUserWidget_PlayAnimationWithOptions::Animation' has a wrong offset!");
static_assert(offsetof(TLUserWidget_PlayAnimationWithOptions, bUseReverse) == 0x000008, "Member 'TLUserWidget_PlayAnimationWithOptions::bUseReverse' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayReverseAndStopAnimationAtEnd
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidget_PlayReverseAndStopAnimationAtEnd final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_PlayReverseAndStopAnimationAtEnd) == 0x000008, "Wrong alignment on TLUserWidget_PlayReverseAndStopAnimationAtEnd");
static_assert(sizeof(TLUserWidget_PlayReverseAndStopAnimationAtEnd) == 0x000008, "Wrong size on TLUserWidget_PlayReverseAndStopAnimationAtEnd");
static_assert(offsetof(TLUserWidget_PlayReverseAndStopAnimationAtEnd, Animation) == 0x000000, "Member 'TLUserWidget_PlayReverseAndStopAnimationAtEnd::Animation' has a wrong offset!");

// Function TLClient.TLUserWidget.PlayUISound
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidget_PlayUISound final
{
public:
	class UTLSoundEvent*                          InSoundEvent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_PlayUISound) == 0x000008, "Wrong alignment on TLUserWidget_PlayUISound");
static_assert(sizeof(TLUserWidget_PlayUISound) == 0x000008, "Wrong size on TLUserWidget_PlayUISound");
static_assert(offsetof(TLUserWidget_PlayUISound, InSoundEvent) == 0x000000, "Member 'TLUserWidget_PlayUISound::InSoundEvent' has a wrong offset!");

// Function TLClient.TLUserWidget.SetAdvancedUIModeByModel
// 0x0002 (0x0002 - 0x0000)
struct TLUserWidget_SetAdvancedUIModeByModel final
{
public:
	bool                                          bInAdvancedUIModeByModel;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInForce;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_SetAdvancedUIModeByModel) == 0x000001, "Wrong alignment on TLUserWidget_SetAdvancedUIModeByModel");
static_assert(sizeof(TLUserWidget_SetAdvancedUIModeByModel) == 0x000002, "Wrong size on TLUserWidget_SetAdvancedUIModeByModel");
static_assert(offsetof(TLUserWidget_SetAdvancedUIModeByModel, bInAdvancedUIModeByModel) == 0x000000, "Member 'TLUserWidget_SetAdvancedUIModeByModel::bInAdvancedUIModeByModel' has a wrong offset!");
static_assert(offsetof(TLUserWidget_SetAdvancedUIModeByModel, bInForce) == 0x000001, "Member 'TLUserWidget_SetAdvancedUIModeByModel::bInForce' has a wrong offset!");

// Function TLClient.TLUserWidget.SetHiddenState
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_SetHiddenState final
{
public:
	bool                                          bInHiddenState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_SetHiddenState) == 0x000001, "Wrong alignment on TLUserWidget_SetHiddenState");
static_assert(sizeof(TLUserWidget_SetHiddenState) == 0x000001, "Wrong size on TLUserWidget_SetHiddenState");
static_assert(offsetof(TLUserWidget_SetHiddenState, bInHiddenState) == 0x000000, "Member 'TLUserWidget_SetHiddenState::bInHiddenState' has a wrong offset!");

// Function TLClient.TLUserWidget.SetNotification
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_SetNotification final
{
public:
	bool                                          bInNotification;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_SetNotification) == 0x000001, "Wrong alignment on TLUserWidget_SetNotification");
static_assert(sizeof(TLUserWidget_SetNotification) == 0x000001, "Wrong size on TLUserWidget_SetNotification");
static_assert(offsetof(TLUserWidget_SetNotification, bInNotification) == 0x000000, "Member 'TLUserWidget_SetNotification::bInNotification' has a wrong offset!");

// Function TLClient.TLUserWidget.SetTextTooltipId
// 0x000C (0x000C - 0x0000)
struct TLUserWidget_SetTextTooltipId final
{
public:
	class FName                                   InTextTooltipId;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsImmediately;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_SetTextTooltipId) == 0x000004, "Wrong alignment on TLUserWidget_SetTextTooltipId");
static_assert(sizeof(TLUserWidget_SetTextTooltipId) == 0x00000C, "Wrong size on TLUserWidget_SetTextTooltipId");
static_assert(offsetof(TLUserWidget_SetTextTooltipId, InTextTooltipId) == 0x000000, "Member 'TLUserWidget_SetTextTooltipId::InTextTooltipId' has a wrong offset!");
static_assert(offsetof(TLUserWidget_SetTextTooltipId, IsImmediately) == 0x000008, "Member 'TLUserWidget_SetTextTooltipId::IsImmediately' has a wrong offset!");

// Function TLClient.TLUserWidget.SetTooltipAnchorTarget
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidget_SetTooltipAnchorTarget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_SetTooltipAnchorTarget) == 0x000008, "Wrong alignment on TLUserWidget_SetTooltipAnchorTarget");
static_assert(sizeof(TLUserWidget_SetTooltipAnchorTarget) == 0x000008, "Wrong size on TLUserWidget_SetTooltipAnchorTarget");
static_assert(offsetof(TLUserWidget_SetTooltipAnchorTarget, InWidget) == 0x000000, "Member 'TLUserWidget_SetTooltipAnchorTarget::InWidget' has a wrong offset!");

// Function TLClient.TLUserWidget.SetTooltipBoundary
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_SetTooltipBoundary final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InFlags;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_SetTooltipBoundary) == 0x000008, "Wrong alignment on TLUserWidget_SetTooltipBoundary");
static_assert(sizeof(TLUserWidget_SetTooltipBoundary) == 0x000010, "Wrong size on TLUserWidget_SetTooltipBoundary");
static_assert(offsetof(TLUserWidget_SetTooltipBoundary, InWidget) == 0x000000, "Member 'TLUserWidget_SetTooltipBoundary::InWidget' has a wrong offset!");
static_assert(offsetof(TLUserWidget_SetTooltipBoundary, InFlags) == 0x000008, "Member 'TLUserWidget_SetTooltipBoundary::InFlags' has a wrong offset!");

// Function TLClient.TLUserWidget.ShowWithValue
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_ShowWithValue final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_ShowWithValue) == 0x000001, "Wrong alignment on TLUserWidget_ShowWithValue");
static_assert(sizeof(TLUserWidget_ShowWithValue) == 0x000001, "Wrong size on TLUserWidget_ShowWithValue");
static_assert(offsetof(TLUserWidget_ShowWithValue, InVisible) == 0x000000, "Member 'TLUserWidget_ShowWithValue::InVisible' has a wrong offset!");

// Function TLClient.TLUserWidget.StopAnimationAtEnd
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidget_StopAnimationAtEnd final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_StopAnimationAtEnd) == 0x000008, "Wrong alignment on TLUserWidget_StopAnimationAtEnd");
static_assert(sizeof(TLUserWidget_StopAnimationAtEnd) == 0x000008, "Wrong size on TLUserWidget_StopAnimationAtEnd");
static_assert(offsetof(TLUserWidget_StopAnimationAtEnd, Animation) == 0x000000, "Member 'TLUserWidget_StopAnimationAtEnd::Animation' has a wrong offset!");

// Function TLClient.TLUserWidget.StopAnimationByName
// 0x000C (0x000C - 0x0000)
struct TLUserWidget_StopAnimationByName final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_StopAnimationByName) == 0x000004, "Wrong alignment on TLUserWidget_StopAnimationByName");
static_assert(sizeof(TLUserWidget_StopAnimationByName) == 0x00000C, "Wrong size on TLUserWidget_StopAnimationByName");
static_assert(offsetof(TLUserWidget_StopAnimationByName, AnimationName) == 0x000000, "Member 'TLUserWidget_StopAnimationByName::AnimationName' has a wrong offset!");
static_assert(offsetof(TLUserWidget_StopAnimationByName, ReturnValue) == 0x000008, "Member 'TLUserWidget_StopAnimationByName::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.StopAnimationInUserWidget
// 0x0010 (0x0010 - 0x0000)
struct TLUserWidget_StopAnimationInUserWidget final
{
public:
	const class UWidgetAnimation*                 InAnim;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidget_StopAnimationInUserWidget) == 0x000008, "Wrong alignment on TLUserWidget_StopAnimationInUserWidget");
static_assert(sizeof(TLUserWidget_StopAnimationInUserWidget) == 0x000010, "Wrong size on TLUserWidget_StopAnimationInUserWidget");
static_assert(offsetof(TLUserWidget_StopAnimationInUserWidget, InAnim) == 0x000000, "Member 'TLUserWidget_StopAnimationInUserWidget::InAnim' has a wrong offset!");
static_assert(offsetof(TLUserWidget_StopAnimationInUserWidget, ReturnValue) == 0x000008, "Member 'TLUserWidget_StopAnimationInUserWidget::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.GetNotification
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_GetNotification final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_GetNotification) == 0x000001, "Wrong alignment on TLUserWidget_GetNotification");
static_assert(sizeof(TLUserWidget_GetNotification) == 0x000001, "Wrong size on TLUserWidget_GetNotification");
static_assert(offsetof(TLUserWidget_GetNotification, ReturnValue) == 0x000000, "Member 'TLUserWidget_GetNotification::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidget.IsHiddenState
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidget_IsHiddenState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidget_IsHiddenState) == 0x000001, "Wrong alignment on TLUserWidget_IsHiddenState");
static_assert(sizeof(TLUserWidget_IsHiddenState) == 0x000001, "Wrong size on TLUserWidget_IsHiddenState");
static_assert(offsetof(TLUserWidget_IsHiddenState, ReturnValue) == 0x000000, "Member 'TLUserWidget_IsHiddenState::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidgetView.GetDataContext
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidgetView_GetDataContext final
{
public:
	class UTLViewModelBase*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetView_GetDataContext) == 0x000008, "Wrong alignment on TLUserWidgetView_GetDataContext");
static_assert(sizeof(TLUserWidgetView_GetDataContext) == 0x000008, "Wrong size on TLUserWidgetView_GetDataContext");
static_assert(offsetof(TLUserWidgetView_GetDataContext, ReturnValue) == 0x000000, "Member 'TLUserWidgetView_GetDataContext::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidgetView.GetViewModelClass
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidgetView_GetViewModelClass final
{
public:
	TSubclassOf<class UTLViewModelImpl>           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetView_GetViewModelClass) == 0x000008, "Wrong alignment on TLUserWidgetView_GetViewModelClass");
static_assert(sizeof(TLUserWidgetView_GetViewModelClass) == 0x000008, "Wrong size on TLUserWidgetView_GetViewModelClass");
static_assert(offsetof(TLUserWidgetView_GetViewModelClass, ReturnValue) == 0x000000, "Member 'TLUserWidgetView_GetViewModelClass::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidgetButton.SetButtonStyleByTableKey
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidgetButton_SetButtonStyleByTableKey final
{
public:
	class FName                                   InKey;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetButton_SetButtonStyleByTableKey) == 0x000004, "Wrong alignment on TLUserWidgetButton_SetButtonStyleByTableKey");
static_assert(sizeof(TLUserWidgetButton_SetButtonStyleByTableKey) == 0x000008, "Wrong size on TLUserWidgetButton_SetButtonStyleByTableKey");
static_assert(offsetof(TLUserWidgetButton_SetButtonStyleByTableKey, InKey) == 0x000000, "Member 'TLUserWidgetButton_SetButtonStyleByTableKey::InKey' has a wrong offset!");

// Function TLClient.TLUserWidgetButton.SetHoverIconFromSoftObjectPath
// 0x0020 (0x0020 - 0x0000)
struct TLUserWidgetButton_SetHoverIconFromSoftObjectPath final
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAsyncLoad;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidgetButton_SetHoverIconFromSoftObjectPath) == 0x000008, "Wrong alignment on TLUserWidgetButton_SetHoverIconFromSoftObjectPath");
static_assert(sizeof(TLUserWidgetButton_SetHoverIconFromSoftObjectPath) == 0x000020, "Wrong size on TLUserWidgetButton_SetHoverIconFromSoftObjectPath");
static_assert(offsetof(TLUserWidgetButton_SetHoverIconFromSoftObjectPath, Path) == 0x000000, "Member 'TLUserWidgetButton_SetHoverIconFromSoftObjectPath::Path' has a wrong offset!");
static_assert(offsetof(TLUserWidgetButton_SetHoverIconFromSoftObjectPath, bInAsyncLoad) == 0x000018, "Member 'TLUserWidgetButton_SetHoverIconFromSoftObjectPath::bInAsyncLoad' has a wrong offset!");
static_assert(offsetof(TLUserWidgetButton_SetHoverIconFromSoftObjectPath, bMatchSize) == 0x000019, "Member 'TLUserWidgetButton_SetHoverIconFromSoftObjectPath::bMatchSize' has a wrong offset!");

// Function TLClient.TLUserWidgetButton.SetIconFromSoftObjectPath
// 0x0020 (0x0020 - 0x0000)
struct TLUserWidgetButton_SetIconFromSoftObjectPath final
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAsyncLoad;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidgetButton_SetIconFromSoftObjectPath) == 0x000008, "Wrong alignment on TLUserWidgetButton_SetIconFromSoftObjectPath");
static_assert(sizeof(TLUserWidgetButton_SetIconFromSoftObjectPath) == 0x000020, "Wrong size on TLUserWidgetButton_SetIconFromSoftObjectPath");
static_assert(offsetof(TLUserWidgetButton_SetIconFromSoftObjectPath, Path) == 0x000000, "Member 'TLUserWidgetButton_SetIconFromSoftObjectPath::Path' has a wrong offset!");
static_assert(offsetof(TLUserWidgetButton_SetIconFromSoftObjectPath, bInAsyncLoad) == 0x000018, "Member 'TLUserWidgetButton_SetIconFromSoftObjectPath::bInAsyncLoad' has a wrong offset!");
static_assert(offsetof(TLUserWidgetButton_SetIconFromSoftObjectPath, bMatchSize) == 0x000019, "Member 'TLUserWidgetButton_SetIconFromSoftObjectPath::bMatchSize' has a wrong offset!");

// DelegateFunction TLClient.TLUserWidgetButton.SetSizeDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidgetButton_SetSizeDelegate__DelegateSignature final
{
public:
	float                                         InWidgth;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InHeight;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetButton_SetSizeDelegate__DelegateSignature) == 0x000004, "Wrong alignment on TLUserWidgetButton_SetSizeDelegate__DelegateSignature");
static_assert(sizeof(TLUserWidgetButton_SetSizeDelegate__DelegateSignature) == 0x000008, "Wrong size on TLUserWidgetButton_SetSizeDelegate__DelegateSignature");
static_assert(offsetof(TLUserWidgetButton_SetSizeDelegate__DelegateSignature, InWidgth) == 0x000000, "Member 'TLUserWidgetButton_SetSizeDelegate__DelegateSignature::InWidgth' has a wrong offset!");
static_assert(offsetof(TLUserWidgetButton_SetSizeDelegate__DelegateSignature, InHeight) == 0x000004, "Member 'TLUserWidgetButton_SetSizeDelegate__DelegateSignature::InHeight' has a wrong offset!");

// Function TLClient.TLUserWidgetButton.SetText
// 0x0018 (0x0018 - 0x0000)
struct TLUserWidgetButton_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetButton_SetText) == 0x000008, "Wrong alignment on TLUserWidgetButton_SetText");
static_assert(sizeof(TLUserWidgetButton_SetText) == 0x000018, "Wrong size on TLUserWidgetButton_SetText");
static_assert(offsetof(TLUserWidgetButton_SetText, InText) == 0x000000, "Member 'TLUserWidgetButton_SetText::InText' has a wrong offset!");

// DelegateFunction TLClient.TLUserWidgetButton.TLButtonChangeEnableEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetButton_TLButtonChangeEnableEvent__DelegateSignature final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetButton_TLButtonChangeEnableEvent__DelegateSignature) == 0x000001, "Wrong alignment on TLUserWidgetButton_TLButtonChangeEnableEvent__DelegateSignature");
static_assert(sizeof(TLUserWidgetButton_TLButtonChangeEnableEvent__DelegateSignature) == 0x000001, "Wrong size on TLUserWidgetButton_TLButtonChangeEnableEvent__DelegateSignature");
static_assert(offsetof(TLUserWidgetButton_TLButtonChangeEnableEvent__DelegateSignature, bEnabled) == 0x000000, "Member 'TLUserWidgetButton_TLButtonChangeEnableEvent__DelegateSignature::bEnabled' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.BindGameValue
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidgetCheckButton_BindGameValue final
{
public:
	class FName                                   GameValueName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_BindGameValue) == 0x000004, "Wrong alignment on TLUserWidgetCheckButton_BindGameValue");
static_assert(sizeof(TLUserWidgetCheckButton_BindGameValue) == 0x000008, "Wrong size on TLUserWidgetCheckButton_BindGameValue");
static_assert(offsetof(TLUserWidgetCheckButton_BindGameValue, GameValueName) == 0x000000, "Member 'TLUserWidgetCheckButton_BindGameValue::GameValueName' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.HandleIndeterminate
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_HandleIndeterminate final
{
public:
	bool                                          bIndeterminate;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_HandleIndeterminate) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_HandleIndeterminate");
static_assert(sizeof(TLUserWidgetCheckButton_HandleIndeterminate) == 0x000001, "Wrong size on TLUserWidgetCheckButton_HandleIndeterminate");
static_assert(offsetof(TLUserWidgetCheckButton_HandleIndeterminate, bIndeterminate) == 0x000000, "Member 'TLUserWidgetCheckButton_HandleIndeterminate::bIndeterminate' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.HandleSelected
// 0x0008 (0x0008 - 0x0000)
struct TLUserWidgetCheckButton_HandleSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_HandleSelected) == 0x000004, "Wrong alignment on TLUserWidgetCheckButton_HandleSelected");
static_assert(sizeof(TLUserWidgetCheckButton_HandleSelected) == 0x000008, "Wrong size on TLUserWidgetCheckButton_HandleSelected");
static_assert(offsetof(TLUserWidgetCheckButton_HandleSelected, Selected) == 0x000000, "Member 'TLUserWidgetCheckButton_HandleSelected::Selected' has a wrong offset!");
static_assert(offsetof(TLUserWidgetCheckButton_HandleSelected, Index_0) == 0x000004, "Member 'TLUserWidgetCheckButton_HandleSelected::Index_0' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.HandleVisibleBindUserWidget
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_HandleVisibleBindUserWidget final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_HandleVisibleBindUserWidget) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_HandleVisibleBindUserWidget");
static_assert(sizeof(TLUserWidgetCheckButton_HandleVisibleBindUserWidget) == 0x000001, "Wrong size on TLUserWidgetCheckButton_HandleVisibleBindUserWidget");
static_assert(offsetof(TLUserWidgetCheckButton_HandleVisibleBindUserWidget, bInVisible) == 0x000000, "Member 'TLUserWidgetCheckButton_HandleVisibleBindUserWidget::bInVisible' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.SetCheck
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_SetCheck final
{
public:
	bool                                          Check;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_SetCheck) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_SetCheck");
static_assert(sizeof(TLUserWidgetCheckButton_SetCheck) == 0x000001, "Wrong size on TLUserWidgetCheckButton_SetCheck");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheck, Check) == 0x000000, "Member 'TLUserWidgetCheckButton_SetCheck::Check' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.SetCheckHoverIconFromSoftObjectPath
// 0x0020 (0x0020 - 0x0000)
struct TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath final
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAsyncLoad;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath) == 0x000008, "Wrong alignment on TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath");
static_assert(sizeof(TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath) == 0x000020, "Wrong size on TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath, Path) == 0x000000, "Member 'TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath::Path' has a wrong offset!");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath, bInAsyncLoad) == 0x000018, "Member 'TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath::bInAsyncLoad' has a wrong offset!");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath, bMatchSize) == 0x000019, "Member 'TLUserWidgetCheckButton_SetCheckHoverIconFromSoftObjectPath::bMatchSize' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.SetCheckIconFromSoftObjectPath
// 0x0020 (0x0020 - 0x0000)
struct TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath final
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAsyncLoad;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath) == 0x000008, "Wrong alignment on TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath");
static_assert(sizeof(TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath) == 0x000020, "Wrong size on TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath, Path) == 0x000000, "Member 'TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath::Path' has a wrong offset!");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath, bInAsyncLoad) == 0x000018, "Member 'TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath::bInAsyncLoad' has a wrong offset!");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath, bMatchSize) == 0x000019, "Member 'TLUserWidgetCheckButton_SetCheckIconFromSoftObjectPath::bMatchSize' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.SetCheckIgnoreDisable
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_SetCheckIgnoreDisable final
{
public:
	bool                                          Check;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_SetCheckIgnoreDisable) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_SetCheckIgnoreDisable");
static_assert(sizeof(TLUserWidgetCheckButton_SetCheckIgnoreDisable) == 0x000001, "Wrong size on TLUserWidgetCheckButton_SetCheckIgnoreDisable");
static_assert(offsetof(TLUserWidgetCheckButton_SetCheckIgnoreDisable, Check) == 0x000000, "Member 'TLUserWidgetCheckButton_SetCheckIgnoreDisable::Check' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.SetIndeterminate
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_SetIndeterminate final
{
public:
	bool                                          bInValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_SetIndeterminate) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_SetIndeterminate");
static_assert(sizeof(TLUserWidgetCheckButton_SetIndeterminate) == 0x000001, "Wrong size on TLUserWidgetCheckButton_SetIndeterminate");
static_assert(offsetof(TLUserWidgetCheckButton_SetIndeterminate, bInValue) == 0x000000, "Member 'TLUserWidgetCheckButton_SetIndeterminate::bInValue' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.IsBindedGameValue
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_IsBindedGameValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_IsBindedGameValue) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_IsBindedGameValue");
static_assert(sizeof(TLUserWidgetCheckButton_IsBindedGameValue) == 0x000001, "Wrong size on TLUserWidgetCheckButton_IsBindedGameValue");
static_assert(offsetof(TLUserWidgetCheckButton_IsBindedGameValue, ReturnValue) == 0x000000, "Member 'TLUserWidgetCheckButton_IsBindedGameValue::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.IsChecked
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_IsChecked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_IsChecked) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_IsChecked");
static_assert(sizeof(TLUserWidgetCheckButton_IsChecked) == 0x000001, "Wrong size on TLUserWidgetCheckButton_IsChecked");
static_assert(offsetof(TLUserWidgetCheckButton_IsChecked, ReturnValue) == 0x000000, "Member 'TLUserWidgetCheckButton_IsChecked::ReturnValue' has a wrong offset!");

// Function TLClient.TLUserWidgetCheckButton.IsIndeterminate
// 0x0001 (0x0001 - 0x0000)
struct TLUserWidgetCheckButton_IsIndeterminate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLUserWidgetCheckButton_IsIndeterminate) == 0x000001, "Wrong alignment on TLUserWidgetCheckButton_IsIndeterminate");
