#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TLProfile

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class TLProfile.TLProfileData
// 0x0010 (0x0038 - 0x0028)
class UTLProfileData : public UObject
{
public:
	class FString                                 PackageName;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLProfileData">();
	}
	static class UTLProfileData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLProfileData>();
	}
};
static_assert(alignof(UTLProfileData) == 0x000008, "Wrong alignment on UTLProfileData");
static_assert(sizeof(UTLProfileData) == 0x000038, "Wrong size on UTLProfileData");
static_assert(offsetof(UTLProfileData, PackageName) == 0x000028, "Member 'UTLProfileData::PackageName' has a wrong offset!");

// Class TLProfile.TLLoadTimeProfileData
// 0x0010 (0x0048 - 0x0038)
class UTLLoadTimeProfileData final : public UTLProfileData
{
public:
	TArray<double>                                LoadingTime;                                       // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLLoadTimeProfileData">();
	}
	static class UTLLoadTimeProfileData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLLoadTimeProfileData>();
	}
};
static_assert(alignof(UTLLoadTimeProfileData) == 0x000008, "Wrong alignment on UTLLoadTimeProfileData");
static_assert(sizeof(UTLLoadTimeProfileData) == 0x000048, "Wrong size on UTLLoadTimeProfileData");
static_assert(offsetof(UTLLoadTimeProfileData, LoadingTime) == 0x000038, "Member 'UTLLoadTimeProfileData::LoadingTime' has a wrong offset!");

// Class TLProfile.TLProfiler
// 0x0050 (0x0158 - 0x0108)
class UTLProfiler : public UUserDefinedStruct
{
public:
	TMap<class FString, class UTLProfileData*>    ProfileDataByPackageName;                          // 0x0108(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLProfiler">();
	}
	static class UTLProfiler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLProfiler>();
	}
};
static_assert(alignof(UTLProfiler) == 0x000008, "Wrong alignment on UTLProfiler");
static_assert(sizeof(UTLProfiler) == 0x000158, "Wrong size on UTLProfiler");
static_assert(offsetof(UTLProfiler, ProfileDataByPackageName) == 0x000108, "Member 'UTLProfiler::ProfileDataByPackageName' has a wrong offset!");

// Class TLProfile.TLLoadTimeProfiler
// 0x0018 (0x0170 - 0x0158)
class UTLLoadTimeProfiler final : public UTLProfiler
{
public:
	uint8                                         Pad_158[0x18];                                     // 0x0158(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLLoadTimeProfiler">();
	}
	static class UTLLoadTimeProfiler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLLoadTimeProfiler>();
	}
};
static_assert(alignof(UTLLoadTimeProfiler) == 0x000008, "Wrong alignment on UTLLoadTimeProfiler");
static_assert(sizeof(UTLLoadTimeProfiler) == 0x000170, "Wrong size on UTLLoadTimeProfiler");

}

