#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TLScene

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayCameras_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_classes.hpp"
#include "TLScene_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "GameplayTasks_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "AkAudio_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SignificanceManager_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "PhysicsCore_classes.hpp"


namespace SDK
{

// Class TLScene.ParticleModuleStreakBase
// 0x0000 (0x0030 - 0x0030)
class UParticleModuleStreakBase : public UParticleModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParticleModuleStreakBase">();
	}
	static class UParticleModuleStreakBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleModuleStreakBase>();
	}
};
static_assert(alignof(UParticleModuleStreakBase) == 0x000008, "Wrong alignment on UParticleModuleStreakBase");
static_assert(sizeof(UParticleModuleStreakBase) == 0x000030, "Wrong size on UParticleModuleStreakBase");

// Class TLScene.UnrealSceneParticleModuleStreakAnchor
// 0x0028 (0x0058 - 0x0030)
class UUnrealSceneParticleModuleStreakAnchor final : public UParticleModuleStreakBase
{
public:
	ESnStreakAnchorColorMode                      ColorMode;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           StartColor;                                        // 0x0034(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EndColor;                                          // 0x0044(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TexV;                                              // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnrealSceneParticleModuleStreakAnchor">();
	}
	static class UUnrealSceneParticleModuleStreakAnchor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnrealSceneParticleModuleStreakAnchor>();
	}
};
static_assert(alignof(UUnrealSceneParticleModuleStreakAnchor) == 0x000008, "Wrong alignment on UUnrealSceneParticleModuleStreakAnchor");
static_assert(sizeof(UUnrealSceneParticleModuleStreakAnchor) == 0x000058, "Wrong size on UUnrealSceneParticleModuleStreakAnchor");
static_assert(offsetof(UUnrealSceneParticleModuleStreakAnchor, ColorMode) == 0x000030, "Member 'UUnrealSceneParticleModuleStreakAnchor::ColorMode' has a wrong offset!");
static_assert(offsetof(UUnrealSceneParticleModuleStreakAnchor, StartColor) == 0x000034, "Member 'UUnrealSceneParticleModuleStreakAnchor::StartColor' has a wrong offset!");
static_assert(offsetof(UUnrealSceneParticleModuleStreakAnchor, EndColor) == 0x000044, "Member 'UUnrealSceneParticleModuleStreakAnchor::EndColor' has a wrong offset!");
static_assert(offsetof(UUnrealSceneParticleModuleStreakAnchor, TexV) == 0x000054, "Member 'UUnrealSceneParticleModuleStreakAnchor::TexV' has a wrong offset!");

// Class TLScene.TLCommonGameMode
// 0x0010 (0x02E0 - 0x02D0)
class ATLCommonGameMode : public AGameModeBase
{
public:
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLCommonGameMode">();
	}
	static class ATLCommonGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATLCommonGameMode>();
	}
};
static_assert(alignof(ATLCommonGameMode) == 0x000008, "Wrong alignment on ATLCommonGameMode");
static_assert(sizeof(ATLCommonGameMode) == 0x0002E0, "Wrong size on ATLCommonGameMode");

// Class TLScene.TLCommonGameInstance
// 0x00A8 (0x0250 - 0x01A8)
class UTLCommonGameInstance : public UGameInstance
{
public:
	uint8                                         Pad_1A8[0xA8];                                     // 0x01A8(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLCommonGameInstance">();
	}
	static class UTLCommonGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLCommonGameInstance>();
	}
};
static_assert(alignof(UTLCommonGameInstance) == 0x000008, "Wrong alignment on UTLCommonGameInstance");
static_assert(sizeof(UTLCommonGameInstance) == 0x000250, "Wrong size on UTLCommonGameInstance");

// Class TLScene.AnimNotifyState_BoneScaleControl
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_BoneScaleControl final : public UAnimNotifyState
{
public:
	TArray<struct FBoneScaleControlByAnimSeqenceOption> TargetOption;                                      // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_BoneScaleControl">();
	}
	static class UAnimNotifyState_BoneScaleControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_BoneScaleControl>();
	}
};
static_assert(alignof(UAnimNotifyState_BoneScaleControl) == 0x000008, "Wrong alignment on UAnimNotifyState_BoneScaleControl");
static_assert(sizeof(UAnimNotifyState_BoneScaleControl) == 0x000040, "Wrong size on UAnimNotifyState_BoneScaleControl");
static_assert(offsetof(UAnimNotifyState_BoneScaleControl, TargetOption) == 0x000030, "Member 'UAnimNotifyState_BoneScaleControl::TargetOption' has a wrong offset!");

// Class TLScene.TLScenarioPreloadingVolume
// 0x0058 (0x0300 - 0x02A8)
class ATLScenarioPreloadingVolume final : public AVolume
{
public:
	ETLScenarioPreloadingReleaseType              PreloadingReleaseType;                             // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PreloadingReleaseTag;                              // 0x02AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ConditionCodeGroupID;                              // 0x02B8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LevelSequencePath;                                 // 0x02C8(0x0018)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                LevelSequencePathList;                             // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 AdditionalClassPathList;                           // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void OnBeginOverlap(class AActor* MyActor, class AActor* OtherActor);
	void OnEndOverlap(class AActor* MyActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLScenarioPreloadingVolume">();
	}
	static class ATLScenarioPreloadingVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATLScenarioPreloadingVolume>();
	}
};
static_assert(alignof(ATLScenarioPreloadingVolume) == 0x000008, "Wrong alignment on ATLScenarioPreloadingVolume");
static_assert(sizeof(ATLScenarioPreloadingVolume) == 0x000300, "Wrong size on ATLScenarioPreloadingVolume");
static_assert(offsetof(ATLScenarioPreloadingVolume, PreloadingReleaseType) == 0x0002A8, "Member 'ATLScenarioPreloadingVolume::PreloadingReleaseType' has a wrong offset!");
static_assert(offsetof(ATLScenarioPreloadingVolume, PreloadingReleaseTag) == 0x0002AC, "Member 'ATLScenarioPreloadingVolume::PreloadingReleaseTag' has a wrong offset!");
static_assert(offsetof(ATLScenarioPreloadingVolume, ConditionCodeGroupID) == 0x0002B8, "Member 'ATLScenarioPreloadingVolume::ConditionCodeGroupID' has a wrong offset!");
static_assert(offsetof(ATLScenarioPreloadingVolume, LevelSequencePath) == 0x0002C8, "Member 'ATLScenarioPreloadingVolume::LevelSequencePath' has a wrong offset!");
static_assert(offsetof(ATLScenarioPreloadingVolume, LevelSequencePathList) == 0x0002E0, "Member 'ATLScenarioPreloadingVolume::LevelSequencePathList' has a wrong offset!");
static_assert(offsetof(ATLScenarioPreloadingVolume, AdditionalClassPathList) == 0x0002F0, "Member 'ATLScenarioPreloadingVolume::AdditionalClassPathList' has a wrong offset!");

// Class TLScene.TLGCObjectReferencer
// 0x0040 (0x0068 - 0x0028)
class UTLGCObjectReferencer final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLGCObjectReferencer">();
	}
	static class UTLGCObjectReferencer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLGCObjectReferencer>();
	}
};
static_assert(alignof(UTLGCObjectReferencer) == 0x000008, "Wrong alignment on UTLGCObjectReferencer");
static_assert(sizeof(UTLGCObjectReferencer) == 0x000068, "Wrong size on UTLGCObjectReferencer");

// Class TLScene.AggregatedLandscapeLOD
// 0x00D0 (0x0300 - 0x0230)
class AAggregatedLandscapeLOD final : public AActor
{
public:
	class UMaterial*                              Material;                                          // 0x0230(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProceduralMeshComponent*               ProceduralMeshComponent;                           // 0x0238(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0xC0];                                     // 0x0240(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AggregatedLandscapeLOD">();
	}
	static class AAggregatedLandscapeLOD* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAggregatedLandscapeLOD>();
	}
};
static_assert(alignof(AAggregatedLandscapeLOD) == 0x000008, "Wrong alignment on AAggregatedLandscapeLOD");
static_assert(sizeof(AAggregatedLandscapeLOD) == 0x000300, "Wrong size on AAggregatedLandscapeLOD");
static_assert(offsetof(AAggregatedLandscapeLOD, Material) == 0x000230, "Member 'AAggregatedLandscapeLOD::Material' has a wrong offset!");
static_assert(offsetof(AAggregatedLandscapeLOD, ProceduralMeshComponent) == 0x000238, "Member 'AAggregatedLandscapeLOD::ProceduralMeshComponent' has a wrong offset!");

// Class TLScene.TLSoundComponent
// 0x00F0 (0x04E0 - 0x03F0)
class UTLSoundComponent final : public UAkComponent
{
public:
	bool                                          bOverrideAttenuation;                              // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OmniRadius;                                        // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeBand;                                          // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeScalingFactor;                               // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           AudioTags;                                         // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReverseAudioTagsBehavior;                          // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_411[0xCF];                                     // 0x0411(0x00CF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLSoundComponent">();
	}
	static class UTLSoundComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLSoundComponent>();
	}
};
static_assert(alignof(UTLSoundComponent) == 0x000010, "Wrong alignment on UTLSoundComponent");
static_assert(sizeof(UTLSoundComponent) == 0x0004E0, "Wrong size on UTLSoundComponent");
static_assert(offsetof(UTLSoundComponent, bOverrideAttenuation) == 0x0003F0, "Member 'UTLSoundComponent::bOverrideAttenuation' has a wrong offset!");
static_assert(offsetof(UTLSoundComponent, OmniRadius) == 0x0003F4, "Member 'UTLSoundComponent::OmniRadius' has a wrong offset!");
static_assert(offsetof(UTLSoundComponent, FadeBand) == 0x0003F8, "Member 'UTLSoundComponent::FadeBand' has a wrong offset!");
static_assert(offsetof(UTLSoundComponent, VolumeScalingFactor) == 0x0003FC, "Member 'UTLSoundComponent::VolumeScalingFactor' has a wrong offset!");
static_assert(offsetof(UTLSoundComponent, AudioTags) == 0x000400, "Member 'UTLSoundComponent::AudioTags' has a wrong offset!");
static_assert(offsetof(UTLSoundComponent, ReverseAudioTagsBehavior) == 0x000410, "Member 'UTLSoundComponent::ReverseAudioTagsBehavior' has a wrong offset!");

// Class TLScene.SystemAnimation
// 0x0010 (0x0038 - 0x0028)
class USystemAnimation final : public UObject
{
public:
	TArray<struct FSystemAnimationSequential>     Sequentials;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SystemAnimation">();
	}
	static class USystemAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<USystemAnimation>();
	}
};
static_assert(alignof(USystemAnimation) == 0x000008, "Wrong alignment on USystemAnimation");
static_assert(sizeof(USystemAnimation) == 0x000038, "Wrong size on USystemAnimation");
static_assert(offsetof(USystemAnimation, Sequentials) == 0x000028, "Member 'USystemAnimation::Sequentials' has a wrong offset!");

// Class TLScene.AnimData
// 0x2B108 (0x2B138 - 0x0030)
class UAnimData final : public UPrimaryDataAsset
{
public:
	TSoftClassPtr<class UClass>                   AnimInstanceClass;                                 // 0x0030(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   LocomotionAnimInstanceClass;                       // 0x0058(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimBlueprint*                         LinkedAnimBlueprint;                               // 0x0080(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimBlueprint*                         LinkedOverrideLocomotionBP;                        // 0x0088(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimDataMontageSet                    MontageSets[0x24];                                 // 0x0090(0x0098)(Edit, NativeAccessSpecifierPublic)
	struct FStanceAnimationSet                    LocomotionState[0x24];                             // 0x15F0(0x11F8)(Edit, NativeAccessSpecifierPublic)
	struct FAnimDataBlendSpaceSet                 BlendSpaceSets[0x24];                              // 0x29CD0(0x0050)(Edit, NativeAccessSpecifierPublic)
	class UNCIKRig*                               NCIKRig;                                           // 0x2A810(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAnimDataSubstance>             Substances;                                        // 0x2A818(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAnimDataSystemAnimation>       SystemAnimations;                                  // 0x2A828(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAnimDataSequenceTable                 SequenceTables[0x24];                              // 0x2A838(0x0040)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimData">();
	}
	static class UAnimData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimData>();
	}
};
static_assert(alignof(UAnimData) == 0x000008, "Wrong alignment on UAnimData");
static_assert(sizeof(UAnimData) == 0x02B138, "Wrong size on UAnimData");
static_assert(offsetof(UAnimData, AnimInstanceClass) == 0x000030, "Member 'UAnimData::AnimInstanceClass' has a wrong offset!");
static_assert(offsetof(UAnimData, LocomotionAnimInstanceClass) == 0x000058, "Member 'UAnimData::LocomotionAnimInstanceClass' has a wrong offset!");
static_assert(offsetof(UAnimData, LinkedAnimBlueprint) == 0x000080, "Member 'UAnimData::LinkedAnimBlueprint' has a wrong offset!");
static_assert(offsetof(UAnimData, LinkedOverrideLocomotionBP) == 0x000088, "Member 'UAnimData::LinkedOverrideLocomotionBP' has a wrong offset!");
static_assert(offsetof(UAnimData, MontageSets) == 0x000090, "Member 'UAnimData::MontageSets' has a wrong offset!");
static_assert(offsetof(UAnimData, LocomotionState) == 0x0015F0, "Member 'UAnimData::LocomotionState' has a wrong offset!");
static_assert(offsetof(UAnimData, BlendSpaceSets) == 0x029CD0, "Member 'UAnimData::BlendSpaceSets' has a wrong offset!");
static_assert(offsetof(UAnimData, NCIKRig) == 0x02A810, "Member 'UAnimData::NCIKRig' has a wrong offset!");
static_assert(offsetof(UAnimData, Substances) == 0x02A818, "Member 'UAnimData::Substances' has a wrong offset!");
static_assert(offsetof(UAnimData, SystemAnimations) == 0x02A828, "Member 'UAnimData::SystemAnimations' has a wrong offset!");
static_assert(offsetof(UAnimData, SequenceTables) == 0x02A838, "Member 'UAnimData::SequenceTables' has a wrong offset!");

// Class TLScene.SceneBoneScaleDef
// 0x0018 (0x0040 - 0x0028)
class USceneBoneScaleDef final : public UObject
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSceneBoneScaleGroup>           Groups;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SceneBoneScaleDef">();
	}
	static class USceneBoneScaleDef* GetDefaultObj()
	{
		return GetDefaultObjImpl<USceneBoneScaleDef>();
	}
};
static_assert(alignof(USceneBoneScaleDef) == 0x000008, "Wrong alignment on USceneBoneScaleDef");
static_assert(sizeof(USceneBoneScaleDef) == 0x000040, "Wrong size on USceneBoneScaleDef");
static_assert(offsetof(USceneBoneScaleDef, Skeleton) == 0x000028, "Member 'USceneBoneScaleDef::Skeleton' has a wrong offset!");
static_assert(offsetof(USceneBoneScaleDef, Groups) == 0x000030, "Member 'USceneBoneScaleDef::Groups' has a wrong offset!");

// Class TLScene.AnimNotifyState_AnimDynamics
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_AnimDynamics final : public UAnimNotifyState
{
public:
	float                                         SimulationVelocityUpdateScale;                     // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0034(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_AnimDynamics">();
	}
	static class UAnimNotifyState_AnimDynamics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_AnimDynamics>();
	}
};
static_assert(alignof(UAnimNotifyState_AnimDynamics) == 0x000008, "Wrong alignment on UAnimNotifyState_AnimDynamics");
static_assert(sizeof(UAnimNotifyState_AnimDynamics) == 0x000040, "Wrong size on UAnimNotifyState_AnimDynamics");
static_assert(offsetof(UAnimNotifyState_AnimDynamics, SimulationVelocityUpdateScale) == 0x000030, "Member 'UAnimNotifyState_AnimDynamics::SimulationVelocityUpdateScale' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_AnimDynamics, BlendInTime) == 0x000034, "Member 'UAnimNotifyState_AnimDynamics::BlendInTime' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_AnimDynamics, BlendOutTime) == 0x000038, "Member 'UAnimNotifyState_AnimDynamics::BlendOutTime' has a wrong offset!");

// Class TLScene.UnrealSceneBoidMovementComponent
// 0x0000 (0x0150 - 0x0150)
class UUnrealSceneBoidMovementComponent final : public UFloatingPawnMovement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnrealSceneBoidMovementComponent">();
	}
	static class UUnrealSceneBoidMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnrealSceneBoidMovementComponent>();
	}
};
static_assert(alignof(UUnrealSceneBoidMovementComponent) == 0x000008, "Wrong alignment on UUnrealSceneBoidMovementComponent");
static_assert(sizeof(UUnrealSceneBoidMovementComponent) == 0x000150, "Wrong size on UUnrealSceneBoidMovementComponent");

// Class TLScene.AnimNotify_CharacterSound
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_CharacterSound final : public UAnimNotify
{
public:
	class FName                                   CharacterSoundKey;                                 // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_CharacterSound">();
	}
	static class UAnimNotify_CharacterSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_CharacterSound>();
	}
};
static_assert(alignof(UAnimNotify_CharacterSound) == 0x000008, "Wrong alignment on UAnimNotify_CharacterSound");
static_assert(sizeof(UAnimNotify_CharacterSound) == 0x000040, "Wrong size on UAnimNotify_CharacterSound");
static_assert(offsetof(UAnimNotify_CharacterSound, CharacterSoundKey) == 0x000038, "Member 'UAnimNotify_CharacterSound::CharacterSoundKey' has a wrong offset!");

// Class TLScene.AnimNotify_DropLinkedItems
// 0x0020 (0x0058 - 0x0038)
class UAnimNotify_DropLinkedItems final : public UAnimNotify
{
public:
	bool                                          bRestore;                                          // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RandomDelay;                                       // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDropAllWeapons;                                   // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESnModelSocketPoint                           TargetSocket;                                      // 0x0041(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ImpulseDirection;                                  // 0x0044(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ImpulseMagnitude;                                  // 0x0050(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpulseDistance;                                   // 0x0054(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_DropLinkedItems">();
	}
	static class UAnimNotify_DropLinkedItems* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_DropLinkedItems>();
	}
};
static_assert(alignof(UAnimNotify_DropLinkedItems) == 0x000008, "Wrong alignment on UAnimNotify_DropLinkedItems");
static_assert(sizeof(UAnimNotify_DropLinkedItems) == 0x000058, "Wrong size on UAnimNotify_DropLinkedItems");
static_assert(offsetof(UAnimNotify_DropLinkedItems, bRestore) == 0x000038, "Member 'UAnimNotify_DropLinkedItems::bRestore' has a wrong offset!");
static_assert(offsetof(UAnimNotify_DropLinkedItems, RandomDelay) == 0x00003C, "Member 'UAnimNotify_DropLinkedItems::RandomDelay' has a wrong offset!");
static_assert(offsetof(UAnimNotify_DropLinkedItems, bDropAllWeapons) == 0x000040, "Member 'UAnimNotify_DropLinkedItems::bDropAllWeapons' has a wrong offset!");
static_assert(offsetof(UAnimNotify_DropLinkedItems, TargetSocket) == 0x000041, "Member 'UAnimNotify_DropLinkedItems::TargetSocket' has a wrong offset!");
static_assert(offsetof(UAnimNotify_DropLinkedItems, ImpulseDirection) == 0x000044, "Member 'UAnimNotify_DropLinkedItems::ImpulseDirection' has a wrong offset!");
static_assert(offsetof(UAnimNotify_DropLinkedItems, ImpulseMagnitude) == 0x000050, "Member 'UAnimNotify_DropLinkedItems::ImpulseMagnitude' has a wrong offset!");
static_assert(offsetof(UAnimNotify_DropLinkedItems, ImpulseDistance) == 0x000054, "Member 'UAnimNotify_DropLinkedItems::ImpulseDistance' has a wrong offset!");

// Class TLScene.UnrealSceneSimpleActor
// 0x0078 (0x02A8 - 0x0230)
class AUnrealSceneSimpleActor : public AActor
{
public:
	uint8                                         Pad_230[0x20];                                     // 0x0230(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x0250(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUnrealSceneRootComponent*              SceneRootComponent;                                // 0x0258(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTLActionTreeComponent*                 ActionTreeComponent;                               // 0x0260(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTLGameFXComponent*                     GameFXComponent;                                   // 0x0268(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_270[0x28];                                     // 0x0270(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTasksComponent*                GameplayTasksComponent;                            // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnrealSceneSimpleActor">();
	}
	static class AUnrealSceneSimpleActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnrealSceneSimpleActor>();
	}
};
static_assert(alignof(AUnrealSceneSimpleActor) == 0x000008, "Wrong alignment on AUnrealSceneSimpleActor");
static_assert(sizeof(AUnrealSceneSimpleActor) == 0x0002A8, "Wrong size on AUnrealSceneSimpleActor");
static_assert(offsetof(AUnrealSceneSimpleActor, CapsuleComponent) == 0x000250, "Member 'AUnrealSceneSimpleActor::CapsuleComponent' has a wrong offset!");
static_assert(offsetof(AUnrealSceneSimpleActor, SceneRootComponent) == 0x000258, "Member 'AUnrealSceneSimpleActor::SceneRootComponent' has a wrong offset!");
static_assert(offsetof(AUnrealSceneSimpleActor, ActionTreeComponent) == 0x000260, "Member 'AUnrealSceneSimpleActor::ActionTreeComponent' has a wrong offset!");
static_assert(offsetof(AUnrealSceneSimpleActor, GameFXComponent) == 0x000268, "Member 'AUnrealSceneSimpleActor::GameFXComponent' has a wrong offset!");
static_assert(offsetof(AUnrealSceneSimpleActor, GameplayTasksComponent) == 0x000298, "Member 'AUnrealSceneSimpleActor::GameplayTasksComponent' has a wrong offset!");

// Class TLScene.TLSkillIndicatorActor
// 0x0180 (0x0428 - 0x02A8)
class ATLSkillIndicatorActor final : public AUnrealSceneSimpleActor
{
public:
	uint8                                         Pad_2A8[0x180];                                    // 0x02A8(0x0180)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLSkillIndicatorActor">();
	}
	static class ATLSkillIndicatorActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATLSkillIndicatorActor>();
	}
};
static_assert(alignof(ATLSkillIndicatorActor) == 0x000008, "Wrong alignment on ATLSkillIndicatorActor");
static_assert(sizeof(ATLSkillIndicatorActor) == 0x000428, "Wrong size on ATLSkillIndicatorActor");

// Class TLScene.AnimNotify_EquipSocket
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_EquipSocket final : public UAnimNotify
{
public:
	TArray<struct FHandleEquipSocketInfo>         HandleSocketInfos;                                 // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EquipSocket">();
	}
	static class UAnimNotify_EquipSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EquipSocket>();
	}
};
static_assert(alignof(UAnimNotify_EquipSocket) == 0x000008, "Wrong alignment on UAnimNotify_EquipSocket");
static_assert(sizeof(UAnimNotify_EquipSocket) == 0x000048, "Wrong size on UAnimNotify_EquipSocket");
static_assert(offsetof(UAnimNotify_EquipSocket, HandleSocketInfos) == 0x000038, "Member 'UAnimNotify_EquipSocket::HandleSocketInfos' has a wrong offset!");

// Class TLScene.AnimNotifyState_EquipSocket
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_EquipSocket final : public UAnimNotifyState
{
public:
	TArray<struct FHandleEquipSocketInfo>         HandleSocketInfos;                                 // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_EquipSocket">();
	}
	static class UAnimNotifyState_EquipSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_EquipSocket>();
	}
};
static_assert(alignof(UAnimNotifyState_EquipSocket) == 0x000008, "Wrong alignment on UAnimNotifyState_EquipSocket");
static_assert(sizeof(UAnimNotifyState_EquipSocket) == 0x000040, "Wrong size on UAnimNotifyState_EquipSocket");
static_assert(offsetof(UAnimNotifyState_EquipSocket, HandleSocketInfos) == 0x000030, "Member 'UAnimNotifyState_EquipSocket::HandleSocketInfos' has a wrong offset!");

// Class TLScene.UnrealSceneBoidTrackActor
// 0x0008 (0x0238 - 0x0230)
class AUnrealSceneBoidTrackActor final : public ATargetPoint
{
public:
	class UUnrealSceneBoidTrackPathComponent*     PathComponent;                                     // 0x0230(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnrealSceneBoidTrackActor">();
	}
	static class AUnrealSceneBoidTrackActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnrealSceneBoidTrackActor>();
	}
};
static_assert(alignof(AUnrealSceneBoidTrackActor) == 0x000008, "Wrong alignment on AUnrealSceneBoidTrackActor");
static_assert(sizeof(AUnrealSceneBoidTrackActor) == 0x000238, "Wrong size on AUnrealSceneBoidTrackActor");
static_assert(offsetof(AUnrealSceneBoidTrackActor, PathComponent) == 0x000230, "Member 'AUnrealSceneBoidTrackActor::PathComponent' has a wrong offset!");

// Class TLScene.AnimNotify_FishingEvent
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_FishingEvent final : public UAnimNotify
{
public:
	ETLAnimNotifyFishingEvent                     FishingEventType;                                  // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_FishingEvent">();
	}
	static class UAnimNotify_FishingEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_FishingEvent>();
	}
};
static_assert(alignof(UAnimNotify_FishingEvent) == 0x000008, "Wrong alignment on UAnimNotify_FishingEvent");
static_assert(sizeof(UAnimNotify_FishingEvent) == 0x000040, "Wrong size on UAnimNotify_FishingEvent");
static_assert(offsetof(UAnimNotify_FishingEvent, FishingEventType) == 0x000038, "Member 'UAnimNotify_FishingEvent::FishingEventType' has a wrong offset!");

// Class TLScene.AnimNotifyState_FishingEvent
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_FishingEvent final : public UAnimNotifyState
{
public:
	ETLAnimNotifyFishingEvent                     FishingEventType;                                  // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_FishingEvent">();
	}
	static class UAnimNotifyState_FishingEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_FishingEvent>();
	}
};
static_assert(alignof(UAnimNotifyState_FishingEvent) == 0x000008, "Wrong alignment on UAnimNotifyState_FishingEvent");
static_assert(sizeof(UAnimNotifyState_FishingEvent) == 0x000038, "Wrong size on UAnimNotifyState_FishingEvent");
static_assert(offsetof(UAnimNotifyState_FishingEvent, FishingEventType) == 0x000030, "Member 'UAnimNotifyState_FishingEvent::FishingEventType' has a wrong offset!");

// Class TLScene.TLPooledActor
// 0x0018 (0x0248 - 0x0230)
class ATLPooledActor : public AActor
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLActorPool*                           AssignedPool;                                      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLPooledActor">();
	}
	static class ATLPooledActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATLPooledActor>();
	}
};
static_assert(alignof(ATLPooledActor) == 0x000008, "Wrong alignment on ATLPooledActor");
static_assert(sizeof(ATLPooledActor) == 0x000248, "Wrong size on ATLPooledActor");
static_assert(offsetof(ATLPooledActor, AssignedPool) == 0x000238, "Member 'ATLPooledActor::AssignedPool' has a wrong offset!");

// Class TLScene.TLWorldSpawnGameFX
// 0x0040 (0x0288 - 0x0248)
class ATLWorldSpawnGameFX final : public ATLPooledActor
{
public:
	uint8                                         Pad_248[0x10];                                     // 0x0248(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnrealSceneRootComponent*              SceneRootComponent;                                // 0x0258(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0x21];                                     // 0x0260(0x0021)(Fixing Size After Last Property [ Dumper-7 ])
	ESnEffectBudgetCategory                       FXBudgetCategory;                                  // 0x0281(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLWorldSpawnGameFX">();
	}
	static class ATLWorldSpawnGameFX* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATLWorldSpawnGameFX>();
	}
};
static_assert(alignof(ATLWorldSpawnGameFX) == 0x000008, "Wrong alignment on ATLWorldSpawnGameFX");
static_assert(sizeof(ATLWorldSpawnGameFX) == 0x000288, "Wrong size on ATLWorldSpawnGameFX");
static_assert(offsetof(ATLWorldSpawnGameFX, SceneRootComponent) == 0x000258, "Member 'ATLWorldSpawnGameFX::SceneRootComponent' has a wrong offset!");
static_assert(offsetof(ATLWorldSpawnGameFX, FXBudgetCategory) == 0x000281, "Member 'ATLWorldSpawnGameFX::FXBudgetCategory' has a wrong offset!");

// Class TLScene.AnimNotify_HitStop
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_HitStop final : public UAnimNotify
{
public:
	bool                                          bMyPcOnly;                                         // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESnHitStopAnimationType                       Type;                                              // 0x0039(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Exponent;                                          // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Duration;                                          // 0x0040(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ActionSpeedScaleFactor;                            // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_HitStop">();
	}
	static class UAnimNotify_HitStop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_HitStop>();
	}
};
static_assert(alignof(UAnimNotify_HitStop) == 0x000008, "Wrong alignment on UAnimNotify_HitStop");
static_assert(sizeof(UAnimNotify_HitStop) == 0x000048, "Wrong size on UAnimNotify_HitStop");
static_assert(offsetof(UAnimNotify_HitStop, bMyPcOnly) == 0x000038, "Member 'UAnimNotify_HitStop::bMyPcOnly' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HitStop, Type) == 0x000039, "Member 'UAnimNotify_HitStop::Type' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HitStop, Exponent) == 0x00003C, "Member 'UAnimNotify_HitStop::Exponent' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HitStop, Duration) == 0x000040, "Member 'UAnimNotify_HitStop::Duration' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HitStop, ActionSpeedScaleFactor) == 0x000044, "Member 'UAnimNotify_HitStop::ActionSpeedScaleFactor' has a wrong offset!");

// Class TLScene.AnimNotify_NameplateUpdateMode
// 0x0018 (0x0050 - 0x0038)
class UAnimNotify_NameplateUpdateMode final : public UAnimNotify
{
public:
	ESnNameplateUpdateMode                        UpdateMode;                                        // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetFromRoot;                                    // 0x003C(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HeightOffsetFromHead;                              // 0x0048(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BlendingDuration;                                  // 0x004C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_NameplateUpdateMode">();
	}
	static class UAnimNotify_NameplateUpdateMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_NameplateUpdateMode>();
	}
};
static_assert(alignof(UAnimNotify_NameplateUpdateMode) == 0x000008, "Wrong alignment on UAnimNotify_NameplateUpdateMode");
static_assert(sizeof(UAnimNotify_NameplateUpdateMode) == 0x000050, "Wrong size on UAnimNotify_NameplateUpdateMode");
static_assert(offsetof(UAnimNotify_NameplateUpdateMode, UpdateMode) == 0x000038, "Member 'UAnimNotify_NameplateUpdateMode::UpdateMode' has a wrong offset!");
static_assert(offsetof(UAnimNotify_NameplateUpdateMode, OffsetFromRoot) == 0x00003C, "Member 'UAnimNotify_NameplateUpdateMode::OffsetFromRoot' has a wrong offset!");
static_assert(offsetof(UAnimNotify_NameplateUpdateMode, HeightOffsetFromHead) == 0x000048, "Member 'UAnimNotify_NameplateUpdateMode::HeightOffsetFromHead' has a wrong offset!");
static_assert(offsetof(UAnimNotify_NameplateUpdateMode, BlendingDuration) == 0x00004C, "Member 'UAnimNotify_NameplateUpdateMode::BlendingDuration' has a wrong offset!");

// Class TLScene.TLWindIndicatorGuideActor
// 0x0158 (0x0400 - 0x02A8)
class ATLWindIndicatorGuideActor final : public AUnrealSceneSimpleActor
{
public:
	uint8                                         Pad_2A8[0x150];                                    // 0x02A8(0x0150)(Fixing Size After Last Property [ Dumper-7 ])
	class ATLCharacter*                           AttachParentCharacter;                             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLWindIndicatorGuideActor">();
	}
	static class ATLWindIndicatorGuideActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATLWindIndicatorGuideActor>();
	}
};
static_assert(alignof(ATLWindIndicatorGuideActor) == 0x000008, "Wrong alignment on ATLWindIndicatorGuideActor");
static_assert(sizeof(ATLWindIndicatorGuideActor) == 0x000400, "Wrong size on ATLWindIndicatorGuideActor");
static_assert(offsetof(ATLWindIndicatorGuideActor, AttachParentCharacter) == 0x0003F8, "Member 'ATLWindIndicatorGuideActor::AttachParentCharacter' has a wrong offset!");

// Class TLScene.AnimNotify_PhysicalFootprint
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_PhysicalFootprint final : public UAnimNotify
{
public:
	ESnFootprintSocketPoint                       FootprintSocket;                                   // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipFootstepSound;                                // 0x0039(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PhysicalFootprint">();
	}
	static class UAnimNotify_PhysicalFootprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PhysicalFootprint>();
	}
};
static_assert(alignof(UAnimNotify_PhysicalFootprint) == 0x000008, "Wrong alignment on UAnimNotify_PhysicalFootprint");
static_assert(sizeof(UAnimNotify_PhysicalFootprint) == 0x000040, "Wrong size on UAnimNotify_PhysicalFootprint");
static_assert(offsetof(UAnimNotify_PhysicalFootprint, FootprintSocket) == 0x000038, "Member 'UAnimNotify_PhysicalFootprint::FootprintSocket' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PhysicalFootprint, bSkipFootstepSound) == 0x000039, "Member 'UAnimNotify_PhysicalFootprint::bSkipFootstepSound' has a wrong offset!");

// Class TLScene.AnimNotify_SystemSct
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_SystemSct final : public UAnimNotify
{
public:
	ESnAnimNotifyTriggerSystemSct                 SystemSct;                                         // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_SystemSct">();
	}
	static class UAnimNotify_SystemSct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_SystemSct>();
	}
};
static_assert(alignof(UAnimNotify_SystemSct) == 0x000008, "Wrong alignment on UAnimNotify_SystemSct");
static_assert(sizeof(UAnimNotify_SystemSct) == 0x000040, "Wrong size on UAnimNotify_SystemSct");
static_assert(offsetof(UAnimNotify_SystemSct, SystemSct) == 0x000038, "Member 'UAnimNotify_SystemSct::SystemSct' has a wrong offset!");

// Class TLScene.TLSpringArmComponent
// 0x0050 (0x02E0 - 0x0290)
class UTLSpringArmComponent final : public USpringArmComponent
{
public:
	uint8                                         Pad_290[0x50];                                     // 0x0290(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLSpringArmComponent">();
	}
	static class UTLSpringArmComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLSpringArmComponent>();
	}
};
static_assert(alignof(UTLSpringArmComponent) == 0x000010, "Wrong alignment on UTLSpringArmComponent");
static_assert(sizeof(UTLSpringArmComponent) == 0x0002E0, "Wrong size on UTLSpringArmComponent");

// Class TLScene.AnimNotifyState_SystemSct
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_SystemSct final : public UAnimNotifyState
{
public:
	ESnAnimNotifyTriggerSystemSct                 SystemSct;                                         // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Condition;                                         // 0x0034(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_SystemSct">();
	}
	static class UAnimNotifyState_SystemSct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SystemSct>();
	}
};
static_assert(alignof(UAnimNotifyState_SystemSct) == 0x000008, "Wrong alignment on UAnimNotifyState_SystemSct");
static_assert(sizeof(UAnimNotifyState_SystemSct) == 0x000040, "Wrong size on UAnimNotifyState_SystemSct");
static_assert(offsetof(UAnimNotifyState_SystemSct, SystemSct) == 0x000030, "Member 'UAnimNotifyState_SystemSct::SystemSct' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_SystemSct, Condition) == 0x000034, "Member 'UAnimNotifyState_SystemSct::Condition' has a wrong offset!");

// Class TLScene.AnimNotify_TLPlaySound
// 0x0058 (0x0090 - 0x0038)
class UAnimNotify_TLPlaySound final : public UAnimNotify
{
public:
	class UTLSoundEvent*                          SoundEvent;                                        // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_TLPlaySound">();
	}
	static class UAnimNotify_TLPlaySound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_TLPlaySound>();
	}
};
static_assert(alignof(UAnimNotify_TLPlaySound) == 0x000008, "Wrong alignment on UAnimNotify_TLPlaySound");
static_assert(sizeof(UAnimNotify_TLPlaySound) == 0x000090, "Wrong size on UAnimNotify_TLPlaySound");
static_assert(offsetof(UAnimNotify_TLPlaySound, SoundEvent) == 0x000038, "Member 'UAnimNotify_TLPlaySound::SoundEvent' has a wrong offset!");

// Class TLScene.TLWorldSettings
// 0x0038 (0x03E8 - 0x03B0)
class ATLWorldSettings final : public AWorldSettings
{
public:
	bool                                          bCloudIgnoreFreeze;                                // 0x03B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  EventEnvironmentVolumeRank1;                       // 0x03B4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  EventEnvironmentVolumeRank2;                       // 0x03C4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  EventEnvironmentVolumeRank3;                       // 0x03D4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClientGravity;                                     // 0x03E4(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLWorldSettings">();
	}
	static class ATLWorldSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATLWorldSettings>();
	}
};
static_assert(alignof(ATLWorldSettings) == 0x000008, "Wrong alignment on ATLWorldSettings");
static_assert(sizeof(ATLWorldSettings) == 0x0003E8, "Wrong size on ATLWorldSettings");
static_assert(offsetof(ATLWorldSettings, bCloudIgnoreFreeze) == 0x0003B0, "Member 'ATLWorldSettings::bCloudIgnoreFreeze' has a wrong offset!");
static_assert(offsetof(ATLWorldSettings, EventEnvironmentVolumeRank1) == 0x0003B4, "Member 'ATLWorldSettings::EventEnvironmentVolumeRank1' has a wrong offset!");
static_assert(offsetof(ATLWorldSettings, EventEnvironmentVolumeRank2) == 0x0003C4, "Member 'ATLWorldSettings::EventEnvironmentVolumeRank2' has a wrong offset!");
static_assert(offsetof(ATLWorldSettings, EventEnvironmentVolumeRank3) == 0x0003D4, "Member 'ATLWorldSettings::EventEnvironmentVolumeRank3' has a wrong offset!");
static_assert(offsetof(ATLWorldSettings, ClientGravity) == 0x0003E4, "Member 'ATLWorldSettings::ClientGravity' has a wrong offset!");

// Class TLScene.AnimNotify_Trigger
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_Trigger final : public UAnimNotify
{
public:
	class FName                                   TriggerName;                                       // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_Trigger">();
	}
	static class UAnimNotify_Trigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_Trigger>();
	}
};
static_assert(alignof(UAnimNotify_Trigger) == 0x000008, "Wrong alignment on UAnimNotify_Trigger");
static_assert(sizeof(UAnimNotify_Trigger) == 0x000040, "Wrong size on UAnimNotify_Trigger");
static_assert(offsetof(UAnimNotify_Trigger, TriggerName) == 0x000038, "Member 'UAnimNotify_Trigger::TriggerName' has a wrong offset!");

// Class TLScene.AnimNotifyState_EnableIK
// 0x0020 (0x0050 - 0x0030)
class UAnimNotifyState_EnableIK final : public UAnimNotifyState
{
public:
	EIKType                                       IKType;                                            // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInverse;                                          // 0x0031(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendInTime;                                       // 0x0034(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlendOutTime;                                      // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                HandIKLookAtAxis;                                  // 0x003C(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bArmIKProjectile;                                  // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandIKProjectile;                                 // 0x0049(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_EnableIK">();
	}
	static class UAnimNotifyState_EnableIK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_EnableIK>();
	}
};
static_assert(alignof(UAnimNotifyState_EnableIK) == 0x000008, "Wrong alignment on UAnimNotifyState_EnableIK");
static_assert(sizeof(UAnimNotifyState_EnableIK) == 0x000050, "Wrong size on UAnimNotifyState_EnableIK");
static_assert(offsetof(UAnimNotifyState_EnableIK, IKType) == 0x000030, "Member 'UAnimNotifyState_EnableIK::IKType' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_EnableIK, bInverse) == 0x000031, "Member 'UAnimNotifyState_EnableIK::bInverse' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_EnableIK, BlendInTime) == 0x000034, "Member 'UAnimNotifyState_EnableIK::BlendInTime' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_EnableIK, BlendOutTime) == 0x000038, "Member 'UAnimNotifyState_EnableIK::BlendOutTime' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_EnableIK, HandIKLookAtAxis) == 0x00003C, "Member 'UAnimNotifyState_EnableIK::HandIKLookAtAxis' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_EnableIK, bArmIKProjectile) == 0x000048, "Member 'UAnimNotifyState_EnableIK::bArmIKProjectile' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_EnableIK, bHandIKProjectile) == 0x000049, "Member 'UAnimNotifyState_EnableIK::bHandIKProjectile' has a wrong offset!");

// Class TLScene.SceneCompositeBeardDef
// 0x0088 (0x00B8 - 0x0030)
class USceneCompositeBeardDef final : public UPrimaryDataAsset
{
