#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TLScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TLScene_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function TLScene.TLScenarioPreloadingVolume.OnBeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct TLScenarioPreloadingVolume_OnBeginOverlap final
{
public:
	class AActor*                                 MyActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLScenarioPreloadingVolume_OnBeginOverlap) == 0x000008, "Wrong alignment on TLScenarioPreloadingVolume_OnBeginOverlap");
static_assert(sizeof(TLScenarioPreloadingVolume_OnBeginOverlap) == 0x000010, "Wrong size on TLScenarioPreloadingVolume_OnBeginOverlap");
static_assert(offsetof(TLScenarioPreloadingVolume_OnBeginOverlap, MyActor) == 0x000000, "Member 'TLScenarioPreloadingVolume_OnBeginOverlap::MyActor' has a wrong offset!");
static_assert(offsetof(TLScenarioPreloadingVolume_OnBeginOverlap, OtherActor) == 0x000008, "Member 'TLScenarioPreloadingVolume_OnBeginOverlap::OtherActor' has a wrong offset!");

// Function TLScene.TLScenarioPreloadingVolume.OnEndOverlap
// 0x0010 (0x0010 - 0x0000)
struct TLScenarioPreloadingVolume_OnEndOverlap final
{
public:
	class AActor*                                 MyActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLScenarioPreloadingVolume_OnEndOverlap) == 0x000008, "Wrong alignment on TLScenarioPreloadingVolume_OnEndOverlap");
static_assert(sizeof(TLScenarioPreloadingVolume_OnEndOverlap) == 0x000010, "Wrong size on TLScenarioPreloadingVolume_OnEndOverlap");
static_assert(offsetof(TLScenarioPreloadingVolume_OnEndOverlap, MyActor) == 0x000000, "Member 'TLScenarioPreloadingVolume_OnEndOverlap::MyActor' has a wrong offset!");
static_assert(offsetof(TLScenarioPreloadingVolume_OnEndOverlap, OtherActor) == 0x000008, "Member 'TLScenarioPreloadingVolume_OnEndOverlap::OtherActor' has a wrong offset!");

// Function TLScene.UnrealCameraActor.GetCameraTypeBP
// 0x0001 (0x0001 - 0x0000)
struct UnrealCameraActor_GetCameraTypeBP final
{
public:
	ESnCameraType                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCameraActor_GetCameraTypeBP) == 0x000001, "Wrong alignment on UnrealCameraActor_GetCameraTypeBP");
static_assert(sizeof(UnrealCameraActor_GetCameraTypeBP) == 0x000001, "Wrong size on UnrealCameraActor_GetCameraTypeBP");
static_assert(offsetof(UnrealCameraActor_GetCameraTypeBP, ReturnValue) == 0x000000, "Member 'UnrealCameraActor_GetCameraTypeBP::ReturnValue' has a wrong offset!");

// Function TLScene.UnrealCameraActor.GetFOVBP
// 0x0004 (0x0004 - 0x0000)
struct UnrealCameraActor_GetFOVBP final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCameraActor_GetFOVBP) == 0x000004, "Wrong alignment on UnrealCameraActor_GetFOVBP");
static_assert(sizeof(UnrealCameraActor_GetFOVBP) == 0x000004, "Wrong size on UnrealCameraActor_GetFOVBP");
static_assert(offsetof(UnrealCameraActor_GetFOVBP, ReturnValue) == 0x000000, "Member 'UnrealCameraActor_GetFOVBP::ReturnValue' has a wrong offset!");

// Function TLScene.UnrealCameraActor.GetPosittionBP
// 0x000C (0x000C - 0x0000)
struct UnrealCameraActor_GetPosittionBP final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCameraActor_GetPosittionBP) == 0x000004, "Wrong alignment on UnrealCameraActor_GetPosittionBP");
static_assert(sizeof(UnrealCameraActor_GetPosittionBP) == 0x00000C, "Wrong size on UnrealCameraActor_GetPosittionBP");
static_assert(offsetof(UnrealCameraActor_GetPosittionBP, ReturnValue) == 0x000000, "Member 'UnrealCameraActor_GetPosittionBP::ReturnValue' has a wrong offset!");

// Function TLScene.UnrealCameraActor.GetRotationBP
// 0x000C (0x000C - 0x0000)
struct UnrealCameraActor_GetRotationBP final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCameraActor_GetRotationBP) == 0x000004, "Wrong alignment on UnrealCameraActor_GetRotationBP");
static_assert(sizeof(UnrealCameraActor_GetRotationBP) == 0x00000C, "Wrong size on UnrealCameraActor_GetRotationBP");
static_assert(offsetof(UnrealCameraActor_GetRotationBP, ReturnValue) == 0x000000, "Member 'UnrealCameraActor_GetRotationBP::ReturnValue' has a wrong offset!");

// Function TLScene.UnrealCameraActor.SetFOVBP
// 0x0004 (0x0004 - 0x0000)
struct UnrealCameraActor_SetFOVBP final
{
public:
	float                                         InFOV;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCameraActor_SetFOVBP) == 0x000004, "Wrong alignment on UnrealCameraActor_SetFOVBP");
static_assert(sizeof(UnrealCameraActor_SetFOVBP) == 0x000004, "Wrong size on UnrealCameraActor_SetFOVBP");
static_assert(offsetof(UnrealCameraActor_SetFOVBP, InFOV) == 0x000000, "Member 'UnrealCameraActor_SetFOVBP::InFOV' has a wrong offset!");

// Function TLScene.UnrealCameraActor.SetPosisionBP
// 0x000C (0x000C - 0x0000)
struct UnrealCameraActor_SetPosisionBP final
{
public:
	struct FVector                                InPosition;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCameraActor_SetPosisionBP) == 0x000004, "Wrong alignment on UnrealCameraActor_SetPosisionBP");
static_assert(sizeof(UnrealCameraActor_SetPosisionBP) == 0x00000C, "Wrong size on UnrealCameraActor_SetPosisionBP");
static_assert(offsetof(UnrealCameraActor_SetPosisionBP, InPosition) == 0x000000, "Member 'UnrealCameraActor_SetPosisionBP::InPosition' has a wrong offset!");

// Function TLScene.UnrealCameraActor.SetRotationBP
// 0x000C (0x000C - 0x0000)
struct UnrealCameraActor_SetRotationBP final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCameraActor_SetRotationBP) == 0x000004, "Wrong alignment on UnrealCameraActor_SetRotationBP");
static_assert(sizeof(UnrealCameraActor_SetRotationBP) == 0x00000C, "Wrong size on UnrealCameraActor_SetRotationBP");
static_assert(offsetof(UnrealCameraActor_SetRotationBP, InRotation) == 0x000000, "Member 'UnrealCameraActor_SetRotationBP::InRotation' has a wrong offset!");

// Function TLScene.UnrealCutSceneCameraActor.OnUpdateCameraCut
// 0x0008 (0x0008 - 0x0000)
struct UnrealCutSceneCameraActor_OnUpdateCameraCut final
{
public:
	class UCameraComponent*                       CinemaCameraComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCutSceneCameraActor_OnUpdateCameraCut) == 0x000008, "Wrong alignment on UnrealCutSceneCameraActor_OnUpdateCameraCut");
static_assert(sizeof(UnrealCutSceneCameraActor_OnUpdateCameraCut) == 0x000008, "Wrong size on UnrealCutSceneCameraActor_OnUpdateCameraCut");
static_assert(offsetof(UnrealCutSceneCameraActor_OnUpdateCameraCut, CinemaCameraComponent) == 0x000000, "Member 'UnrealCutSceneCameraActor_OnUpdateCameraCut::CinemaCameraComponent' has a wrong offset!");

// Function TLScene.UnrealSceneBoidActor.TickMoveTimeline
// 0x0004 (0x0004 - 0x0000)
struct UnrealSceneBoidActor_TickMoveTimeline final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealSceneBoidActor_TickMoveTimeline) == 0x000004, "Wrong alignment on UnrealSceneBoidActor_TickMoveTimeline");
static_assert(sizeof(UnrealSceneBoidActor_TickMoveTimeline) == 0x000004, "Wrong size on UnrealSceneBoidActor_TickMoveTimeline");
static_assert(offsetof(UnrealSceneBoidActor_TickMoveTimeline, Value) == 0x000000, "Member 'UnrealSceneBoidActor_TickMoveTimeline::Value' has a wrong offset!");

// Function TLScene.GameplayTask_AttachMagicDoll.OnMasterCharacterMovementUpdated
// 0x001C (0x001C - 0x0000)
struct GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldLocation;                                       // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated) == 0x000004, "Wrong alignment on GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated");
static_assert(sizeof(GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated) == 0x00001C, "Wrong size on GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated");
static_assert(offsetof(GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated, DeltaSeconds) == 0x000000, "Member 'GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated, OldLocation) == 0x000004, "Member 'GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated::OldLocation' has a wrong offset!");
static_assert(offsetof(GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated, OldVelocity) == 0x000010, "Member 'GameplayTask_AttachMagicDoll_OnMasterCharacterMovementUpdated::OldVelocity' has a wrong offset!");

// Function TLScene.GameplayTask_AttachWorldObject.OnAttachedCollisionActorEndPlay
// 0x0010 (0x0010 - 0x0000)
struct GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay) == 0x000008, "Wrong alignment on GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay");
static_assert(sizeof(GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay) == 0x000010, "Wrong size on GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay");
static_assert(offsetof(GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay, Actor) == 0x000000, "Member 'GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay, EndPlayReason) == 0x000008, "Member 'GameplayTask_AttachWorldObject_OnAttachedCollisionActorEndPlay::EndPlayReason' has a wrong offset!");

// Function TLScene.GameplayTask_AttachWorldObject.OnAttachedParentEndPlay
// 0x0010 (0x0010 - 0x0000)
struct GameplayTask_AttachWorldObject_OnAttachedParentEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayTask_AttachWorldObject_OnAttachedParentEndPlay) == 0x000008, "Wrong alignment on GameplayTask_AttachWorldObject_OnAttachedParentEndPlay");
static_assert(sizeof(GameplayTask_AttachWorldObject_OnAttachedParentEndPlay) == 0x000010, "Wrong size on GameplayTask_AttachWorldObject_OnAttachedParentEndPlay");
static_assert(offsetof(GameplayTask_AttachWorldObject_OnAttachedParentEndPlay, Actor) == 0x000000, "Member 'GameplayTask_AttachWorldObject_OnAttachedParentEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(GameplayTask_AttachWorldObject_OnAttachedParentEndPlay, EndPlayReason) == 0x000008, "Member 'GameplayTask_AttachWorldObject_OnAttachedParentEndPlay::EndPlayReason' has a wrong offset!");

// Function TLScene.GameplayTask_Mount.OnMasterCharacterMovementUpdated
// 0x001C (0x001C - 0x0000)
struct GameplayTask_Mount_OnMasterCharacterMovementUpdated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldLocation;                                       // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayTask_Mount_OnMasterCharacterMovementUpdated) == 0x000004, "Wrong alignment on GameplayTask_Mount_OnMasterCharacterMovementUpdated");
static_assert(sizeof(GameplayTask_Mount_OnMasterCharacterMovementUpdated) == 0x00001C, "Wrong size on GameplayTask_Mount_OnMasterCharacterMovementUpdated");
static_assert(offsetof(GameplayTask_Mount_OnMasterCharacterMovementUpdated, DeltaSeconds) == 0x000000, "Member 'GameplayTask_Mount_OnMasterCharacterMovementUpdated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GameplayTask_Mount_OnMasterCharacterMovementUpdated, OldLocation) == 0x000004, "Member 'GameplayTask_Mount_OnMasterCharacterMovementUpdated::OldLocation' has a wrong offset!");
static_assert(offsetof(GameplayTask_Mount_OnMasterCharacterMovementUpdated, OldVelocity) == 0x000010, "Member 'GameplayTask_Mount_OnMasterCharacterMovementUpdated::OldVelocity' has a wrong offset!");

// Function TLScene.ImageAttachmentComponent.AttachImage
// 0x0010 (0x0010 - 0x0000)
struct ImageAttachmentComponent_AttachImage final
{
public:
	class FString                                 ImagePath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ImageAttachmentComponent_AttachImage) == 0x000008, "Wrong alignment on ImageAttachmentComponent_AttachImage");
static_assert(sizeof(ImageAttachmentComponent_AttachImage) == 0x000010, "Wrong size on ImageAttachmentComponent_AttachImage");
static_assert(offsetof(ImageAttachmentComponent_AttachImage, ImagePath) == 0x000000, "Member 'ImageAttachmentComponent_AttachImage::ImagePath' has a wrong offset!");

// Function TLScene.MapActorManager.OnActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct MapActorManager_OnActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MapActorManager_OnActorDestroyed) == 0x000008, "Wrong alignment on MapActorManager_OnActorDestroyed");
static_assert(sizeof(MapActorManager_OnActorDestroyed) == 0x000008, "Wrong size on MapActorManager_OnActorDestroyed");
static_assert(offsetof(MapActorManager_OnActorDestroyed, DestroyedActor) == 0x000000, "Member 'MapActorManager_OnActorDestroyed::DestroyedActor' has a wrong offset!");

// Function TLScene.MapMiniActor.OnParticleEvent
// 0x0024 (0x0024 - 0x0000)
struct MapMiniActor_OnParticleEvent final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MapMiniActor_OnParticleEvent) == 0x000004, "Wrong alignment on MapMiniActor_OnParticleEvent");
static_assert(sizeof(MapMiniActor_OnParticleEvent) == 0x000024, "Wrong size on MapMiniActor_OnParticleEvent");
static_assert(offsetof(MapMiniActor_OnParticleEvent, EventName) == 0x000000, "Member 'MapMiniActor_OnParticleEvent::EventName' has a wrong offset!");
static_assert(offsetof(MapMiniActor_OnParticleEvent, EmitterTime) == 0x000008, "Member 'MapMiniActor_OnParticleEvent::EmitterTime' has a wrong offset!");
static_assert(offsetof(MapMiniActor_OnParticleEvent, Location) == 0x00000C, "Member 'MapMiniActor_OnParticleEvent::Location' has a wrong offset!");
static_assert(offsetof(MapMiniActor_OnParticleEvent, Velocity) == 0x000018, "Member 'MapMiniActor_OnParticleEvent::Velocity' has a wrong offset!");

// Function TLScene.MapRoomActor.OnBeginOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct MapRoomActor_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(MapRoomActor_OnBeginOverlap) == 0x000008, "Wrong alignment on MapRoomActor_OnBeginOverlap");
static_assert(sizeof(MapRoomActor_OnBeginOverlap) == 0x0000A8, "Wrong size on MapRoomActor_OnBeginOverlap");
static_assert(offsetof(MapRoomActor_OnBeginOverlap, OverlappedComp) == 0x000000, "Member 'MapRoomActor_OnBeginOverlap::OverlappedComp' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnBeginOverlap, OtherActor) == 0x000008, "Member 'MapRoomActor_OnBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnBeginOverlap, OtherComp) == 0x000010, "Member 'MapRoomActor_OnBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'MapRoomActor_OnBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnBeginOverlap, bFromSweep) == 0x00001C, "Member 'MapRoomActor_OnBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnBeginOverlap, SweepResult) == 0x000020, "Member 'MapRoomActor_OnBeginOverlap::SweepResult' has a wrong offset!");

// Function TLScene.MapRoomActor.OnEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct MapRoomActor_OnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MapRoomActor_OnEndOverlap) == 0x000008, "Wrong alignment on MapRoomActor_OnEndOverlap");
static_assert(sizeof(MapRoomActor_OnEndOverlap) == 0x000020, "Wrong size on MapRoomActor_OnEndOverlap");
static_assert(offsetof(MapRoomActor_OnEndOverlap, OverlappedComp) == 0x000000, "Member 'MapRoomActor_OnEndOverlap::OverlappedComp' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnEndOverlap, OtherActor) == 0x000008, "Member 'MapRoomActor_OnEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnEndOverlap, OtherComp) == 0x000010, "Member 'MapRoomActor_OnEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(MapRoomActor_OnEndOverlap, OtherBodyIndex) == 0x000018, "Member 'MapRoomActor_OnEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function TLScene.TLCharacterAnimInstance.GetFacialAnimComponent
// 0x0008 (0x0008 - 0x0000)
struct TLCharacterAnimInstance_GetFacialAnimComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLCharacterAnimInstance_GetFacialAnimComponent) == 0x000008, "Wrong alignment on TLCharacterAnimInstance_GetFacialAnimComponent");
static_assert(sizeof(TLCharacterAnimInstance_GetFacialAnimComponent) == 0x000008, "Wrong size on TLCharacterAnimInstance_GetFacialAnimComponent");
static_assert(offsetof(TLCharacterAnimInstance_GetFacialAnimComponent, ReturnValue) == 0x000000, "Member 'TLCharacterAnimInstance_GetFacialAnimComponent::ReturnValue' has a wrong offset!");

// Function TLScene.TLCharacterSubAnimInstance.TLAnim_GetInverseSpeedBasedRate
// 0x0008 (0x0008 - 0x0000)
struct TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate final
{
public:
	float                                         InSeqBaseSpeed;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate) == 0x000004, "Wrong alignment on TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate");
static_assert(sizeof(TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate) == 0x000008, "Wrong size on TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate");
static_assert(offsetof(TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate, InSeqBaseSpeed) == 0x000000, "Member 'TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate::InSeqBaseSpeed' has a wrong offset!");
static_assert(offsetof(TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate, ReturnValue) == 0x000004, "Member 'TLCharacterSubAnimInstance_TLAnim_GetInverseSpeedBasedRate::ReturnValue' has a wrong offset!");

// Function TLScene.UnrealCableComponent.SetAttachEndTo
// 0x0018 (0x0018 - 0x0000)
struct UnrealCableComponent_SetAttachEndTo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ComponentProperty;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCableComponent_SetAttachEndTo) == 0x000008, "Wrong alignment on UnrealCableComponent_SetAttachEndTo");
static_assert(sizeof(UnrealCableComponent_SetAttachEndTo) == 0x000018, "Wrong size on UnrealCableComponent_SetAttachEndTo");
static_assert(offsetof(UnrealCableComponent_SetAttachEndTo, Actor) == 0x000000, "Member 'UnrealCableComponent_SetAttachEndTo::Actor' has a wrong offset!");
static_assert(offsetof(UnrealCableComponent_SetAttachEndTo, ComponentProperty) == 0x000008, "Member 'UnrealCableComponent_SetAttachEndTo::ComponentProperty' has a wrong offset!");
static_assert(offsetof(UnrealCableComponent_SetAttachEndTo, SocketName) == 0x000010, "Member 'UnrealCableComponent_SetAttachEndTo::SocketName' has a wrong offset!");

// Function TLScene.UnrealCableComponent.SetAttachEndToComponent
// 0x0010 (0x0010 - 0x0000)
struct UnrealCableComponent_SetAttachEndToComponent final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCableComponent_SetAttachEndToComponent) == 0x000008, "Wrong alignment on UnrealCableComponent_SetAttachEndToComponent");
static_assert(sizeof(UnrealCableComponent_SetAttachEndToComponent) == 0x000010, "Wrong size on UnrealCableComponent_SetAttachEndToComponent");
static_assert(offsetof(UnrealCableComponent_SetAttachEndToComponent, Component) == 0x000000, "Member 'UnrealCableComponent_SetAttachEndToComponent::Component' has a wrong offset!");
static_assert(offsetof(UnrealCableComponent_SetAttachEndToComponent, SocketName) == 0x000008, "Member 'UnrealCableComponent_SetAttachEndToComponent::SocketName' has a wrong offset!");

// Function TLScene.UnrealCableComponent.GetAttachedActor
// 0x0008 (0x0008 - 0x0000)
struct UnrealCableComponent_GetAttachedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCableComponent_GetAttachedActor) == 0x000008, "Wrong alignment on UnrealCableComponent_GetAttachedActor");
static_assert(sizeof(UnrealCableComponent_GetAttachedActor) == 0x000008, "Wrong size on UnrealCableComponent_GetAttachedActor");
static_assert(offsetof(UnrealCableComponent_GetAttachedActor, ReturnValue) == 0x000000, "Member 'UnrealCableComponent_GetAttachedActor::ReturnValue' has a wrong offset!");

// Function TLScene.UnrealCableComponent.GetAttachedComponent
// 0x0008 (0x0008 - 0x0000)
struct UnrealCableComponent_GetAttachedComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCableComponent_GetAttachedComponent) == 0x000008, "Wrong alignment on UnrealCableComponent_GetAttachedComponent");
static_assert(sizeof(UnrealCableComponent_GetAttachedComponent) == 0x000008, "Wrong size on UnrealCableComponent_GetAttachedComponent");
static_assert(offsetof(UnrealCableComponent_GetAttachedComponent, ReturnValue) == 0x000000, "Member 'UnrealCableComponent_GetAttachedComponent::ReturnValue' has a wrong offset!");

// Function TLScene.UnrealCableComponent.GetCableParticleLocations
// 0x0010 (0x0010 - 0x0000)
struct UnrealCableComponent_GetCableParticleLocations final
{
public:
	TArray<struct FVector>                        Locations;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnrealCableComponent_GetCableParticleLocations) == 0x000008, "Wrong alignment on UnrealCableComponent_GetCableParticleLocations");
static_assert(sizeof(UnrealCableComponent_GetCableParticleLocations) == 0x000010, "Wrong size on UnrealCableComponent_GetCableParticleLocations");
static_assert(offsetof(UnrealCableComponent_GetCableParticleLocations, Locations) == 0x000000, "Member 'UnrealCableComponent_GetCableParticleLocations::Locations' has a wrong offset!");

// Function TLScene.TLForceFeedbackLibrary.GetWorldByContext
// 0x0010 (0x0010 - 0x0000)
struct TLForceFeedbackLibrary_GetWorldByContext final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLForceFeedbackLibrary_GetWorldByContext) == 0x000008, "Wrong alignment on TLForceFeedbackLibrary_GetWorldByContext");
static_assert(sizeof(TLForceFeedbackLibrary_GetWorldByContext) == 0x000010, "Wrong size on TLForceFeedbackLibrary_GetWorldByContext");
static_assert(offsetof(TLForceFeedbackLibrary_GetWorldByContext, InWorldContextObject) == 0x000000, "Member 'TLForceFeedbackLibrary_GetWorldByContext::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(TLForceFeedbackLibrary_GetWorldByContext, ReturnValue) == 0x000008, "Member 'TLForceFeedbackLibrary_GetWorldByContext::ReturnValue' has a wrong offset!");

// Function TLScene.TLForceFeedbackLibrary.PlayForceFeedback
// 0x0020 (0x0020 - 0x0000)
struct TLForceFeedbackLibrary_PlayForceFeedback final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UForceFeedbackEffect*                   ForceFeedbackEffect;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTimeDilation;                               // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayWhilePaused;                                  // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLForceFeedbackLibrary_PlayForceFeedback) == 0x000008, "Wrong alignment on TLForceFeedbackLibrary_PlayForceFeedback");
static_assert(sizeof(TLForceFeedbackLibrary_PlayForceFeedback) == 0x000020, "Wrong size on TLForceFeedbackLibrary_PlayForceFeedback");
static_assert(offsetof(TLForceFeedbackLibrary_PlayForceFeedback, InWorldContextObject) == 0x000000, "Member 'TLForceFeedbackLibrary_PlayForceFeedback::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(TLForceFeedbackLibrary_PlayForceFeedback, ForceFeedbackEffect) == 0x000008, "Member 'TLForceFeedbackLibrary_PlayForceFeedback::ForceFeedbackEffect' has a wrong offset!");
static_assert(offsetof(TLForceFeedbackLibrary_PlayForceFeedback, Tag) == 0x000010, "Member 'TLForceFeedbackLibrary_PlayForceFeedback::Tag' has a wrong offset!");
static_assert(offsetof(TLForceFeedbackLibrary_PlayForceFeedback, bLooping) == 0x000018, "Member 'TLForceFeedbackLibrary_PlayForceFeedback::bLooping' has a wrong offset!");
static_assert(offsetof(TLForceFeedbackLibrary_PlayForceFeedback, bIgnoreTimeDilation) == 0x000019, "Member 'TLForceFeedbackLibrary_PlayForceFeedback::bIgnoreTimeDilation' has a wrong offset!");
static_assert(offsetof(TLForceFeedbackLibrary_PlayForceFeedback, bPlayWhilePaused) == 0x00001A, "Member 'TLForceFeedbackLibrary_PlayForceFeedback::bPlayWhilePaused' has a wrong offset!");

// Function TLScene.TLForceFeedbackLibrary.StopForceFeedback
// 0x0010 (0x0010 - 0x0000)
struct TLForceFeedbackLibrary_StopForceFeedback final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UForceFeedbackEffect*                   ForceFeedbackEffect;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLForceFeedbackLibrary_StopForceFeedback) == 0x000008, "Wrong alignment on TLForceFeedbackLibrary_StopForceFeedback");
static_assert(sizeof(TLForceFeedbackLibrary_StopForceFeedback) == 0x000010, "Wrong size on TLForceFeedbackLibrary_StopForceFeedback");
static_assert(offsetof(TLForceFeedbackLibrary_StopForceFeedback, InWorldContextObject) == 0x000000, "Member 'TLForceFeedbackLibrary_StopForceFeedback::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(TLForceFeedbackLibrary_StopForceFeedback, ForceFeedbackEffect) == 0x000008, "Member 'TLForceFeedbackLibrary_StopForceFeedback::ForceFeedbackEffect' has a wrong offset!");

// Function TLScene.TLForceFeedbackLibrary.StopForceFeedbackAll
// 0x0008 (0x0008 - 0x0000)
struct TLForceFeedbackLibrary_StopForceFeedbackAll final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLForceFeedbackLibrary_StopForceFeedbackAll) == 0x000008, "Wrong alignment on TLForceFeedbackLibrary_StopForceFeedbackAll");
static_assert(sizeof(TLForceFeedbackLibrary_StopForceFeedbackAll) == 0x000008, "Wrong size on TLForceFeedbackLibrary_StopForceFeedbackAll");
static_assert(offsetof(TLForceFeedbackLibrary_StopForceFeedbackAll, InWorldContextObject) == 0x000000, "Member 'TLForceFeedbackLibrary_StopForceFeedbackAll::InWorldContextObject' has a wrong offset!");

// Function TLScene.TLAnimationStatics.GetSkeletonBoneNames
// 0x0018 (0x0018 - 0x0000)
struct TLAnimationStatics_GetSkeletonBoneNames final
{
public:
	class USkeleton*                              InSkeleton;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLAnimationStatics_GetSkeletonBoneNames) == 0x000008, "Wrong alignment on TLAnimationStatics_GetSkeletonBoneNames");
static_assert(sizeof(TLAnimationStatics_GetSkeletonBoneNames) == 0x000018, "Wrong size on TLAnimationStatics_GetSkeletonBoneNames");
static_assert(offsetof(TLAnimationStatics_GetSkeletonBoneNames, InSkeleton) == 0x000000, "Member 'TLAnimationStatics_GetSkeletonBoneNames::InSkeleton' has a wrong offset!");
static_assert(offsetof(TLAnimationStatics_GetSkeletonBoneNames, ReturnValue) == 0x000008, "Member 'TLAnimationStatics_GetSkeletonBoneNames::ReturnValue' has a wrong offset!");

// Function TLScene.TLAnimationStatics.SkeletalMeshAssiginNewSkeleton
// 0x0018 (0x0018 - 0x0000)
struct TLAnimationStatics_SkeletalMeshAssiginNewSkeleton final
{
public:
	class USkeletalMesh*                          InSkeletalMesh;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeleton*                              InSkeleton;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLAnimationStatics_SkeletalMeshAssiginNewSkeleton) == 0x000008, "Wrong alignment on TLAnimationStatics_SkeletalMeshAssiginNewSkeleton");
static_assert(sizeof(TLAnimationStatics_SkeletalMeshAssiginNewSkeleton) == 0x000018, "Wrong size on TLAnimationStatics_SkeletalMeshAssiginNewSkeleton");
static_assert(offsetof(TLAnimationStatics_SkeletalMeshAssiginNewSkeleton, InSkeletalMesh) == 0x000000, "Member 'TLAnimationStatics_SkeletalMeshAssiginNewSkeleton::InSkeletalMesh' has a wrong offset!");
static_assert(offsetof(TLAnimationStatics_SkeletalMeshAssiginNewSkeleton, InSkeleton) == 0x000008, "Member 'TLAnimationStatics_SkeletalMeshAssiginNewSkeleton::InSkeleton' has a wrong offset!");
static_assert(offsetof(TLAnimationStatics_SkeletalMeshAssiginNewSkeleton, ReturnValue) == 0x000010, "Member 'TLAnimationStatics_SkeletalMeshAssiginNewSkeleton::ReturnValue' has a wrong offset!");

// Function TLScene.TLAssetStatics.DuplicateAsset
// 0x0030 (0x0030 - 0x0000)
struct TLAssetStatics_DuplicateAsset final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackagePath;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OriginalObject;                                    // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLAssetStatics_DuplicateAsset) == 0x000008, "Wrong alignment on TLAssetStatics_DuplicateAsset");
static_assert(sizeof(TLAssetStatics_DuplicateAsset) == 0x000030, "Wrong size on TLAssetStatics_DuplicateAsset");
static_assert(offsetof(TLAssetStatics_DuplicateAsset, AssetName) == 0x000000, "Member 'TLAssetStatics_DuplicateAsset::AssetName' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_DuplicateAsset, PackagePath) == 0x000010, "Member 'TLAssetStatics_DuplicateAsset::PackagePath' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_DuplicateAsset, OriginalObject) == 0x000020, "Member 'TLAssetStatics_DuplicateAsset::OriginalObject' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_DuplicateAsset, ReturnValue) == 0x000028, "Member 'TLAssetStatics_DuplicateAsset::ReturnValue' has a wrong offset!");

// Function TLScene.TLAssetStatics.DuplicateAssetWithDialog
// 0x0030 (0x0030 - 0x0000)
struct TLAssetStatics_DuplicateAssetWithDialog final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackagePath;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OriginalObject;                                    // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLAssetStatics_DuplicateAssetWithDialog) == 0x000008, "Wrong alignment on TLAssetStatics_DuplicateAssetWithDialog");
static_assert(sizeof(TLAssetStatics_DuplicateAssetWithDialog) == 0x000030, "Wrong size on TLAssetStatics_DuplicateAssetWithDialog");
static_assert(offsetof(TLAssetStatics_DuplicateAssetWithDialog, AssetName) == 0x000000, "Member 'TLAssetStatics_DuplicateAssetWithDialog::AssetName' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_DuplicateAssetWithDialog, PackagePath) == 0x000010, "Member 'TLAssetStatics_DuplicateAssetWithDialog::PackagePath' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_DuplicateAssetWithDialog, OriginalObject) == 0x000020, "Member 'TLAssetStatics_DuplicateAssetWithDialog::OriginalObject' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_DuplicateAssetWithDialog, ReturnValue) == 0x000028, "Member 'TLAssetStatics_DuplicateAssetWithDialog::ReturnValue' has a wrong offset!");

// Function TLScene.TLAssetStatics.FindSoftReferencesToObject
// 0x0028 (0x0028 - 0x0000)
struct TLAssetStatics_FindSoftReferencesToObject final
{
public:
	struct FSoftObjectPath                        TargetObject;                                      // 0x0000(0x0018)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReferencingObjects;                                // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLAssetStatics_FindSoftReferencesToObject) == 0x000008, "Wrong alignment on TLAssetStatics_FindSoftReferencesToObject");
static_assert(sizeof(TLAssetStatics_FindSoftReferencesToObject) == 0x000028, "Wrong size on TLAssetStatics_FindSoftReferencesToObject");
static_assert(offsetof(TLAssetStatics_FindSoftReferencesToObject, TargetObject) == 0x000000, "Member 'TLAssetStatics_FindSoftReferencesToObject::TargetObject' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_FindSoftReferencesToObject, ReferencingObjects) == 0x000018, "Member 'TLAssetStatics_FindSoftReferencesToObject::ReferencingObjects' has a wrong offset!");

// Function TLScene.TLAssetStatics.RenameAssetIfEditorBuild
// 0x0030 (0x0030 - 0x0000)
struct TLAssetStatics_RenameAssetIfEditorBuild final
{
public:
	class UObject*                                InAsset;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InNewPackagePath;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InNewName;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLAssetStatics_RenameAssetIfEditorBuild) == 0x000008, "Wrong alignment on TLAssetStatics_RenameAssetIfEditorBuild");
static_assert(sizeof(TLAssetStatics_RenameAssetIfEditorBuild) == 0x000030, "Wrong size on TLAssetStatics_RenameAssetIfEditorBuild");
static_assert(offsetof(TLAssetStatics_RenameAssetIfEditorBuild, InAsset) == 0x000000, "Member 'TLAssetStatics_RenameAssetIfEditorBuild::InAsset' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_RenameAssetIfEditorBuild, InNewPackagePath) == 0x000008, "Member 'TLAssetStatics_RenameAssetIfEditorBuild::InNewPackagePath' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_RenameAssetIfEditorBuild, InNewName) == 0x000018, "Member 'TLAssetStatics_RenameAssetIfEditorBuild::InNewName' has a wrong offset!");
static_assert(offsetof(TLAssetStatics_RenameAssetIfEditorBuild, ReturnValue) == 0x000028, "Member 'TLAssetStatics_RenameAssetIfEditorBuild::ReturnValue' has a wrong offset!");

// Function TLScene.TLMapBlueprintFunctionLibrary.BuildHierarchicalInstancedStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh final
{
public:
	class UHierarchicalInstancedStaticMeshComponent* Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Async;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Force;                                             // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh) == 0x000008, "Wrong alignment on TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh");
static_assert(sizeof(TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh) == 0x000010, "Wrong size on TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh");
static_assert(offsetof(TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh, Component) == 0x000000, "Member 'TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh::Component' has a wrong offset!");
static_assert(offsetof(TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh, Async) == 0x000008, "Member 'TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh::Async' has a wrong offset!");
static_assert(offsetof(TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh, Force) == 0x000009, "Member 'TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh::Force' has a wrong offset!");
static_assert(offsetof(TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh, ReturnValue) == 0x00000A, "Member 'TLMapBlueprintFunctionLibrary_BuildHierarchicalInstancedStaticMesh::ReturnValue' has a wrong offset!");

// Function TLScene.TLMapBlueprintFunctionLibrary.UpdatePrimitiveBounds
// 0x0008 (0x0008 - 0x0000)
struct TLMapBlueprintFunctionLibrary_UpdatePrimitiveBounds final
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLMapBlueprintFunctionLibrary_UpdatePrimitiveBounds) == 0x000008, "Wrong alignment on TLMapBlueprintFunctionLibrary_UpdatePrimitiveBounds");
static_assert(sizeof(TLMapBlueprintFunctionLibrary_UpdatePrimitiveBounds) == 0x000008, "Wrong size on TLMapBlueprintFunctionLibrary_UpdatePrimitiveBounds");
static_assert(offsetof(TLMapBlueprintFunctionLibrary_UpdatePrimitiveBounds, PrimitiveComponent) == 0x000000, "Member 'TLMapBlueprintFunctionLibrary_UpdatePrimitiveBounds::PrimitiveComponent' has a wrong offset!");

// Function TLScene.TLLandscapeSamplerComponent.CalculateNormalsFromHeightfield
// 0x0028 (0x0028 - 0x0000)
struct TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield final
{
public:
	TArray<float>                                 HeightField;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         NumWidth;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumHeight;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield) == 0x000008, "Wrong alignment on TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield");
static_assert(sizeof(TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield) == 0x000028, "Wrong size on TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield");
static_assert(offsetof(TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield, HeightField) == 0x000000, "Member 'TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield::HeightField' has a wrong offset!");
static_assert(offsetof(TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield, NumWidth) == 0x000010, "Member 'TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield::NumWidth' has a wrong offset!");
static_assert(offsetof(TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield, NumHeight) == 0x000014, "Member 'TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield::NumHeight' has a wrong offset!");
static_assert(offsetof(TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield, ReturnValue) == 0x000018, "Member 'TLLandscapeSamplerComponent_CalculateNormalsFromHeightfield::ReturnValue' has a wrong offset!");

// Function TLScene.TLLandscapeSamplerComponent.FindMajorSlopeNormal
// 0x0020 (0x0020 - 0x0000)
struct TLLandscapeSamplerComponent_FindMajorSlopeNormal final
{
public:
	TArray<struct FVector>                        Normals;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLLandscapeSamplerComponent_FindMajorSlopeNormal) == 0x000008, "Wrong alignment on TLLandscapeSamplerComponent_FindMajorSlopeNormal");
static_assert(sizeof(TLLandscapeSamplerComponent_FindMajorSlopeNormal) == 0x000020, "Wrong size on TLLandscapeSamplerComponent_FindMajorSlopeNormal");
static_assert(offsetof(TLLandscapeSamplerComponent_FindMajorSlopeNormal, Normals) == 0x000000, "Member 'TLLandscapeSamplerComponent_FindMajorSlopeNormal::Normals' has a wrong offset!");
static_assert(offsetof(TLLandscapeSamplerComponent_FindMajorSlopeNormal, ReturnValue) == 0x000010, "Member 'TLLandscapeSamplerComponent_FindMajorSlopeNormal::ReturnValue' has a wrong offset!");

// Function TLScene.TLLandscapeSamplerComponent.GetLandscapeHeights
// 0x0020 (0x0020 - 0x0000)
struct TLLandscapeSamplerComponent_GetLandscapeHeights final
{
public:
	struct FVector2D                              Extent;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumWidth;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumHeight;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLLandscapeSamplerComponent_GetLandscapeHeights) == 0x000008, "Wrong alignment on TLLandscapeSamplerComponent_GetLandscapeHeights");
static_assert(sizeof(TLLandscapeSamplerComponent_GetLandscapeHeights) == 0x000020, "Wrong size on TLLandscapeSamplerComponent_GetLandscapeHeights");
static_assert(offsetof(TLLandscapeSamplerComponent_GetLandscapeHeights, Extent) == 0x000000, "Member 'TLLandscapeSamplerComponent_GetLandscapeHeights::Extent' has a wrong offset!");
static_assert(offsetof(TLLandscapeSamplerComponent_GetLandscapeHeights, NumWidth) == 0x000008, "Member 'TLLandscapeSamplerComponent_GetLandscapeHeights::NumWidth' has a wrong offset!");
static_assert(offsetof(TLLandscapeSamplerComponent_GetLandscapeHeights, NumHeight) == 0x00000C, "Member 'TLLandscapeSamplerComponent_GetLandscapeHeights::NumHeight' has a wrong offset!");
static_assert(offsetof(TLLandscapeSamplerComponent_GetLandscapeHeights, ReturnValue) == 0x000010, "Member 'TLLandscapeSamplerComponent_GetLandscapeHeights::ReturnValue' has a wrong offset!");

// Function TLScene.TLMapRoomStatics.GetMapRoomActorAllComponents
// 0x0018 (0x0018 - 0x0000)
struct TLMapRoomStatics_GetMapRoomActorAllComponents final
{
public:
	class AMapRoomActor*                          InMapRoomActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                OutSceneComponents;                                // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLMapRoomStatics_GetMapRoomActorAllComponents) == 0x000008, "Wrong alignment on TLMapRoomStatics_GetMapRoomActorAllComponents");
static_assert(sizeof(TLMapRoomStatics_GetMapRoomActorAllComponents) == 0x000018, "Wrong size on TLMapRoomStatics_GetMapRoomActorAllComponents");
static_assert(offsetof(TLMapRoomStatics_GetMapRoomActorAllComponents, InMapRoomActor) == 0x000000, "Member 'TLMapRoomStatics_GetMapRoomActorAllComponents::InMapRoomActor' has a wrong offset!");
static_assert(offsetof(TLMapRoomStatics_GetMapRoomActorAllComponents, OutSceneComponents) == 0x000008, "Member 'TLMapRoomStatics_GetMapRoomActorAllComponents::OutSceneComponents' has a wrong offset!");

// Function TLScene.TLMapRoomStatics.GetMapRoomAllComponents
// 0x0018 (0x0018 - 0x0000)
struct TLMapRoomStatics_GetMapRoomAllComponents final
{
public:
