#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TLUI

#include "Basic.hpp"

#include "TLScheme_structs.hpp"
#include "TLUI_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Auton_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"
#include "WebBrowserWidget_classes.hpp"
#include "RadarChart_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class TLUI.TLCanvasPanel
// 0x0198 (0x02D0 - 0x0138)
class UTLCanvasPanel : public UCanvasPanel
{
public:
	uint8                                         Pad_138[0x80];                                     // 0x0138(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLVisibility                          TLVisibility;                                      // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTooltipPositionData                   TooltipPositionData;                               // 0x01BC(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTLWidgetFocusableData                 TLFocusableData;                                   // 0x01C8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bUseExplicitChildZOrder;                           // 0x01E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E1[0x17];                                     // 0x01E1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLWidgetBindingVisible                VisibleBinding;                                    // 0x01F8(0x0040)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTLWidgetBindingEnabled                EnabledBinding;                                    // 0x0238(0x0040)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ETLAutonAreaType                              MyAutonAreaType;                                   // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AutonAreaGroupIdValue;                             // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AutonAreaOrderTagValue;                            // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFence;                                    // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDome;                                     // 0x0285(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFarPrevFirstBeforeLeaveFlag;              // 0x0286(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoRecentAreaWhenLeaveFlag;                // 0x0287(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoBackAreaWhenLeaveFlag;                  // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoAreaByOrderTagHintWhenLeaveFlag;        // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonOrderTagHint                          AutonAreaLeaveOrderTagHintValue;                   // 0x028A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28B[0x1];                                      // 0x028B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AutonAreaLeaveGivenOrderTagValue;                  // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaOrderFirstThenCardinalEnterFlag;          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaOrderFirstWhenFarCardinalEnterFlag;       // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaTakeRecentIfExistWhenCardinalEnterFlag;   // 0x0292(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonChildNavigationHint                   AutonAreaChildNavigatingHint;                      // 0x0293(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFarNavigationWhenShortCardinalFailedFlag; // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds; // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AutonAreaCardinalNavigationWeightValue;            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDontUseHitOnRoad;                         // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDontUseNearest;                           // 0x02AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaHaveNosyNeighborsFlag;                    // 0x02AE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaCouldBeLookingAreaFlag;                   // 0x02AF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                AutonAreaLookingFeedbackWidget;                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class ITLWidgetVisibilityInterface> AutonAreaFocusPresenter;                           // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          ChildDisableHitTestAll;                            // 0x02C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleUpdateEnabled();
	void HandleUpdateVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLCanvasPanel">();
	}
	static class UTLCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLCanvasPanel>();
	}
};
static_assert(alignof(UTLCanvasPanel) == 0x000008, "Wrong alignment on UTLCanvasPanel");
static_assert(sizeof(UTLCanvasPanel) == 0x0002D0, "Wrong size on UTLCanvasPanel");
static_assert(offsetof(UTLCanvasPanel, TLVisibility) == 0x0001B8, "Member 'UTLCanvasPanel::TLVisibility' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, TooltipPositionData) == 0x0001BC, "Member 'UTLCanvasPanel::TooltipPositionData' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, TLFocusableData) == 0x0001C8, "Member 'UTLCanvasPanel::TLFocusableData' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, bUseExplicitChildZOrder) == 0x0001E0, "Member 'UTLCanvasPanel::bUseExplicitChildZOrder' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, VisibleBinding) == 0x0001F8, "Member 'UTLCanvasPanel::VisibleBinding' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, EnabledBinding) == 0x000238, "Member 'UTLCanvasPanel::EnabledBinding' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, MyAutonAreaType) == 0x000278, "Member 'UTLCanvasPanel::MyAutonAreaType' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaGroupIdValue) == 0x00027C, "Member 'UTLCanvasPanel::AutonAreaGroupIdValue' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaOrderTagValue) == 0x000280, "Member 'UTLCanvasPanel::AutonAreaOrderTagValue' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaFence) == 0x000284, "Member 'UTLCanvasPanel::AutonAreaFence' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaDome) == 0x000285, "Member 'UTLCanvasPanel::AutonAreaDome' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaFarPrevFirstBeforeLeaveFlag) == 0x000286, "Member 'UTLCanvasPanel::AutonAreaFarPrevFirstBeforeLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaGoRecentAreaWhenLeaveFlag) == 0x000287, "Member 'UTLCanvasPanel::AutonAreaGoRecentAreaWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaGoBackAreaWhenLeaveFlag) == 0x000288, "Member 'UTLCanvasPanel::AutonAreaGoBackAreaWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaGoAreaByOrderTagHintWhenLeaveFlag) == 0x000289, "Member 'UTLCanvasPanel::AutonAreaGoAreaByOrderTagHintWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaLeaveOrderTagHintValue) == 0x00028A, "Member 'UTLCanvasPanel::AutonAreaLeaveOrderTagHintValue' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaLeaveGivenOrderTagValue) == 0x00028C, "Member 'UTLCanvasPanel::AutonAreaLeaveGivenOrderTagValue' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaOrderFirstThenCardinalEnterFlag) == 0x000290, "Member 'UTLCanvasPanel::AutonAreaOrderFirstThenCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaOrderFirstWhenFarCardinalEnterFlag) == 0x000291, "Member 'UTLCanvasPanel::AutonAreaOrderFirstWhenFarCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaTakeRecentIfExistWhenCardinalEnterFlag) == 0x000292, "Member 'UTLCanvasPanel::AutonAreaTakeRecentIfExistWhenCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaChildNavigatingHint) == 0x000293, "Member 'UTLCanvasPanel::AutonAreaChildNavigatingHint' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaFarNavigationWhenShortCardinalFailedFlag) == 0x000294, "Member 'UTLCanvasPanel::AutonAreaFarNavigationWhenShortCardinalFailedFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds) == 0x000298, "Member 'UTLCanvasPanel::AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaCardinalNavigationWeightValue) == 0x0002A8, "Member 'UTLCanvasPanel::AutonAreaCardinalNavigationWeightValue' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaDontUseHitOnRoad) == 0x0002AC, "Member 'UTLCanvasPanel::AutonAreaDontUseHitOnRoad' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaDontUseNearest) == 0x0002AD, "Member 'UTLCanvasPanel::AutonAreaDontUseNearest' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaHaveNosyNeighborsFlag) == 0x0002AE, "Member 'UTLCanvasPanel::AutonAreaHaveNosyNeighborsFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaCouldBeLookingAreaFlag) == 0x0002AF, "Member 'UTLCanvasPanel::AutonAreaCouldBeLookingAreaFlag' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaLookingFeedbackWidget) == 0x0002B0, "Member 'UTLCanvasPanel::AutonAreaLookingFeedbackWidget' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, AutonAreaFocusPresenter) == 0x0002B8, "Member 'UTLCanvasPanel::AutonAreaFocusPresenter' has a wrong offset!");
static_assert(offsetof(UTLCanvasPanel, ChildDisableHitTestAll) == 0x0002C8, "Member 'UTLCanvasPanel::ChildDisableHitTestAll' has a wrong offset!");

// Class TLUI.TLListView
// 0x0DF8 (0x1168 - 0x0370)
class UTLListView : public UListView
{
public:
	uint8                                         Pad_370[0x88];                                     // 0x0370(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLVisibility                          TLVisibility;                                      // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTooltipPositionData                   TooltipPositionData;                               // 0x03FC(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTLWidgetFocusableData                 TLFocusableData;                                   // 0x0408(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLWidgetBindingVisible                VisibleBinding;                                    // 0x0430(0x0040)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTLWidgetBindingEnabled                EnabledBinding;                                    // 0x0470(0x0040)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTLWidgetBindingListChanged            ListChangedBinding;                                // 0x04B0(0x0040)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ETLAutonAreaType                              MyAutonAreaType;                                   // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AutonAreaGroupIdValue;                             // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AutonAreaOrderTagValue;                            // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFence;                                    // 0x04FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDome;                                     // 0x04FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFarPrevFirstBeforeLeaveFlag;              // 0x04FE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoRecentAreaWhenLeaveFlag;                // 0x04FF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoBackAreaWhenLeaveFlag;                  // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoAreaByOrderTagHintWhenLeaveFlag;        // 0x0501(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonOrderTagHint                          AutonAreaLeaveOrderTagHintValue;                   // 0x0502(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_503[0x1];                                      // 0x0503(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AutonAreaLeaveGivenOrderTagValue;                  // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaOrderFirstThenCardinalEnterFlag;          // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaOrderFirstWhenFarCardinalEnterFlag;       // 0x0509(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaTakeRecentIfExistWhenCardinalEnterFlag;   // 0x050A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonChildNavigationHint                   AutonAreaChildNavigatingHint;                      // 0x050B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFarNavigationWhenShortCardinalFailedFlag; // 0x050C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50D[0x3];                                      // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds; // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AutonAreaCardinalNavigationWeightValue;            // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDontUseHitOnRoad;                         // 0x0524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDontUseNearest;                           // 0x0525(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaHaveNosyNeighborsFlag;                    // 0x0526(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaCouldBeLookingAreaFlag;                   // 0x0527(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                AutonAreaLookingFeedbackWidget;                    // 0x0528(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class ITLWidgetVisibilityInterface> AutonAreaFocusPresenter;                           // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          AutonScrollSensitiveFlag;                          // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonScrollDestination                     AutonScrollDestionationFlag;                       // 0x0541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonLoopNavigationHint                    AutonScrollLoopNavigatingHint;                     // 0x0542(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonScrollUseFastScrolling;                       // 0x0543(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonScrollNavigationClearWhenStartFastScrollingFlag; // 0x0544(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0548(0x05E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bCustomScrollBarStyle;                             // 0x0B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        ScrollBarStyleConsole;                             // 0x0B30(0x05E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bCustomScrollBarStyleConsole;                      // 0x1110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysShowScrollbar;                              // 0x1111(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1112[0x2];                                     // 0x1112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScrollbarThickness;                                // 0x1114(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                ScrollbarPadding;                                  // 0x111C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ScrollbarTrackPadding;                             // 0x112C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ScrollbarPaddingConsole;                           // 0x113C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ScrollbarThicknessConsole;                         // 0x114C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                ScrollbarTrackPaddingConsole;                      // 0x1154(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EDragScrollingType                            DragScrollingType;                                 // 0x1164(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1165[0x3];                                     // 0x1165(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddItemAt(class UObject* Item, int32 Index_0);
	void HandleUpdateEnabled();
	void HandleUpdateListChanged();
	void HandleUpdateVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLListView">();
	}
	static class UTLListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLListView>();
	}
};
static_assert(alignof(UTLListView) == 0x000008, "Wrong alignment on UTLListView");
static_assert(sizeof(UTLListView) == 0x001168, "Wrong size on UTLListView");
static_assert(offsetof(UTLListView, TLVisibility) == 0x0003F8, "Member 'UTLListView::TLVisibility' has a wrong offset!");
static_assert(offsetof(UTLListView, TooltipPositionData) == 0x0003FC, "Member 'UTLListView::TooltipPositionData' has a wrong offset!");
static_assert(offsetof(UTLListView, TLFocusableData) == 0x000408, "Member 'UTLListView::TLFocusableData' has a wrong offset!");
static_assert(offsetof(UTLListView, VisibleBinding) == 0x000430, "Member 'UTLListView::VisibleBinding' has a wrong offset!");
static_assert(offsetof(UTLListView, EnabledBinding) == 0x000470, "Member 'UTLListView::EnabledBinding' has a wrong offset!");
static_assert(offsetof(UTLListView, ListChangedBinding) == 0x0004B0, "Member 'UTLListView::ListChangedBinding' has a wrong offset!");
static_assert(offsetof(UTLListView, MyAutonAreaType) == 0x0004F0, "Member 'UTLListView::MyAutonAreaType' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaGroupIdValue) == 0x0004F4, "Member 'UTLListView::AutonAreaGroupIdValue' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaOrderTagValue) == 0x0004F8, "Member 'UTLListView::AutonAreaOrderTagValue' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaFence) == 0x0004FC, "Member 'UTLListView::AutonAreaFence' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaDome) == 0x0004FD, "Member 'UTLListView::AutonAreaDome' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaFarPrevFirstBeforeLeaveFlag) == 0x0004FE, "Member 'UTLListView::AutonAreaFarPrevFirstBeforeLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaGoRecentAreaWhenLeaveFlag) == 0x0004FF, "Member 'UTLListView::AutonAreaGoRecentAreaWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaGoBackAreaWhenLeaveFlag) == 0x000500, "Member 'UTLListView::AutonAreaGoBackAreaWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaGoAreaByOrderTagHintWhenLeaveFlag) == 0x000501, "Member 'UTLListView::AutonAreaGoAreaByOrderTagHintWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaLeaveOrderTagHintValue) == 0x000502, "Member 'UTLListView::AutonAreaLeaveOrderTagHintValue' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaLeaveGivenOrderTagValue) == 0x000504, "Member 'UTLListView::AutonAreaLeaveGivenOrderTagValue' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaOrderFirstThenCardinalEnterFlag) == 0x000508, "Member 'UTLListView::AutonAreaOrderFirstThenCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaOrderFirstWhenFarCardinalEnterFlag) == 0x000509, "Member 'UTLListView::AutonAreaOrderFirstWhenFarCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaTakeRecentIfExistWhenCardinalEnterFlag) == 0x00050A, "Member 'UTLListView::AutonAreaTakeRecentIfExistWhenCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaChildNavigatingHint) == 0x00050B, "Member 'UTLListView::AutonAreaChildNavigatingHint' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaFarNavigationWhenShortCardinalFailedFlag) == 0x00050C, "Member 'UTLListView::AutonAreaFarNavigationWhenShortCardinalFailedFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds) == 0x000510, "Member 'UTLListView::AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaCardinalNavigationWeightValue) == 0x000520, "Member 'UTLListView::AutonAreaCardinalNavigationWeightValue' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaDontUseHitOnRoad) == 0x000524, "Member 'UTLListView::AutonAreaDontUseHitOnRoad' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaDontUseNearest) == 0x000525, "Member 'UTLListView::AutonAreaDontUseNearest' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaHaveNosyNeighborsFlag) == 0x000526, "Member 'UTLListView::AutonAreaHaveNosyNeighborsFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaCouldBeLookingAreaFlag) == 0x000527, "Member 'UTLListView::AutonAreaCouldBeLookingAreaFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaLookingFeedbackWidget) == 0x000528, "Member 'UTLListView::AutonAreaLookingFeedbackWidget' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonAreaFocusPresenter) == 0x000530, "Member 'UTLListView::AutonAreaFocusPresenter' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonScrollSensitiveFlag) == 0x000540, "Member 'UTLListView::AutonScrollSensitiveFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonScrollDestionationFlag) == 0x000541, "Member 'UTLListView::AutonScrollDestionationFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonScrollLoopNavigatingHint) == 0x000542, "Member 'UTLListView::AutonScrollLoopNavigatingHint' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonScrollUseFastScrolling) == 0x000543, "Member 'UTLListView::AutonScrollUseFastScrolling' has a wrong offset!");
static_assert(offsetof(UTLListView, AutonScrollNavigationClearWhenStartFastScrollingFlag) == 0x000544, "Member 'UTLListView::AutonScrollNavigationClearWhenStartFastScrollingFlag' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollBarStyle) == 0x000548, "Member 'UTLListView::ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(UTLListView, bCustomScrollBarStyle) == 0x000B28, "Member 'UTLListView::bCustomScrollBarStyle' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollBarStyleConsole) == 0x000B30, "Member 'UTLListView::ScrollBarStyleConsole' has a wrong offset!");
static_assert(offsetof(UTLListView, bCustomScrollBarStyleConsole) == 0x001110, "Member 'UTLListView::bCustomScrollBarStyleConsole' has a wrong offset!");
static_assert(offsetof(UTLListView, bAlwaysShowScrollbar) == 0x001111, "Member 'UTLListView::bAlwaysShowScrollbar' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollbarThickness) == 0x001114, "Member 'UTLListView::ScrollbarThickness' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollbarPadding) == 0x00111C, "Member 'UTLListView::ScrollbarPadding' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollbarTrackPadding) == 0x00112C, "Member 'UTLListView::ScrollbarTrackPadding' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollbarPaddingConsole) == 0x00113C, "Member 'UTLListView::ScrollbarPaddingConsole' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollbarThicknessConsole) == 0x00114C, "Member 'UTLListView::ScrollbarThicknessConsole' has a wrong offset!");
static_assert(offsetof(UTLListView, ScrollbarTrackPaddingConsole) == 0x001154, "Member 'UTLListView::ScrollbarTrackPaddingConsole' has a wrong offset!");
static_assert(offsetof(UTLListView, DragScrollingType) == 0x001164, "Member 'UTLListView::DragScrollingType' has a wrong offset!");

// Class TLUI.TLGridPanel
// 0x0188 (0x02D8 - 0x0150)
class UTLGridPanel : public UGridPanel
{
public:
	uint8                                         Pad_150[0x80];                                     // 0x0150(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLVisibility                          TLVisibility;                                      // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTooltipPositionData                   TooltipPositionData;                               // 0x01D4(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTLWidgetFocusableData                 TLFocusableData;                                   // 0x01E0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x10];                                     // 0x01F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTLWidgetBindingVisible                VisibleBinding;                                    // 0x0208(0x0040)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTLWidgetBindingEnabled                EnabledBinding;                                    // 0x0248(0x0040)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ETLAutonAreaType                              MyAutonAreaType;                                   // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AutonAreaGroupIdValue;                             // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AutonAreaOrderTagValue;                            // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFence;                                    // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDome;                                     // 0x0295(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFarPrevFirstBeforeLeaveFlag;              // 0x0296(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoRecentAreaWhenLeaveFlag;                // 0x0297(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoBackAreaWhenLeaveFlag;                  // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaGoAreaByOrderTagHintWhenLeaveFlag;        // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonOrderTagHint                          AutonAreaLeaveOrderTagHintValue;                   // 0x029A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29B[0x1];                                      // 0x029B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AutonAreaLeaveGivenOrderTagValue;                  // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaOrderFirstThenCardinalEnterFlag;          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaOrderFirstWhenFarCardinalEnterFlag;       // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaTakeRecentIfExistWhenCardinalEnterFlag;   // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETLAutonChildNavigationHint                   AutonAreaChildNavigatingHint;                      // 0x02A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaFarNavigationWhenShortCardinalFailedFlag; // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds; // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AutonAreaCardinalNavigationWeightValue;            // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDontUseHitOnRoad;                         // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaDontUseNearest;                           // 0x02BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaHaveNosyNeighborsFlag;                    // 0x02BE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutonAreaCouldBeLookingAreaFlag;                   // 0x02BF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                AutonAreaLookingFeedbackWidget;                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class ITLWidgetVisibilityInterface> AutonAreaFocusPresenter;                           // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void HandleUpdateEnabled();
	void HandleUpdateVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLGridPanel">();
	}
	static class UTLGridPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLGridPanel>();
	}
};
static_assert(alignof(UTLGridPanel) == 0x000008, "Wrong alignment on UTLGridPanel");
static_assert(sizeof(UTLGridPanel) == 0x0002D8, "Wrong size on UTLGridPanel");
static_assert(offsetof(UTLGridPanel, TLVisibility) == 0x0001D0, "Member 'UTLGridPanel::TLVisibility' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, TooltipPositionData) == 0x0001D4, "Member 'UTLGridPanel::TooltipPositionData' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, TLFocusableData) == 0x0001E0, "Member 'UTLGridPanel::TLFocusableData' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, VisibleBinding) == 0x000208, "Member 'UTLGridPanel::VisibleBinding' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, EnabledBinding) == 0x000248, "Member 'UTLGridPanel::EnabledBinding' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, MyAutonAreaType) == 0x000288, "Member 'UTLGridPanel::MyAutonAreaType' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaGroupIdValue) == 0x00028C, "Member 'UTLGridPanel::AutonAreaGroupIdValue' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaOrderTagValue) == 0x000290, "Member 'UTLGridPanel::AutonAreaOrderTagValue' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaFence) == 0x000294, "Member 'UTLGridPanel::AutonAreaFence' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaDome) == 0x000295, "Member 'UTLGridPanel::AutonAreaDome' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaFarPrevFirstBeforeLeaveFlag) == 0x000296, "Member 'UTLGridPanel::AutonAreaFarPrevFirstBeforeLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaGoRecentAreaWhenLeaveFlag) == 0x000297, "Member 'UTLGridPanel::AutonAreaGoRecentAreaWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaGoBackAreaWhenLeaveFlag) == 0x000298, "Member 'UTLGridPanel::AutonAreaGoBackAreaWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaGoAreaByOrderTagHintWhenLeaveFlag) == 0x000299, "Member 'UTLGridPanel::AutonAreaGoAreaByOrderTagHintWhenLeaveFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaLeaveOrderTagHintValue) == 0x00029A, "Member 'UTLGridPanel::AutonAreaLeaveOrderTagHintValue' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaLeaveGivenOrderTagValue) == 0x00029C, "Member 'UTLGridPanel::AutonAreaLeaveGivenOrderTagValue' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaOrderFirstThenCardinalEnterFlag) == 0x0002A0, "Member 'UTLGridPanel::AutonAreaOrderFirstThenCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaOrderFirstWhenFarCardinalEnterFlag) == 0x0002A1, "Member 'UTLGridPanel::AutonAreaOrderFirstWhenFarCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaTakeRecentIfExistWhenCardinalEnterFlag) == 0x0002A2, "Member 'UTLGridPanel::AutonAreaTakeRecentIfExistWhenCardinalEnterFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaChildNavigatingHint) == 0x0002A3, "Member 'UTLGridPanel::AutonAreaChildNavigatingHint' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaFarNavigationWhenShortCardinalFailedFlag) == 0x0002A4, "Member 'UTLGridPanel::AutonAreaFarNavigationWhenShortCardinalFailedFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds) == 0x0002A8, "Member 'UTLGridPanel::AutonAreaFarNavigationWhenShortCardinalFailedLimitGroupIds' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaCardinalNavigationWeightValue) == 0x0002B8, "Member 'UTLGridPanel::AutonAreaCardinalNavigationWeightValue' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaDontUseHitOnRoad) == 0x0002BC, "Member 'UTLGridPanel::AutonAreaDontUseHitOnRoad' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaDontUseNearest) == 0x0002BD, "Member 'UTLGridPanel::AutonAreaDontUseNearest' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaHaveNosyNeighborsFlag) == 0x0002BE, "Member 'UTLGridPanel::AutonAreaHaveNosyNeighborsFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaCouldBeLookingAreaFlag) == 0x0002BF, "Member 'UTLGridPanel::AutonAreaCouldBeLookingAreaFlag' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaLookingFeedbackWidget) == 0x0002C0, "Member 'UTLGridPanel::AutonAreaLookingFeedbackWidget' has a wrong offset!");
static_assert(offsetof(UTLGridPanel, AutonAreaFocusPresenter) == 0x0002C8, "Member 'UTLGridPanel::AutonAreaFocusPresenter' has a wrong offset!");

// Class TLUI.TLRadioGroup
// 0x0000 (0x02D8 - 0x02D8)
class UTLRadioGroup final : public UTLGridPanel
{
public:
	int32 GetSelectedIndex();
	void SetCheckIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLRadioGroup">();
	}
	static class UTLRadioGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLRadioGroup>();
	}
};
static_assert(alignof(UTLRadioGroup) == 0x000008, "Wrong alignment on UTLRadioGroup");
static_assert(sizeof(UTLRadioGroup) == 0x0002D8, "Wrong size on UTLRadioGroup");

// Class TLUI.TLWidgetTextFontScaleFrameInterface
// 0x0000 (0x0028 - 0x0028)
class ITLWidgetTextFontScaleFrameInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLWidgetTextFontScaleFrameInterface">();
	}
	static class ITLWidgetTextFontScaleFrameInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITLWidgetTextFontScaleFrameInterface>();
	}
};
static_assert(alignof(ITLWidgetTextFontScaleFrameInterface) == 0x000008, "Wrong alignment on ITLWidgetTextFontScaleFrameInterface");
static_assert(sizeof(ITLWidgetTextFontScaleFrameInterface) == 0x000028, "Wrong size on ITLWidgetTextFontScaleFrameInterface");

// Class TLUI.TLLinearBox
// 0x0028 (0x0148 - 0x0120)
class UTLLinearBox final : public UPanelWidget
{
public:
	EOrientation                                  Orientation;                                       // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReverseOrder;                                     // 0x0121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_122[0x26];                                     // 0x0122(0x0026)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetOrientation(EOrientation InOrientation);
	void SetReverseOrder(bool bInReverseOrder);
	void ToggleOrientation();

	EOrientation GetOrientation() const;
	bool GetReverseOrder() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLLinearBox">();
	}
	static class UTLLinearBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLLinearBox>();
	}
};
static_assert(alignof(UTLLinearBox) == 0x000008, "Wrong alignment on UTLLinearBox");
static_assert(sizeof(UTLLinearBox) == 0x000148, "Wrong size on UTLLinearBox");
static_assert(offsetof(UTLLinearBox, Orientation) == 0x000120, "Member 'UTLLinearBox::Orientation' has a wrong offset!");
static_assert(offsetof(UTLLinearBox, bReverseOrder) == 0x000121, "Member 'UTLLinearBox::bReverseOrder' has a wrong offset!");

// Class TLUI.TLViewModelBase
// 0x0000 (0x0030 - 0x0030)
class UTLViewModelBase : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLViewModelBase">();
	}
	static class UTLViewModelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTLViewModelBase>();
	}
};
static_assert(alignof(UTLViewModelBase) == 0x000008, "Wrong alignment on UTLViewModelBase");
static_assert(sizeof(UTLViewModelBase) == 0x000030, "Wrong size on UTLViewModelBase");

// Class TLUI.ComboBoxStringTL
// 0x0D08 (0x0E10 - 0x0108)
class UComboBoxStringTL : public UWidget
{
public:
	TArray<class FString>                         DefaultOptions;                                    // 0x0108(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FString                                 SelectedOption;                                    // 0x0118(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FComboBoxStyle                         WidgetStyle;                                       // 0x0128(0x03F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTableRowStyle                         ItemStyle;                                         // 0x0518(0x07C8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                ContentPadding;                                    // 0x0CE0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxListHeight;                                     // 0x0CF0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasDownArrow;                                      // 0x0CF4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableGamepadNavigationMode;                       // 0x0CF5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CF6[0x2];                                      // 0x0CF6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         Font;                                              // 0x0CF8(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0D50(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bIsFocusable;                                      // 0x0D78(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableRightThumbstickAccept;                       // 0x0D79(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D7A[0x2];                                      // 0x0D7A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Item)>    OnGenerateWidgetEvent;                             // 0x0D7C(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8C[0x4];                                      // 0x0D8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSelectionChanged;                                // 0x0D90(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnOpening;                                         // 0x0DA0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnClosing;                                         // 0x0DB0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC0[0x50];                                     // 0x0DC0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddOption(const class FString& Option);
	void ClearOptions();
	void ClearSelection();
	void OnClosingEvent__DelegateSignature();
	void OnOpeningEvent__DelegateSignature();
	void OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void RefreshOptions();
	bool RemoveOption(const class FString& Option);
	void SetSelectedIndex(const int32 Index_0);
	void SetSelectedOption(const class FString& Option);

	int32 FindOptionIndex(const class FString& Option) const;
	class FString GetOptionAtIndex(int32 Index_0) const;
	int32 GetOptionCount() const;
	int32 GetSelectedIndex() const;
	class FString GetSelectedOption() const;
	bool IsOpen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComboBoxStringTL">();
	}
	static class UComboBoxStringTL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComboBoxStringTL>();
	}
};
static_assert(alignof(UComboBoxStringTL) == 0x000008, "Wrong alignment on UComboBoxStringTL");
static_assert(sizeof(UComboBoxStringTL) == 0x000E10, "Wrong size on UComboBoxStringTL");
static_assert(offsetof(UComboBoxStringTL, DefaultOptions) == 0x000108, "Member 'UComboBoxStringTL::DefaultOptions' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, SelectedOption) == 0x000118, "Member 'UComboBoxStringTL::SelectedOption' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, WidgetStyle) == 0x000128, "Member 'UComboBoxStringTL::WidgetStyle' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, ItemStyle) == 0x000518, "Member 'UComboBoxStringTL::ItemStyle' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, ContentPadding) == 0x000CE0, "Member 'UComboBoxStringTL::ContentPadding' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, MaxListHeight) == 0x000CF0, "Member 'UComboBoxStringTL::MaxListHeight' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, HasDownArrow) == 0x000CF4, "Member 'UComboBoxStringTL::HasDownArrow' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, EnableGamepadNavigationMode) == 0x000CF5, "Member 'UComboBoxStringTL::EnableGamepadNavigationMode' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, Font) == 0x000CF8, "Member 'UComboBoxStringTL::Font' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, ForegroundColor) == 0x000D50, "Member 'UComboBoxStringTL::ForegroundColor' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, bIsFocusable) == 0x000D78, "Member 'UComboBoxStringTL::bIsFocusable' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, EnableRightThumbstickAccept) == 0x000D79, "Member 'UComboBoxStringTL::EnableRightThumbstickAccept' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, OnGenerateWidgetEvent) == 0x000D7C, "Member 'UComboBoxStringTL::OnGenerateWidgetEvent' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, OnSelectionChanged) == 0x000D90, "Member 'UComboBoxStringTL::OnSelectionChanged' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, OnOpening) == 0x000DA0, "Member 'UComboBoxStringTL::OnOpening' has a wrong offset!");
static_assert(offsetof(UComboBoxStringTL, OnClosing) == 0x000DB0, "Member 'UComboBoxStringTL::OnClosing' has a wrong offset!");

// Class TLUI.TLWidgetTextFontScaleInterface
// 0x0000 (0x0028 - 0x0028)
class ITLWidgetTextFontScaleInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TLWidgetTextFontScaleInterface">();
	}
	static class ITLWidgetTextFontScaleInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITLWidgetTextFontScaleInterface>();
	}
};
static_assert(alignof(ITLWidgetTextFontScaleInterface) == 0x000008, "Wrong alignment on ITLWidgetTextFontScaleInterface");
static_assert(sizeof(ITLWidgetTextFontScaleInterface) == 0x000028, "Wrong size on ITLWidgetTextFontScaleInterface");

// Class TLUI.TextLayoutWidgetTL
// 0x00A8 (0x01B0 - 0x0108)
class UTextLayoutWidgetTL : public UWidget
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShapedTextOptions                     ShapedTextOptions;                                 // 0x0118(0x0003)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	ETextJustifyTL                                Justification;                                     // 0x011B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextWrappingPolicy                           WrappingPolicy;                                    // 0x011C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         AutoWrapText : 1;                                  // 0x011D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WrapTextAt;                                        // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
