#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TLUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TLUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TLUI.TLListView.AddItemAt
// 0x0010 (0x0010 - 0x0000)
struct TLListView_AddItemAt final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLListView_AddItemAt) == 0x000008, "Wrong alignment on TLListView_AddItemAt");
static_assert(sizeof(TLListView_AddItemAt) == 0x000010, "Wrong size on TLListView_AddItemAt");
static_assert(offsetof(TLListView_AddItemAt, Item) == 0x000000, "Member 'TLListView_AddItemAt::Item' has a wrong offset!");
static_assert(offsetof(TLListView_AddItemAt, Index_0) == 0x000008, "Member 'TLListView_AddItemAt::Index_0' has a wrong offset!");

// Function TLUI.TLRadioGroup.GetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct TLRadioGroup_GetSelectedIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLRadioGroup_GetSelectedIndex) == 0x000004, "Wrong alignment on TLRadioGroup_GetSelectedIndex");
static_assert(sizeof(TLRadioGroup_GetSelectedIndex) == 0x000004, "Wrong size on TLRadioGroup_GetSelectedIndex");
static_assert(offsetof(TLRadioGroup_GetSelectedIndex, ReturnValue) == 0x000000, "Member 'TLRadioGroup_GetSelectedIndex::ReturnValue' has a wrong offset!");

// Function TLUI.TLRadioGroup.SetCheckIndex
// 0x0004 (0x0004 - 0x0000)
struct TLRadioGroup_SetCheckIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLRadioGroup_SetCheckIndex) == 0x000004, "Wrong alignment on TLRadioGroup_SetCheckIndex");
static_assert(sizeof(TLRadioGroup_SetCheckIndex) == 0x000004, "Wrong size on TLRadioGroup_SetCheckIndex");
static_assert(offsetof(TLRadioGroup_SetCheckIndex, Index_0) == 0x000000, "Member 'TLRadioGroup_SetCheckIndex::Index_0' has a wrong offset!");

// Function TLUI.TLLinearBox.SetOrientation
// 0x0001 (0x0001 - 0x0000)
struct TLLinearBox_SetOrientation final
{
public:
	EOrientation                                  InOrientation;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLLinearBox_SetOrientation) == 0x000001, "Wrong alignment on TLLinearBox_SetOrientation");
static_assert(sizeof(TLLinearBox_SetOrientation) == 0x000001, "Wrong size on TLLinearBox_SetOrientation");
static_assert(offsetof(TLLinearBox_SetOrientation, InOrientation) == 0x000000, "Member 'TLLinearBox_SetOrientation::InOrientation' has a wrong offset!");

// Function TLUI.TLLinearBox.SetReverseOrder
// 0x0001 (0x0001 - 0x0000)
struct TLLinearBox_SetReverseOrder final
{
public:
	bool                                          bInReverseOrder;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLLinearBox_SetReverseOrder) == 0x000001, "Wrong alignment on TLLinearBox_SetReverseOrder");
static_assert(sizeof(TLLinearBox_SetReverseOrder) == 0x000001, "Wrong size on TLLinearBox_SetReverseOrder");
static_assert(offsetof(TLLinearBox_SetReverseOrder, bInReverseOrder) == 0x000000, "Member 'TLLinearBox_SetReverseOrder::bInReverseOrder' has a wrong offset!");

// Function TLUI.TLLinearBox.GetOrientation
// 0x0001 (0x0001 - 0x0000)
struct TLLinearBox_GetOrientation final
{
public:
	EOrientation                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLLinearBox_GetOrientation) == 0x000001, "Wrong alignment on TLLinearBox_GetOrientation");
static_assert(sizeof(TLLinearBox_GetOrientation) == 0x000001, "Wrong size on TLLinearBox_GetOrientation");
static_assert(offsetof(TLLinearBox_GetOrientation, ReturnValue) == 0x000000, "Member 'TLLinearBox_GetOrientation::ReturnValue' has a wrong offset!");

// Function TLUI.TLLinearBox.GetReverseOrder
// 0x0001 (0x0001 - 0x0000)
struct TLLinearBox_GetReverseOrder final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLLinearBox_GetReverseOrder) == 0x000001, "Wrong alignment on TLLinearBox_GetReverseOrder");
static_assert(sizeof(TLLinearBox_GetReverseOrder) == 0x000001, "Wrong size on TLLinearBox_GetReverseOrder");
static_assert(offsetof(TLLinearBox_GetReverseOrder, ReturnValue) == 0x000000, "Member 'TLLinearBox_GetReverseOrder::ReturnValue' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.AddOption
// 0x0010 (0x0010 - 0x0000)
struct ComboBoxStringTL_AddOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_AddOption) == 0x000008, "Wrong alignment on ComboBoxStringTL_AddOption");
static_assert(sizeof(ComboBoxStringTL_AddOption) == 0x000010, "Wrong size on ComboBoxStringTL_AddOption");
static_assert(offsetof(ComboBoxStringTL_AddOption, Option) == 0x000000, "Member 'ComboBoxStringTL_AddOption::Option' has a wrong offset!");

// DelegateFunction TLUI.ComboBoxStringTL.OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'ComboBoxStringTL_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.RemoveOption
// 0x0018 (0x0018 - 0x0000)
struct ComboBoxStringTL_RemoveOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ComboBoxStringTL_RemoveOption) == 0x000008, "Wrong alignment on ComboBoxStringTL_RemoveOption");
static_assert(sizeof(ComboBoxStringTL_RemoveOption) == 0x000018, "Wrong size on ComboBoxStringTL_RemoveOption");
static_assert(offsetof(ComboBoxStringTL_RemoveOption, Option) == 0x000000, "Member 'ComboBoxStringTL_RemoveOption::Option' has a wrong offset!");
static_assert(offsetof(ComboBoxStringTL_RemoveOption, ReturnValue) == 0x000010, "Member 'ComboBoxStringTL_RemoveOption::ReturnValue' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.SetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct ComboBoxStringTL_SetSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_SetSelectedIndex) == 0x000004, "Wrong alignment on ComboBoxStringTL_SetSelectedIndex");
static_assert(sizeof(ComboBoxStringTL_SetSelectedIndex) == 0x000004, "Wrong size on ComboBoxStringTL_SetSelectedIndex");
static_assert(offsetof(ComboBoxStringTL_SetSelectedIndex, Index_0) == 0x000000, "Member 'ComboBoxStringTL_SetSelectedIndex::Index_0' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.SetSelectedOption
// 0x0010 (0x0010 - 0x0000)
struct ComboBoxStringTL_SetSelectedOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_SetSelectedOption) == 0x000008, "Wrong alignment on ComboBoxStringTL_SetSelectedOption");
static_assert(sizeof(ComboBoxStringTL_SetSelectedOption) == 0x000010, "Wrong size on ComboBoxStringTL_SetSelectedOption");
static_assert(offsetof(ComboBoxStringTL_SetSelectedOption, Option) == 0x000000, "Member 'ComboBoxStringTL_SetSelectedOption::Option' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.FindOptionIndex
// 0x0018 (0x0018 - 0x0000)
struct ComboBoxStringTL_FindOptionIndex final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ComboBoxStringTL_FindOptionIndex) == 0x000008, "Wrong alignment on ComboBoxStringTL_FindOptionIndex");
static_assert(sizeof(ComboBoxStringTL_FindOptionIndex) == 0x000018, "Wrong size on ComboBoxStringTL_FindOptionIndex");
static_assert(offsetof(ComboBoxStringTL_FindOptionIndex, Option) == 0x000000, "Member 'ComboBoxStringTL_FindOptionIndex::Option' has a wrong offset!");
static_assert(offsetof(ComboBoxStringTL_FindOptionIndex, ReturnValue) == 0x000010, "Member 'ComboBoxStringTL_FindOptionIndex::ReturnValue' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.GetOptionAtIndex
// 0x0018 (0x0018 - 0x0000)
struct ComboBoxStringTL_GetOptionAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_GetOptionAtIndex) == 0x000008, "Wrong alignment on ComboBoxStringTL_GetOptionAtIndex");
static_assert(sizeof(ComboBoxStringTL_GetOptionAtIndex) == 0x000018, "Wrong size on ComboBoxStringTL_GetOptionAtIndex");
static_assert(offsetof(ComboBoxStringTL_GetOptionAtIndex, Index_0) == 0x000000, "Member 'ComboBoxStringTL_GetOptionAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(ComboBoxStringTL_GetOptionAtIndex, ReturnValue) == 0x000008, "Member 'ComboBoxStringTL_GetOptionAtIndex::ReturnValue' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.GetOptionCount
// 0x0004 (0x0004 - 0x0000)
struct ComboBoxStringTL_GetOptionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_GetOptionCount) == 0x000004, "Wrong alignment on ComboBoxStringTL_GetOptionCount");
static_assert(sizeof(ComboBoxStringTL_GetOptionCount) == 0x000004, "Wrong size on ComboBoxStringTL_GetOptionCount");
static_assert(offsetof(ComboBoxStringTL_GetOptionCount, ReturnValue) == 0x000000, "Member 'ComboBoxStringTL_GetOptionCount::ReturnValue' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.GetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct ComboBoxStringTL_GetSelectedIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_GetSelectedIndex) == 0x000004, "Wrong alignment on ComboBoxStringTL_GetSelectedIndex");
static_assert(sizeof(ComboBoxStringTL_GetSelectedIndex) == 0x000004, "Wrong size on ComboBoxStringTL_GetSelectedIndex");
static_assert(offsetof(ComboBoxStringTL_GetSelectedIndex, ReturnValue) == 0x000000, "Member 'ComboBoxStringTL_GetSelectedIndex::ReturnValue' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.GetSelectedOption
// 0x0010 (0x0010 - 0x0000)
struct ComboBoxStringTL_GetSelectedOption final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_GetSelectedOption) == 0x000008, "Wrong alignment on ComboBoxStringTL_GetSelectedOption");
static_assert(sizeof(ComboBoxStringTL_GetSelectedOption) == 0x000010, "Wrong size on ComboBoxStringTL_GetSelectedOption");
static_assert(offsetof(ComboBoxStringTL_GetSelectedOption, ReturnValue) == 0x000000, "Member 'ComboBoxStringTL_GetSelectedOption::ReturnValue' has a wrong offset!");

// Function TLUI.ComboBoxStringTL.IsOpen
// 0x0001 (0x0001 - 0x0000)
struct ComboBoxStringTL_IsOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ComboBoxStringTL_IsOpen) == 0x000001, "Wrong alignment on ComboBoxStringTL_IsOpen");
static_assert(sizeof(ComboBoxStringTL_IsOpen) == 0x000001, "Wrong size on ComboBoxStringTL_IsOpen");
static_assert(offsetof(ComboBoxStringTL_IsOpen, ReturnValue) == 0x000000, "Member 'ComboBoxStringTL_IsOpen::ReturnValue' has a wrong offset!");

// Function TLUI.TextLayoutWidgetTL.SetJustification
// 0x0001 (0x0001 - 0x0000)
struct TextLayoutWidgetTL_SetJustification final
{
public:
	ETextJustifyTL                                InJustification;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TextLayoutWidgetTL_SetJustification) == 0x000001, "Wrong alignment on TextLayoutWidgetTL_SetJustification");
static_assert(sizeof(TextLayoutWidgetTL_SetJustification) == 0x000001, "Wrong size on TextLayoutWidgetTL_SetJustification");
static_assert(offsetof(TextLayoutWidgetTL_SetJustification, InJustification) == 0x000000, "Member 'TextLayoutWidgetTL_SetJustification::InJustification' has a wrong offset!");

// Function TLUI.TLBorder.SetBrushFromSoftObjectPath
// 0x0020 (0x0020 - 0x0000)
struct TLBorder_SetBrushFromSoftObjectPath final
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAsyncLoad;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLBorder_SetBrushFromSoftObjectPath) == 0x000008, "Wrong alignment on TLBorder_SetBrushFromSoftObjectPath");
static_assert(sizeof(TLBorder_SetBrushFromSoftObjectPath) == 0x000020, "Wrong size on TLBorder_SetBrushFromSoftObjectPath");
static_assert(offsetof(TLBorder_SetBrushFromSoftObjectPath, Path) == 0x000000, "Member 'TLBorder_SetBrushFromSoftObjectPath::Path' has a wrong offset!");
static_assert(offsetof(TLBorder_SetBrushFromSoftObjectPath, bInAsyncLoad) == 0x000018, "Member 'TLBorder_SetBrushFromSoftObjectPath::bInAsyncLoad' has a wrong offset!");

// Function TLUI.TLBorder.SetBrushFromSprite
// 0x0008 (0x0008 - 0x0000)
struct TLBorder_SetBrushFromSprite final
{
public:
	class UPaperSprite*                           Sprite;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLBorder_SetBrushFromSprite) == 0x000008, "Wrong alignment on TLBorder_SetBrushFromSprite");
static_assert(sizeof(TLBorder_SetBrushFromSprite) == 0x000008, "Wrong size on TLBorder_SetBrushFromSprite");
static_assert(offsetof(TLBorder_SetBrushFromSprite, Sprite) == 0x000000, "Member 'TLBorder_SetBrushFromSprite::Sprite' has a wrong offset!");

// Function TLUI.TLBorder.SetBrushTintColorWithColorTable
// 0x0008 (0x0008 - 0x0000)
struct TLBorder_SetBrushTintColorWithColorTable final
{
public:
	class FName                                   InTableColorKey;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLBorder_SetBrushTintColorWithColorTable) == 0x000004, "Wrong alignment on TLBorder_SetBrushTintColorWithColorTable");
static_assert(sizeof(TLBorder_SetBrushTintColorWithColorTable) == 0x000008, "Wrong size on TLBorder_SetBrushTintColorWithColorTable");
static_assert(offsetof(TLBorder_SetBrushTintColorWithColorTable, InTableColorKey) == 0x000000, "Member 'TLBorder_SetBrushTintColorWithColorTable::InTableColorKey' has a wrong offset!");

// Function TLUI.TLBorder.SetContentColorWithColorTable
// 0x0008 (0x0008 - 0x0000)
struct TLBorder_SetContentColorWithColorTable final
{
public:
	class FName                                   InTableColorKey;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLBorder_SetContentColorWithColorTable) == 0x000004, "Wrong alignment on TLBorder_SetContentColorWithColorTable");
static_assert(sizeof(TLBorder_SetContentColorWithColorTable) == 0x000008, "Wrong size on TLBorder_SetContentColorWithColorTable");
static_assert(offsetof(TLBorder_SetContentColorWithColorTable, InTableColorKey) == 0x000000, "Member 'TLBorder_SetContentColorWithColorTable::InTableColorKey' has a wrong offset!");

// Function TLUI.TLCheckBox.OnTLCheckStateChangedCallback
// 0x0001 (0x0001 - 0x0000)
struct TLCheckBox_OnTLCheckStateChangedCallback final
{
public:
	bool                                          IsChecked_0;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLCheckBox_OnTLCheckStateChangedCallback) == 0x000001, "Wrong alignment on TLCheckBox_OnTLCheckStateChangedCallback");
static_assert(sizeof(TLCheckBox_OnTLCheckStateChangedCallback) == 0x000001, "Wrong size on TLCheckBox_OnTLCheckStateChangedCallback");
static_assert(offsetof(TLCheckBox_OnTLCheckStateChangedCallback, IsChecked_0) == 0x000000, "Member 'TLCheckBox_OnTLCheckStateChangedCallback::IsChecked_0' has a wrong offset!");

// Function TLUI.TLComboBoxString.OnSelectionChangedHandler
// 0x0018 (0x0018 - 0x0000)
struct TLComboBoxString_OnSelectionChangedHandler final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLComboBoxString_OnSelectionChangedHandler) == 0x000008, "Wrong alignment on TLComboBoxString_OnSelectionChangedHandler");
static_assert(sizeof(TLComboBoxString_OnSelectionChangedHandler) == 0x000018, "Wrong size on TLComboBoxString_OnSelectionChangedHandler");
static_assert(offsetof(TLComboBoxString_OnSelectionChangedHandler, SelectedItem) == 0x000000, "Member 'TLComboBoxString_OnSelectionChangedHandler::SelectedItem' has a wrong offset!");
static_assert(offsetof(TLComboBoxString_OnSelectionChangedHandler, SelectionType) == 0x000010, "Member 'TLComboBoxString_OnSelectionChangedHandler::SelectionType' has a wrong offset!");

// Function TLUI.TLComboBoxString.SetMenuPlacement
// 0x0001 (0x0001 - 0x0000)
struct TLComboBoxString_SetMenuPlacement final
{
public:
	EMenuPlacement                                InMenuPlacement;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLComboBoxString_SetMenuPlacement) == 0x000001, "Wrong alignment on TLComboBoxString_SetMenuPlacement");
static_assert(sizeof(TLComboBoxString_SetMenuPlacement) == 0x000001, "Wrong size on TLComboBoxString_SetMenuPlacement");
static_assert(offsetof(TLComboBoxString_SetMenuPlacement, InMenuPlacement) == 0x000000, "Member 'TLComboBoxString_SetMenuPlacement::InMenuPlacement' has a wrong offset!");

// Function TLUI.TLComboBoxString.SetSelectedOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct TLComboBoxString_SetSelectedOptionIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLComboBoxString_SetSelectedOptionIndex) == 0x000004, "Wrong alignment on TLComboBoxString_SetSelectedOptionIndex");
static_assert(sizeof(TLComboBoxString_SetSelectedOptionIndex) == 0x000004, "Wrong size on TLComboBoxString_SetSelectedOptionIndex");
static_assert(offsetof(TLComboBoxString_SetSelectedOptionIndex, Index_0) == 0x000000, "Member 'TLComboBoxString_SetSelectedOptionIndex::Index_0' has a wrong offset!");

// Function TLUI.TLComboBoxString.GetSelectedOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct TLComboBoxString_GetSelectedOptionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLComboBoxString_GetSelectedOptionIndex) == 0x000004, "Wrong alignment on TLComboBoxString_GetSelectedOptionIndex");
static_assert(sizeof(TLComboBoxString_GetSelectedOptionIndex) == 0x000004, "Wrong size on TLComboBoxString_GetSelectedOptionIndex");
static_assert(offsetof(TLComboBoxString_GetSelectedOptionIndex, ReturnValue) == 0x000000, "Member 'TLComboBoxString_GetSelectedOptionIndex::ReturnValue' has a wrong offset!");

// DelegateFunction TLUI.TLEditableTextBox.OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct TLEditableTextBox_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on TLEditableTextBox_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(TLEditableTextBox_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on TLEditableTextBox_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(TLEditableTextBox_OnEditableTextBoxChangedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'TLEditableTextBox_OnEditableTextBoxChangedEvent__DelegateSignature::Text_0' has a wrong offset!");

// DelegateFunction TLUI.TLEditableTextBox.OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature::Text_0' has a wrong offset!");
static_assert(offsetof(TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'TLEditableTextBox_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// DelegateFunction TLUI.TLEditableTextBox.OnEditableTextFocusLostEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TLEditableTextBox_OnEditableTextFocusLostEvent__DelegateSignature final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_OnEditableTextFocusLostEvent__DelegateSignature) == 0x000004, "Wrong alignment on TLEditableTextBox_OnEditableTextFocusLostEvent__DelegateSignature");
static_assert(sizeof(TLEditableTextBox_OnEditableTextFocusLostEvent__DelegateSignature) == 0x000008, "Wrong size on TLEditableTextBox_OnEditableTextFocusLostEvent__DelegateSignature");
static_assert(offsetof(TLEditableTextBox_OnEditableTextFocusLostEvent__DelegateSignature, InFocusEvent) == 0x000000, "Member 'TLEditableTextBox_OnEditableTextFocusLostEvent__DelegateSignature::InFocusEvent' has a wrong offset!");

// DelegateFunction TLUI.TLEditableTextBox.OnEditableTextFocusReceivedEvent__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature) == 0x000004, "Wrong alignment on TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature");
static_assert(sizeof(TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature) == 0x000040, "Wrong size on TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature");
static_assert(offsetof(TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature, MyGeometry) == 0x000000, "Member 'TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature::MyGeometry' has a wrong offset!");
static_assert(offsetof(TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature, InFocusEvent) == 0x000038, "Member 'TLEditableTextBox_OnEditableTextFocusReceivedEvent__DelegateSignature::InFocusEvent' has a wrong offset!");

// DelegateFunction TLUI.TLEditableTextBox.OnEditableTextMouseButtonDownEvent__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature) == 0x000008, "Wrong alignment on TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature");
static_assert(sizeof(TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature) == 0x0000A8, "Wrong size on TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature");
static_assert(offsetof(TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature, MyGeometry) == 0x000000, "Member 'TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature::MyGeometry' has a wrong offset!");
static_assert(offsetof(TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature, InMouseEvent) == 0x000038, "Member 'TLEditableTextBox_OnEditableTextMouseButtonDownEvent__DelegateSignature::InMouseEvent' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetError
// 0x0018 (0x0018 - 0x0000)
struct TLEditableTextBox_SetError final
{
public:
	class FText                                   InError;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetError) == 0x000008, "Wrong alignment on TLEditableTextBox_SetError");
static_assert(sizeof(TLEditableTextBox_SetError) == 0x000018, "Wrong size on TLEditableTextBox_SetError");
static_assert(offsetof(TLEditableTextBox_SetError, InError) == 0x000000, "Member 'TLEditableTextBox_SetError::InError' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetEscapeAction
// 0x0001 (0x0001 - 0x0000)
struct TLEditableTextBox_SetEscapeAction final
{
public:
	ETLEditableBoxEscapeAction                    InEscapeAction;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetEscapeAction) == 0x000001, "Wrong alignment on TLEditableTextBox_SetEscapeAction");
static_assert(sizeof(TLEditableTextBox_SetEscapeAction) == 0x000001, "Wrong size on TLEditableTextBox_SetEscapeAction");
static_assert(offsetof(TLEditableTextBox_SetEscapeAction, InEscapeAction) == 0x000000, "Member 'TLEditableTextBox_SetEscapeAction::InEscapeAction' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetHintText
// 0x0018 (0x0018 - 0x0000)
struct TLEditableTextBox_SetHintText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetHintText) == 0x000008, "Wrong alignment on TLEditableTextBox_SetHintText");
static_assert(sizeof(TLEditableTextBox_SetHintText) == 0x000018, "Wrong size on TLEditableTextBox_SetHintText");
static_assert(offsetof(TLEditableTextBox_SetHintText, InText) == 0x000000, "Member 'TLEditableTextBox_SetHintText::InText' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetIgnoreFocusLostCommited
// 0x0001 (0x0001 - 0x0000)
struct TLEditableTextBox_SetIgnoreFocusLostCommited final
{
public:
	bool                                          InIsIgnore;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetIgnoreFocusLostCommited) == 0x000001, "Wrong alignment on TLEditableTextBox_SetIgnoreFocusLostCommited");
static_assert(sizeof(TLEditableTextBox_SetIgnoreFocusLostCommited) == 0x000001, "Wrong size on TLEditableTextBox_SetIgnoreFocusLostCommited");
static_assert(offsetof(TLEditableTextBox_SetIgnoreFocusLostCommited, InIsIgnore) == 0x000000, "Member 'TLEditableTextBox_SetIgnoreFocusLostCommited::InIsIgnore' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetIsPassword
// 0x0001 (0x0001 - 0x0000)
struct TLEditableTextBox_SetIsPassword final
{
public:
	bool                                          bIsPassword;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetIsPassword) == 0x000001, "Wrong alignment on TLEditableTextBox_SetIsPassword");
static_assert(sizeof(TLEditableTextBox_SetIsPassword) == 0x000001, "Wrong size on TLEditableTextBox_SetIsPassword");
static_assert(offsetof(TLEditableTextBox_SetIsPassword, bIsPassword) == 0x000000, "Member 'TLEditableTextBox_SetIsPassword::bIsPassword' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetIsReadOnly
// 0x0001 (0x0001 - 0x0000)
struct TLEditableTextBox_SetIsReadOnly final
{
public:
	bool                                          bReadOnly;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetIsReadOnly) == 0x000001, "Wrong alignment on TLEditableTextBox_SetIsReadOnly");
static_assert(sizeof(TLEditableTextBox_SetIsReadOnly) == 0x000001, "Wrong size on TLEditableTextBox_SetIsReadOnly");
static_assert(offsetof(TLEditableTextBox_SetIsReadOnly, bReadOnly) == 0x000000, "Member 'TLEditableTextBox_SetIsReadOnly::bReadOnly' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetMaxChar
// 0x0004 (0x0004 - 0x0000)
struct TLEditableTextBox_SetMaxChar final
{
public:
	int32                                         InMaxChar;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetMaxChar) == 0x000004, "Wrong alignment on TLEditableTextBox_SetMaxChar");
static_assert(sizeof(TLEditableTextBox_SetMaxChar) == 0x000004, "Wrong size on TLEditableTextBox_SetMaxChar");
static_assert(offsetof(TLEditableTextBox_SetMaxChar, InMaxChar) == 0x000000, "Member 'TLEditableTextBox_SetMaxChar::InMaxChar' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetReplyUnhandledWhenVirtualAcceptKeyDown
// 0x0001 (0x0001 - 0x0000)
struct TLEditableTextBox_SetReplyUnhandledWhenVirtualAcceptKeyDown final
{
public:
	bool                                          InReplyUnhandled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetReplyUnhandledWhenVirtualAcceptKeyDown) == 0x000001, "Wrong alignment on TLEditableTextBox_SetReplyUnhandledWhenVirtualAcceptKeyDown");
static_assert(sizeof(TLEditableTextBox_SetReplyUnhandledWhenVirtualAcceptKeyDown) == 0x000001, "Wrong size on TLEditableTextBox_SetReplyUnhandledWhenVirtualAcceptKeyDown");
static_assert(offsetof(TLEditableTextBox_SetReplyUnhandledWhenVirtualAcceptKeyDown, InReplyUnhandled) == 0x000000, "Member 'TLEditableTextBox_SetReplyUnhandledWhenVirtualAcceptKeyDown::InReplyUnhandled' has a wrong offset!");

// Function TLUI.TLEditableTextBox.SetText
// 0x0018 (0x0018 - 0x0000)
struct TLEditableTextBox_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_SetText) == 0x000008, "Wrong alignment on TLEditableTextBox_SetText");
static_assert(sizeof(TLEditableTextBox_SetText) == 0x000018, "Wrong size on TLEditableTextBox_SetText");
static_assert(offsetof(TLEditableTextBox_SetText, InText) == 0x000000, "Member 'TLEditableTextBox_SetText::InText' has a wrong offset!");

// Function TLUI.TLEditableTextBox.GetText
// 0x0018 (0x0018 - 0x0000)
struct TLEditableTextBox_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_GetText) == 0x000008, "Wrong alignment on TLEditableTextBox_GetText");
static_assert(sizeof(TLEditableTextBox_GetText) == 0x000018, "Wrong size on TLEditableTextBox_GetText");
static_assert(offsetof(TLEditableTextBox_GetText, ReturnValue) == 0x000000, "Member 'TLEditableTextBox_GetText::ReturnValue' has a wrong offset!");

// Function TLUI.TLEditableTextBox.HasError
// 0x0001 (0x0001 - 0x0000)
struct TLEditableTextBox_HasError final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLEditableTextBox_HasError) == 0x000001, "Wrong alignment on TLEditableTextBox_HasError");
static_assert(sizeof(TLEditableTextBox_HasError) == 0x000001, "Wrong size on TLEditableTextBox_HasError");
static_assert(offsetof(TLEditableTextBox_HasError, ReturnValue) == 0x000000, "Member 'TLEditableTextBox_HasError::ReturnValue' has a wrong offset!");

// Function TLUI.TLImageBase.GetDynamicMaterial
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_GetDynamicMaterial final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_GetDynamicMaterial) == 0x000008, "Wrong alignment on TLImageBase_GetDynamicMaterial");
static_assert(sizeof(TLImageBase_GetDynamicMaterial) == 0x000008, "Wrong size on TLImageBase_GetDynamicMaterial");
static_assert(offsetof(TLImageBase_GetDynamicMaterial, ReturnValue) == 0x000000, "Member 'TLImageBase_GetDynamicMaterial::ReturnValue' has a wrong offset!");

// Function TLUI.TLImageBase.PlayOrCloseBinkMediaPlayer
// 0x0001 (0x0001 - 0x0000)
struct TLImageBase_PlayOrCloseBinkMediaPlayer final
{
public:
	bool                                          bInPlay;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_PlayOrCloseBinkMediaPlayer) == 0x000001, "Wrong alignment on TLImageBase_PlayOrCloseBinkMediaPlayer");
static_assert(sizeof(TLImageBase_PlayOrCloseBinkMediaPlayer) == 0x000001, "Wrong size on TLImageBase_PlayOrCloseBinkMediaPlayer");
static_assert(offsetof(TLImageBase_PlayOrCloseBinkMediaPlayer, bInPlay) == 0x000000, "Member 'TLImageBase_PlayOrCloseBinkMediaPlayer::bInPlay' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrush
// 0x0088 (0x0088 - 0x0000)
struct TLImageBase_SetBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrush) == 0x000008, "Wrong alignment on TLImageBase_SetBrush");
static_assert(sizeof(TLImageBase_SetBrush) == 0x000088, "Wrong size on TLImageBase_SetBrush");
static_assert(offsetof(TLImageBase_SetBrush, InBrush) == 0x000000, "Member 'TLImageBase_SetBrush::InBrush' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromAsset
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_SetBrushFromAsset final
{
public:
	class USlateBrushAsset*                       Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushFromAsset) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromAsset");
static_assert(sizeof(TLImageBase_SetBrushFromAsset) == 0x000008, "Wrong size on TLImageBase_SetBrushFromAsset");
static_assert(offsetof(TLImageBase_SetBrushFromAsset, Asset) == 0x000000, "Member 'TLImageBase_SetBrushFromAsset::Asset' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromAtlasInterface
// 0x0018 (0x0018 - 0x0000)
struct TLImageBase_SetBrushFromAtlasInterface final
{
public:
	TScriptInterface<class ISlateTextureAtlasInterface> AtlasRegion;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLImageBase_SetBrushFromAtlasInterface) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromAtlasInterface");
static_assert(sizeof(TLImageBase_SetBrushFromAtlasInterface) == 0x000018, "Wrong size on TLImageBase_SetBrushFromAtlasInterface");
static_assert(offsetof(TLImageBase_SetBrushFromAtlasInterface, AtlasRegion) == 0x000000, "Member 'TLImageBase_SetBrushFromAtlasInterface::AtlasRegion' has a wrong offset!");
static_assert(offsetof(TLImageBase_SetBrushFromAtlasInterface, bMatchSize) == 0x000010, "Member 'TLImageBase_SetBrushFromAtlasInterface::bMatchSize' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromMaterial
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_SetBrushFromMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushFromMaterial) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromMaterial");
static_assert(sizeof(TLImageBase_SetBrushFromMaterial) == 0x000008, "Wrong size on TLImageBase_SetBrushFromMaterial");
static_assert(offsetof(TLImageBase_SetBrushFromMaterial, Material) == 0x000000, "Member 'TLImageBase_SetBrushFromMaterial::Material' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromMediaTexture
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_SetBrushFromMediaTexture final
{
public:
	class UBinkMediaTexture*                      Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushFromMediaTexture) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromMediaTexture");
static_assert(sizeof(TLImageBase_SetBrushFromMediaTexture) == 0x000008, "Wrong size on TLImageBase_SetBrushFromMediaTexture");
static_assert(offsetof(TLImageBase_SetBrushFromMediaTexture, Texture) == 0x000000, "Member 'TLImageBase_SetBrushFromMediaTexture::Texture' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromRenderTarget
// 0x0010 (0x0010 - 0x0000)
struct TLImageBase_SetBrushFromRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLImageBase_SetBrushFromRenderTarget) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromRenderTarget");
static_assert(sizeof(TLImageBase_SetBrushFromRenderTarget) == 0x000010, "Wrong size on TLImageBase_SetBrushFromRenderTarget");
static_assert(offsetof(TLImageBase_SetBrushFromRenderTarget, Texture) == 0x000000, "Member 'TLImageBase_SetBrushFromRenderTarget::Texture' has a wrong offset!");
static_assert(offsetof(TLImageBase_SetBrushFromRenderTarget, bMatchSize) == 0x000008, "Member 'TLImageBase_SetBrushFromRenderTarget::bMatchSize' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromSoftMaterial
// 0x0028 (0x0028 - 0x0000)
struct TLImageBase_SetBrushFromSoftMaterial final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      SoftMaterial;                                      // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushFromSoftMaterial) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromSoftMaterial");
static_assert(sizeof(TLImageBase_SetBrushFromSoftMaterial) == 0x000028, "Wrong size on TLImageBase_SetBrushFromSoftMaterial");
static_assert(offsetof(TLImageBase_SetBrushFromSoftMaterial, SoftMaterial) == 0x000000, "Member 'TLImageBase_SetBrushFromSoftMaterial::SoftMaterial' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromSoftTexture
// 0x0030 (0x0030 - 0x0000)
struct TLImageBase_SetBrushFromSoftTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              SoftTexture;                                       // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLImageBase_SetBrushFromSoftTexture) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromSoftTexture");
static_assert(sizeof(TLImageBase_SetBrushFromSoftTexture) == 0x000030, "Wrong size on TLImageBase_SetBrushFromSoftTexture");
static_assert(offsetof(TLImageBase_SetBrushFromSoftTexture, SoftTexture) == 0x000000, "Member 'TLImageBase_SetBrushFromSoftTexture::SoftTexture' has a wrong offset!");
static_assert(offsetof(TLImageBase_SetBrushFromSoftTexture, bMatchSize) == 0x000028, "Member 'TLImageBase_SetBrushFromSoftTexture::bMatchSize' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromTexture
// 0x0010 (0x0010 - 0x0000)
struct TLImageBase_SetBrushFromTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLImageBase_SetBrushFromTexture) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromTexture");
static_assert(sizeof(TLImageBase_SetBrushFromTexture) == 0x000010, "Wrong size on TLImageBase_SetBrushFromTexture");
static_assert(offsetof(TLImageBase_SetBrushFromTexture, Texture) == 0x000000, "Member 'TLImageBase_SetBrushFromTexture::Texture' has a wrong offset!");
static_assert(offsetof(TLImageBase_SetBrushFromTexture, bMatchSize) == 0x000008, "Member 'TLImageBase_SetBrushFromTexture::bMatchSize' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromTexture_MaintainRatio
// 0x0010 (0x0010 - 0x0000)
struct TLImageBase_SetBrushFromTexture_MaintainRatio final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              DefaultSize;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushFromTexture_MaintainRatio) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromTexture_MaintainRatio");
static_assert(sizeof(TLImageBase_SetBrushFromTexture_MaintainRatio) == 0x000010, "Wrong size on TLImageBase_SetBrushFromTexture_MaintainRatio");
static_assert(offsetof(TLImageBase_SetBrushFromTexture_MaintainRatio, Texture) == 0x000000, "Member 'TLImageBase_SetBrushFromTexture_MaintainRatio::Texture' has a wrong offset!");
static_assert(offsetof(TLImageBase_SetBrushFromTexture_MaintainRatio, DefaultSize) == 0x000008, "Member 'TLImageBase_SetBrushFromTexture_MaintainRatio::DefaultSize' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushFromTextureDynamic
// 0x0010 (0x0010 - 0x0000)
struct TLImageBase_SetBrushFromTextureDynamic final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TLImageBase_SetBrushFromTextureDynamic) == 0x000008, "Wrong alignment on TLImageBase_SetBrushFromTextureDynamic");
static_assert(sizeof(TLImageBase_SetBrushFromTextureDynamic) == 0x000010, "Wrong size on TLImageBase_SetBrushFromTextureDynamic");
static_assert(offsetof(TLImageBase_SetBrushFromTextureDynamic, Texture) == 0x000000, "Member 'TLImageBase_SetBrushFromTextureDynamic::Texture' has a wrong offset!");
static_assert(offsetof(TLImageBase_SetBrushFromTextureDynamic, bMatchSize) == 0x000008, "Member 'TLImageBase_SetBrushFromTextureDynamic::bMatchSize' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushResourceObject
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_SetBrushResourceObject final
{
public:
	class UObject*                                ResourceObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushResourceObject) == 0x000008, "Wrong alignment on TLImageBase_SetBrushResourceObject");
static_assert(sizeof(TLImageBase_SetBrushResourceObject) == 0x000008, "Wrong size on TLImageBase_SetBrushResourceObject");
static_assert(offsetof(TLImageBase_SetBrushResourceObject, ResourceObject) == 0x000000, "Member 'TLImageBase_SetBrushResourceObject::ResourceObject' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushSize
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_SetBrushSize final
{
public:
	struct FVector2D                              DesiredSize;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushSize) == 0x000004, "Wrong alignment on TLImageBase_SetBrushSize");
static_assert(sizeof(TLImageBase_SetBrushSize) == 0x000008, "Wrong size on TLImageBase_SetBrushSize");
static_assert(offsetof(TLImageBase_SetBrushSize, DesiredSize) == 0x000000, "Member 'TLImageBase_SetBrushSize::DesiredSize' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushTintColor
// 0x0028 (0x0028 - 0x0000)
struct TLImageBase_SetBrushTintColor final
{
public:
	struct FSlateColor                            TintColor;                                         // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushTintColor) == 0x000008, "Wrong alignment on TLImageBase_SetBrushTintColor");
static_assert(sizeof(TLImageBase_SetBrushTintColor) == 0x000028, "Wrong size on TLImageBase_SetBrushTintColor");
static_assert(offsetof(TLImageBase_SetBrushTintColor, TintColor) == 0x000000, "Member 'TLImageBase_SetBrushTintColor::TintColor' has a wrong offset!");

// Function TLUI.TLImageBase.SetBrushTintColorWithColorTable
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_SetBrushTintColorWithColorTable final
{
public:
	class FName                                   InTableColorKey;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetBrushTintColorWithColorTable) == 0x000004, "Wrong alignment on TLImageBase_SetBrushTintColorWithColorTable");
static_assert(sizeof(TLImageBase_SetBrushTintColorWithColorTable) == 0x000008, "Wrong size on TLImageBase_SetBrushTintColorWithColorTable");
static_assert(offsetof(TLImageBase_SetBrushTintColorWithColorTable, InTableColorKey) == 0x000000, "Member 'TLImageBase_SetBrushTintColorWithColorTable::InTableColorKey' has a wrong offset!");

// Function TLUI.TLImageBase.SetColorAndOpacity
// 0x0010 (0x0010 - 0x0000)
struct TLImageBase_SetColorAndOpacity final
{
public:
	struct FLinearColor                           InColorAndOpacity;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetColorAndOpacity) == 0x000004, "Wrong alignment on TLImageBase_SetColorAndOpacity");
static_assert(sizeof(TLImageBase_SetColorAndOpacity) == 0x000010, "Wrong size on TLImageBase_SetColorAndOpacity");
static_assert(offsetof(TLImageBase_SetColorAndOpacity, InColorAndOpacity) == 0x000000, "Member 'TLImageBase_SetColorAndOpacity::InColorAndOpacity' has a wrong offset!");

// Function TLUI.TLImageBase.SetColorWithColorTable
// 0x0008 (0x0008 - 0x0000)
struct TLImageBase_SetColorWithColorTable final
{
public:
	class FName                                   InTableColorKey;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetColorWithColorTable) == 0x000004, "Wrong alignment on TLImageBase_SetColorWithColorTable");
static_assert(sizeof(TLImageBase_SetColorWithColorTable) == 0x000008, "Wrong size on TLImageBase_SetColorWithColorTable");
static_assert(offsetof(TLImageBase_SetColorWithColorTable, InTableColorKey) == 0x000000, "Member 'TLImageBase_SetColorWithColorTable::InTableColorKey' has a wrong offset!");

// Function TLUI.TLImageBase.SetOpacity
// 0x0004 (0x0004 - 0x0000)
struct TLImageBase_SetOpacity final
{
public:
	float                                         InOpacity;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLImageBase_SetOpacity) == 0x000004, "Wrong alignment on TLImageBase_SetOpacity");
static_assert(sizeof(TLImageBase_SetOpacity) == 0x000004, "Wrong size on TLImageBase_SetOpacity");
static_assert(offsetof(TLImageBase_SetOpacity, InOpacity) == 0x000000, "Member 'TLImageBase_SetOpacity::InOpacity' has a wrong offset!");

// Function TLUI.TLFlipBookImage.SetCurrentFrame
// 0x0004 (0x0004 - 0x0000)
struct TLFlipBookImage_SetCurrentFrame final
{
public:
	int32                                         Frame;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TLFlipBookImage_SetCurrentFrame) == 0x000004, "Wrong alignment on TLFlipBookImage_SetCurrentFrame");
static_assert(sizeof(TLFlipBookImage_SetCurrentFrame) == 0x000004, "Wrong size on TLFlipBookImage_SetCurrentFrame");
static_assert(offsetof(TLFlipBookImage_SetCurrentFrame, Frame) == 0x000000, "Member 'TLFlipBookImage_SetCurrentFrame::Frame' has a wrong offset!");

// Function TLUI.TLFlipBookImage.SetFlipbookFromSoftObjectPath
// 0x0018 (0x0018 - 0x0000)
struct TLFlipBookImage_SetFlipbookFromSoftObjectPath final
{
public:
