#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tutorial_Master03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TLClient_classes.hpp"
#include "TLScheme_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tutorial_Master03.Tutorial_Master03_C
// 0x0020 (0x06E0 - 0x06C0)
class UTutorial_Master03_C final : public UTLTutorialConditionObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Cooldown;                                          // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                In_World_Context_Object;                           // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                In_World_Context_Object_0;                         // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tutorial_Master03(int32 EntryPoint);
	void OnMyPcTeleportComplete_Event_0();
	void OnCreate();
	void TLMap_pt0___(class FName CheckRowName, class FName* CheckName, int32* CheckUID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tutorial_Master03_C">();
	}
	static class UTutorial_Master03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorial_Master03_C>();
	}
};
static_assert(alignof(UTutorial_Master03_C) == 0x000008, "Wrong alignment on UTutorial_Master03_C");
static_assert(sizeof(UTutorial_Master03_C) == 0x0006E0, "Wrong size on UTutorial_Master03_C");
static_assert(offsetof(UTutorial_Master03_C, UberGraphFrame) == 0x0006C0, "Member 'UTutorial_Master03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTutorial_Master03_C, Cooldown) == 0x0006C8, "Member 'UTutorial_Master03_C::Cooldown' has a wrong offset!");
static_assert(offsetof(UTutorial_Master03_C, In_World_Context_Object) == 0x0006D0, "Member 'UTutorial_Master03_C::In_World_Context_Object' has a wrong offset!");
static_assert(offsetof(UTutorial_Master03_C, In_World_Context_Object_0) == 0x0006D8, "Member 'UTutorial_Master03_C::In_World_Context_Object_0' has a wrong offset!");

}

