#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tutorial_Master03

#include "Basic.hpp"

#include "TLScheme_structs.hpp"


namespace SDK::Params
{

// Function Tutorial_Master03.Tutorial_Master03_C.ExecuteUbergraph_Tutorial_Master03
// 0x0048 (0x0048 - 0x0000)
struct Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETLUIPlatform                                 CallFunc_GetUIPlatform_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_TLMap________CheckName;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TLMap________CheckUID;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_TLMap________CheckName_1;                 // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TLMap________CheckUID_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCheckCurrentMapId_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCheckCurrentMapId_ReturnValue_1;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPcPlatformType                               CallFunc_GetMyPlatformType_ReturnValue;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03) == 0x000004, "Wrong alignment on Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03");
static_assert(sizeof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03) == 0x000048, "Wrong size on Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, EntryPoint) == 0x000000, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_GetUIPlatform_ReturnValue) == 0x000004, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_GetUIPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, K2Node_MultiGate_FirstRun) == 0x000019, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, K2Node_MultiGate_Data) == 0x00001C, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::K2Node_MultiGate_Data' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, K2Node_MultiGate_ScratchBool) == 0x000020, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, K2Node_MultiGate_ScratchIndex) == 0x000024, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::K2Node_MultiGate_ScratchIndex' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_TLMap________CheckName) == 0x000028, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_TLMap________CheckName' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_TLMap________CheckUID) == 0x000030, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_TLMap________CheckUID' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_TLMap________CheckName_1) == 0x000034, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_TLMap________CheckName_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_TLMap________CheckUID_1) == 0x00003C, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_TLMap________CheckUID_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_IsCheckCurrentMapId_ReturnValue) == 0x000040, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_IsCheckCurrentMapId_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_IsCheckCurrentMapId_ReturnValue_1) == 0x000041, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_IsCheckCurrentMapId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_GetMyPlatformType_ReturnValue) == 0x000042, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_GetMyPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, K2Node_SwitchEnum_CmpSuccess_1) == 0x000044, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000045, "Member 'Tutorial_Master03_C_ExecuteUbergraph_Tutorial_Master03::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function Tutorial_Master03.Tutorial_Master03_C.TLMap pt0 Äù
// 0x0140 (0x0140 - 0x0000)
struct Tutorial_Master03_C_TLMap_pt0___ final
{
public:
	class FName                                   CheckRowName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CheckName;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheckUID;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTLSchemeMap                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0100)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Master03_C_TLMap_pt0___) == 0x000008, "Wrong alignment on Tutorial_Master03_C_TLMap_pt0___");
static_assert(sizeof(Tutorial_Master03_C_TLMap_pt0___) == 0x000140, "Wrong size on Tutorial_Master03_C_TLMap_pt0___");
static_assert(offsetof(Tutorial_Master03_C_TLMap_pt0___, CheckRowName) == 0x000000, "Member 'Tutorial_Master03_C_TLMap_pt0___::CheckRowName' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_TLMap_pt0___, CheckName) == 0x000008, "Member 'Tutorial_Master03_C_TLMap_pt0___::CheckName' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_TLMap_pt0___, CheckUID) == 0x000010, "Member 'Tutorial_Master03_C_TLMap_pt0___::CheckUID' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_TLMap_pt0___, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'Tutorial_Master03_C_TLMap_pt0___::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_TLMap_pt0___, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'Tutorial_Master03_C_TLMap_pt0___::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_TLMap_pt0___, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000128, "Member 'Tutorial_Master03_C_TLMap_pt0___::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Master03_C_TLMap_pt0___, CallFunc_Concat_StrStr_ReturnValue) == 0x000130, "Member 'Tutorial_Master03_C_TLMap_pt0___::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

